Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xcde (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x33617): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xad005): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xc31a): /Users/sandeep/Documents/github-projects/frtos/free-rtos/first_project/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x6150b): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x38ff5): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 7 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xbb71e): unsigned char
 <1><44>: Abbrev Number: 7 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x90694): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x9e514): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 7 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xb9f8f): short unsigned int
 <1><5e>: Abbrev Number: 7 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xff1a): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x7ba0a): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 7 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4a8ac): long unsigned int
 <1><78>: Abbrev Number: 7 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x58d87): long long int
 <1><7f>: Abbrev Number: 7 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x28f01): long long unsigned int
 <1><86>: Abbrev Number: 25 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 7 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xf619): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x38ff7): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0xcb76f): uint16_t
    <a5>   DW_AT_decl_file   : 4
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xce185): uint32_t
    <b1>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 15 (DW_TAG_array_type)
    <be>   DW_AT_type        : <0xac>
    <c2>   DW_AT_sibling     : <0xcd>
 <2><c6>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <c7>   DW_AT_type        : <0x8d>
    <cb>   DW_AT_upper_bound : 1
 <2><cc>: Abbrev Number: 0
 <1><cd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ce>   DW_AT_byte_size   : 24
    <cf>   DW_AT_decl_file   : 5
    <d0>   DW_AT_decl_line   : 345
    <d2>   DW_AT_decl_column : 9
    <d2>   DW_AT_sibling     : <0x124>
 <2><d6>: Abbrev Number: 4 (DW_TAG_member)
    <d7>   DW_AT_name        : CR
    <da>   DW_AT_decl_file   : 5
    <da>   DW_AT_decl_line   : 347
    <dc>   DW_AT_decl_column : 17
    <dc>   DW_AT_type        : <0xb8>
    <e0>   DW_AT_data_member_location: 0
 <2><e1>: Abbrev Number: 1 (DW_TAG_member)
    <e2>   DW_AT_name        : (indirect string, offset: 0x4a12a): NDTR
    <e6>   DW_AT_decl_file   : 5
    <e7>   DW_AT_decl_line   : 348
    <e9>   DW_AT_decl_column : 17
    <ea>   DW_AT_type        : <0xb8>
    <ee>   DW_AT_data_member_location: 4
 <2><ef>: Abbrev Number: 4 (DW_TAG_member)
    <f0>   DW_AT_name        : PAR
    <f4>   DW_AT_decl_file   : 5
    <f4>   DW_AT_decl_line   : 349
    <f6>   DW_AT_decl_column : 17
    <f6>   DW_AT_type        : <0xb8>
    <fa>   DW_AT_data_member_location: 8
 <2><fb>: Abbrev Number: 1 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x50ed2): M0AR
    <100>   DW_AT_decl_file   : 5
    <101>   DW_AT_decl_line   : 350
    <103>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xb8>
    <108>   DW_AT_data_member_location: 12
 <2><109>: Abbrev Number: 1 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x6b8aa): M1AR
    <10e>   DW_AT_decl_file   : 5
    <10f>   DW_AT_decl_line   : 351
    <111>   DW_AT_decl_column : 17
    <112>   DW_AT_type        : <0xb8>
    <116>   DW_AT_data_member_location: 16
 <2><117>: Abbrev Number: 4 (DW_TAG_member)
    <118>   DW_AT_name        : FCR
    <11c>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 352
    <11e>   DW_AT_decl_column : 17
    <11e>   DW_AT_type        : <0xb8>
    <122>   DW_AT_data_member_location: 20
 <2><123>: Abbrev Number: 0
 <1><124>: Abbrev Number: 8 (DW_TAG_typedef)
    <125>   DW_AT_name        : (indirect string, offset: 0xb0236): DMA_Stream_TypeDef
    <129>   DW_AT_decl_file   : 5
    <12a>   DW_AT_decl_line   : 353
    <12c>   DW_AT_decl_column : 3
    <12c>   DW_AT_type        : <0xcd>
 <1><130>: Abbrev Number: 12 (DW_TAG_structure_type)
    <131>   DW_AT_byte_size   : 40
    <132>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 526
    <135>   DW_AT_decl_column : 9
    <135>   DW_AT_sibling     : <0x1b2>
 <2><139>: Abbrev Number: 1 (DW_TAG_member)
    <13a>   DW_AT_name        : (indirect string, offset: 0x7e2e6): MODER
    <13e>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 528
    <141>   DW_AT_decl_column : 17
    <142>   DW_AT_type        : <0xb8>
    <146>   DW_AT_data_member_location: 0
 <2><147>: Abbrev Number: 1 (DW_TAG_member)
    <148>   DW_AT_name        : (indirect string, offset: 0x9605e): OTYPER
    <14c>   DW_AT_decl_file   : 5
    <14d>   DW_AT_decl_line   : 529
    <14f>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xb8>
    <154>   DW_AT_data_member_location: 4
 <2><155>: Abbrev Number: 1 (DW_TAG_member)
    <156>   DW_AT_name        : (indirect string, offset: 0xa8b7e): OSPEEDR
    <15a>   DW_AT_decl_file   : 5
    <15b>   DW_AT_decl_line   : 530
    <15d>   DW_AT_decl_column : 17
    <15e>   DW_AT_type        : <0xb8>
    <162>   DW_AT_data_member_location: 8
 <2><163>: Abbrev Number: 1 (DW_TAG_member)
    <164>   DW_AT_name        : (indirect string, offset: 0x70658): PUPDR
    <168>   DW_AT_decl_file   : 5
    <169>   DW_AT_decl_line   : 531
    <16b>   DW_AT_decl_column : 17
    <16c>   DW_AT_type        : <0xb8>
    <170>   DW_AT_data_member_location: 12
 <2><171>: Abbrev Number: 4 (DW_TAG_member)
    <172>   DW_AT_name        : IDR
    <176>   DW_AT_decl_file   : 5
    <176>   DW_AT_decl_line   : 532
    <178>   DW_AT_decl_column : 17
    <178>   DW_AT_type        : <0xb8>
    <17c>   DW_AT_data_member_location: 16
 <2><17d>: Abbrev Number: 4 (DW_TAG_member)
    <17e>   DW_AT_name        : ODR
    <182>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 533
    <184>   DW_AT_decl_column : 17
    <184>   DW_AT_type        : <0xb8>
    <188>   DW_AT_data_member_location: 20
 <2><189>: Abbrev Number: 1 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x2c485): BSRR
    <18e>   DW_AT_decl_file   : 5
    <18f>   DW_AT_decl_line   : 534
    <191>   DW_AT_decl_column : 17
    <192>   DW_AT_type        : <0xb8>
    <196>   DW_AT_data_member_location: 24
 <2><197>: Abbrev Number: 1 (DW_TAG_member)
    <198>   DW_AT_name        : (indirect string, offset: 0xa6404): LCKR
    <19c>   DW_AT_decl_file   : 5
    <19d>   DW_AT_decl_line   : 535
    <19f>   DW_AT_decl_column : 17
    <1a0>   DW_AT_type        : <0xb8>
    <1a4>   DW_AT_data_member_location: 28
 <2><1a5>: Abbrev Number: 4 (DW_TAG_member)
    <1a6>   DW_AT_name        : AFR
    <1aa>   DW_AT_decl_file   : 5
    <1aa>   DW_AT_decl_line   : 536
    <1ac>   DW_AT_decl_column : 17
    <1ac>   DW_AT_type        : <0x1c2>
    <1b0>   DW_AT_data_member_location: 32
 <2><1b1>: Abbrev Number: 0
 <1><1b2>: Abbrev Number: 15 (DW_TAG_array_type)
    <1b3>   DW_AT_type        : <0xb8>
    <1b7>   DW_AT_sibling     : <0x1c2>
 <2><1bb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1bc>   DW_AT_type        : <0x8d>
    <1c0>   DW_AT_upper_bound : 1
 <2><1c1>: Abbrev Number: 0
 <1><1c2>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <1c3>   DW_AT_type        : <0x1b2>
 <1><1c7>: Abbrev Number: 8 (DW_TAG_typedef)
    <1c8>   DW_AT_name        : (indirect string, offset: 0xbc80a): GPIO_TypeDef
    <1cc>   DW_AT_decl_file   : 5
    <1cd>   DW_AT_decl_line   : 537
    <1cf>   DW_AT_decl_column : 3
    <1cf>   DW_AT_type        : <0x130>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1d4>   DW_AT_byte_size   : 8
    <1d5>   DW_AT_decl_file   : 5
    <1d6>   DW_AT_decl_line   : 586
    <1d8>   DW_AT_decl_column : 9
    <1d8>   DW_AT_sibling     : <0x1f4>
 <2><1dc>: Abbrev Number: 4 (DW_TAG_member)
    <1dd>   DW_AT_name        : CR
    <1e0>   DW_AT_decl_file   : 5
    <1e0>   DW_AT_decl_line   : 588
    <1e2>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0xb8>
    <1e6>   DW_AT_data_member_location: 0
 <2><1e7>: Abbrev Number: 4 (DW_TAG_member)
    <1e8>   DW_AT_name        : CSR
    <1ec>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 589
    <1ee>   DW_AT_decl_column : 17
    <1ee>   DW_AT_type        : <0xb8>
    <1f2>   DW_AT_data_member_location: 4
 <2><1f3>: Abbrev Number: 0
 <1><1f4>: Abbrev Number: 8 (DW_TAG_typedef)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x8bfa7): PWR_TypeDef
    <1f9>   DW_AT_decl_file   : 5
    <1fa>   DW_AT_decl_line   : 590
    <1fc>   DW_AT_decl_column : 3
    <1fc>   DW_AT_type        : <0x1d3>
 <1><200>: Abbrev Number: 12 (DW_TAG_structure_type)
    <201>   DW_AT_byte_size   : 136
    <202>   DW_AT_decl_file   : 5
    <203>   DW_AT_decl_line   : 596
    <205>   DW_AT_decl_column : 9
    <205>   DW_AT_sibling     : <0x3a7>
 <2><209>: Abbrev Number: 4 (DW_TAG_member)
    <20a>   DW_AT_name        : CR
    <20d>   DW_AT_decl_file   : 5
    <20d>   DW_AT_decl_line   : 598
    <20f>   DW_AT_decl_column : 17
    <20f>   DW_AT_type        : <0xb8>
    <213>   DW_AT_data_member_location: 0
 <2><214>: Abbrev Number: 1 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x876fd): PLLCFGR
    <219>   DW_AT_decl_file   : 5
    <21a>   DW_AT_decl_line   : 599
    <21c>   DW_AT_decl_column : 17
    <21d>   DW_AT_type        : <0xb8>
    <221>   DW_AT_data_member_location: 4
 <2><222>: Abbrev Number: 1 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x87700): CFGR
    <227>   DW_AT_decl_file   : 5
    <228>   DW_AT_decl_line   : 600
    <22a>   DW_AT_decl_column : 17
    <22b>   DW_AT_type        : <0xb8>
    <22f>   DW_AT_data_member_location: 8
 <2><230>: Abbrev Number: 4 (DW_TAG_member)
    <231>   DW_AT_name        : CIR
    <235>   DW_AT_decl_file   : 5
    <235>   DW_AT_decl_line   : 601
    <237>   DW_AT_decl_column : 17
    <237>   DW_AT_type        : <0xb8>
    <23b>   DW_AT_data_member_location: 12
 <2><23c>: Abbrev Number: 1 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x9a57d): AHB1RSTR
    <241>   DW_AT_decl_file   : 5
    <242>   DW_AT_decl_line   : 602
    <244>   DW_AT_decl_column : 17
    <245>   DW_AT_type        : <0xb8>
    <249>   DW_AT_data_member_location: 16
 <2><24a>: Abbrev Number: 1 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x15b65): AHB2RSTR
    <24f>   DW_AT_decl_file   : 5
    <250>   DW_AT_decl_line   : 603
    <252>   DW_AT_decl_column : 17
    <253>   DW_AT_type        : <0xb8>
    <257>   DW_AT_data_member_location: 20
 <2><258>: Abbrev Number: 1 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x405e8): AHB3RSTR
    <25d>   DW_AT_decl_file   : 5
    <25e>   DW_AT_decl_line   : 604
    <260>   DW_AT_decl_column : 17
    <261>   DW_AT_type        : <0xb8>
    <265>   DW_AT_data_member_location: 24
 <2><266>: Abbrev Number: 1 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0xb7082): RESERVED0
    <26b>   DW_AT_decl_file   : 5
    <26c>   DW_AT_decl_line   : 605
    <26e>   DW_AT_decl_column : 17
    <26f>   DW_AT_type        : <0xac>
    <273>   DW_AT_data_member_location: 28
 <2><274>: Abbrev Number: 1 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x156de): APB1RSTR
    <279>   DW_AT_decl_file   : 5
    <27a>   DW_AT_decl_line   : 606
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xb8>
    <281>   DW_AT_data_member_location: 32
 <2><282>: Abbrev Number: 1 (DW_TAG_member)
    <283>   DW_AT_name        : (indirect string, offset: 0x5450f): APB2RSTR
    <287>   DW_AT_decl_file   : 5
    <288>   DW_AT_decl_line   : 607
    <28a>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0xb8>
    <28f>   DW_AT_data_member_location: 36
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xb708c): RESERVED1
    <295>   DW_AT_decl_file   : 5
    <296>   DW_AT_decl_line   : 608
    <298>   DW_AT_decl_column : 17
    <299>   DW_AT_type        : <0xbd>
    <29d>   DW_AT_data_member_location: 40
 <2><29e>: Abbrev Number: 1 (DW_TAG_member)
    <29f>   DW_AT_name        : (indirect string, offset: 0xf5ae): AHB1ENR
    <2a3>   DW_AT_decl_file   : 5
    <2a4>   DW_AT_decl_line   : 609
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0xb8>
    <2ab>   DW_AT_data_member_location: 48
 <2><2ac>: Abbrev Number: 1 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x340eb): AHB2ENR
    <2b1>   DW_AT_decl_file   : 5
    <2b2>   DW_AT_decl_line   : 610
    <2b4>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xb8>
    <2b9>   DW_AT_data_member_location: 52
 <2><2ba>: Abbrev Number: 1 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x57584): AHB3ENR
    <2bf>   DW_AT_decl_file   : 5
    <2c0>   DW_AT_decl_line   : 611
    <2c2>   DW_AT_decl_column : 17
    <2c3>   DW_AT_type        : <0xb8>
    <2c7>   DW_AT_data_member_location: 56
 <2><2c8>: Abbrev Number: 1 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0xb7096): RESERVED2
    <2cd>   DW_AT_decl_file   : 5
    <2ce>   DW_AT_decl_line   : 612
    <2d0>   DW_AT_decl_column : 17
    <2d1>   DW_AT_type        : <0xac>
    <2d5>   DW_AT_data_member_location: 60
 <2><2d6>: Abbrev Number: 1 (DW_TAG_member)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x6f7e8): APB1ENR
    <2db>   DW_AT_decl_file   : 5
    <2dc>   DW_AT_decl_line   : 613
    <2de>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0xb8>
    <2e3>   DW_AT_data_member_location: 64
 <2><2e4>: Abbrev Number: 1 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x16c94): APB2ENR
    <2e9>   DW_AT_decl_file   : 5
    <2ea>   DW_AT_decl_line   : 614
    <2ec>   DW_AT_decl_column : 17
    <2ed>   DW_AT_type        : <0xb8>
    <2f1>   DW_AT_data_member_location: 68
 <2><2f2>: Abbrev Number: 1 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0xb70a0): RESERVED3
    <2f7>   DW_AT_decl_file   : 5
    <2f8>   DW_AT_decl_line   : 615
    <2fa>   DW_AT_decl_column : 17
    <2fb>   DW_AT_type        : <0xbd>
    <2ff>   DW_AT_data_member_location: 72
 <2><300>: Abbrev Number: 1 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0x9e399): AHB1LPENR
    <305>   DW_AT_decl_file   : 5
    <306>   DW_AT_decl_line   : 616
    <308>   DW_AT_decl_column : 17
    <309>   DW_AT_type        : <0xb8>
    <30d>   DW_AT_data_member_location: 80
 <2><30e>: Abbrev Number: 1 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x2c0d6): AHB2LPENR
    <313>   DW_AT_decl_file   : 5
    <314>   DW_AT_decl_line   : 617
    <316>   DW_AT_decl_column : 17
    <317>   DW_AT_type        : <0xb8>
    <31b>   DW_AT_data_member_location: 84
 <2><31c>: Abbrev Number: 1 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x82f27): AHB3LPENR
    <321>   DW_AT_decl_file   : 5
    <322>   DW_AT_decl_line   : 618
    <324>   DW_AT_decl_column : 17
    <325>   DW_AT_type        : <0xb8>
    <329>   DW_AT_data_member_location: 88
 <2><32a>: Abbrev Number: 1 (DW_TAG_member)
    <32b>   DW_AT_name        : (indirect string, offset: 0xb70aa): RESERVED4
    <32f>   DW_AT_decl_file   : 5
    <330>   DW_AT_decl_line   : 619
    <332>   DW_AT_decl_column : 17
    <333>   DW_AT_type        : <0xac>
    <337>   DW_AT_data_member_location: 92
 <2><338>: Abbrev Number: 1 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0xa2df6): APB1LPENR
    <33d>   DW_AT_decl_file   : 5
    <33e>   DW_AT_decl_line   : 620
    <340>   DW_AT_decl_column : 17
    <341>   DW_AT_type        : <0xb8>
    <345>   DW_AT_data_member_location: 96
 <2><346>: Abbrev Number: 1 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x31bf5): APB2LPENR
    <34b>   DW_AT_decl_file   : 5
    <34c>   DW_AT_decl_line   : 621
    <34e>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0xb8>
    <353>   DW_AT_data_member_location: 100
 <2><354>: Abbrev Number: 1 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xb70b4): RESERVED5
    <359>   DW_AT_decl_file   : 5
    <35a>   DW_AT_decl_line   : 622
    <35c>   DW_AT_decl_column : 17
    <35d>   DW_AT_type        : <0xbd>
    <361>   DW_AT_data_member_location: 104
 <2><362>: Abbrev Number: 1 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x1b05c): BDCR
    <367>   DW_AT_decl_file   : 5
    <368>   DW_AT_decl_line   : 623
    <36a>   DW_AT_decl_column : 17
    <36b>   DW_AT_type        : <0xb8>
    <36f>   DW_AT_data_member_location: 112
 <2><370>: Abbrev Number: 4 (DW_TAG_member)
    <371>   DW_AT_name        : CSR
    <375>   DW_AT_decl_file   : 5
    <375>   DW_AT_decl_line   : 624
    <377>   DW_AT_decl_column : 17
    <377>   DW_AT_type        : <0xb8>
    <37b>   DW_AT_data_member_location: 116
 <2><37c>: Abbrev Number: 1 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x73cf6): RESERVED6
    <381>   DW_AT_decl_file   : 5
    <382>   DW_AT_decl_line   : 625
    <384>   DW_AT_decl_column : 17
    <385>   DW_AT_type        : <0xbd>
    <389>   DW_AT_data_member_location: 120
 <2><38a>: Abbrev Number: 1 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x66f88): SSCGR
    <38f>   DW_AT_decl_file   : 5
    <390>   DW_AT_decl_line   : 626
    <392>   DW_AT_decl_column : 17
    <393>   DW_AT_type        : <0xb8>
    <397>   DW_AT_data_member_location: 128
 <2><398>: Abbrev Number: 1 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0x40f0c): PLLI2SCFGR
    <39d>   DW_AT_decl_file   : 5
    <39e>   DW_AT_decl_line   : 627
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0xb8>
    <3a5>   DW_AT_data_member_location: 132
 <2><3a6>: Abbrev Number: 0
 <1><3a7>: Abbrev Number: 8 (DW_TAG_typedef)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x5a178): RCC_TypeDef
    <3ac>   DW_AT_decl_file   : 5
    <3ad>   DW_AT_decl_line   : 628
    <3af>   DW_AT_decl_column : 3
    <3af>   DW_AT_type        : <0x200>
 <1><3b3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <3b4>   DW_AT_byte_size   : 84
    <3b5>   DW_AT_decl_file   : 5
    <3b6>   DW_AT_decl_line   : 728
    <3b8>   DW_AT_decl_column : 9
    <3b8>   DW_AT_sibling     : <0x4cd>
 <2><3bc>: Abbrev Number: 4 (DW_TAG_member)
    <3bd>   DW_AT_name        : CR1
    <3c1>   DW_AT_decl_file   : 5
    <3c1>   DW_AT_decl_line   : 730
    <3c3>   DW_AT_decl_column : 17
    <3c3>   DW_AT_type        : <0xb8>
    <3c7>   DW_AT_data_member_location: 0
 <2><3c8>: Abbrev Number: 4 (DW_TAG_member)
    <3c9>   DW_AT_name        : CR2
    <3cd>   DW_AT_decl_file   : 5
    <3cd>   DW_AT_decl_line   : 731
    <3cf>   DW_AT_decl_column : 17
    <3cf>   DW_AT_type        : <0xb8>
    <3d3>   DW_AT_data_member_location: 4
 <2><3d4>: Abbrev Number: 1 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x39781): SMCR
    <3d9>   DW_AT_decl_file   : 5
    <3da>   DW_AT_decl_line   : 732
    <3dc>   DW_AT_decl_column : 17
    <3dd>   DW_AT_type        : <0xb8>
    <3e1>   DW_AT_data_member_location: 8
 <2><3e2>: Abbrev Number: 1 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x3f661): DIER
    <3e7>   DW_AT_decl_file   : 5
    <3e8>   DW_AT_decl_line   : 733
    <3ea>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0xb8>
    <3ef>   DW_AT_data_member_location: 12
 <2><3f0>: Abbrev Number: 4 (DW_TAG_member)
    <3f1>   DW_AT_name        : SR
    <3f4>   DW_AT_decl_file   : 5
    <3f4>   DW_AT_decl_line   : 734
    <3f6>   DW_AT_decl_column : 17
    <3f6>   DW_AT_type        : <0xb8>
    <3fa>   DW_AT_data_member_location: 16
 <2><3fb>: Abbrev Number: 4 (DW_TAG_member)
    <3fc>   DW_AT_name        : EGR
    <400>   DW_AT_decl_file   : 5
    <400>   DW_AT_decl_line   : 735
    <402>   DW_AT_decl_column : 17
    <402>   DW_AT_type        : <0xb8>
    <406>   DW_AT_data_member_location: 20
 <2><407>: Abbrev Number: 1 (DW_TAG_member)
    <408>   DW_AT_name        : (indirect string, offset: 0xb0f9f): CCMR1
    <40c>   DW_AT_decl_file   : 5
    <40d>   DW_AT_decl_line   : 736
    <40f>   DW_AT_decl_column : 17
    <410>   DW_AT_type        : <0xb8>
    <414>   DW_AT_data_member_location: 24
 <2><415>: Abbrev Number: 1 (DW_TAG_member)
    <416>   DW_AT_name        : (indirect string, offset: 0x4dcc5): CCMR2
    <41a>   DW_AT_decl_file   : 5
    <41b>   DW_AT_decl_line   : 737
    <41d>   DW_AT_decl_column : 17
    <41e>   DW_AT_type        : <0xb8>
    <422>   DW_AT_data_member_location: 28
 <2><423>: Abbrev Number: 1 (DW_TAG_member)
    <424>   DW_AT_name        : (indirect string, offset: 0x2fb6b): CCER
    <428>   DW_AT_decl_file   : 5
    <429>   DW_AT_decl_line   : 738
    <42b>   DW_AT_decl_column : 17
    <42c>   DW_AT_type        : <0xb8>
    <430>   DW_AT_data_member_location: 32
 <2><431>: Abbrev Number: 4 (DW_TAG_member)
    <432>   DW_AT_name        : CNT
    <436>   DW_AT_decl_file   : 5
    <436>   DW_AT_decl_line   : 739
    <438>   DW_AT_decl_column : 17
    <438>   DW_AT_type        : <0xb8>
    <43c>   DW_AT_data_member_location: 36
 <2><43d>: Abbrev Number: 4 (DW_TAG_member)
    <43e>   DW_AT_name        : PSC
    <442>   DW_AT_decl_file   : 5
    <442>   DW_AT_decl_line   : 740
    <444>   DW_AT_decl_column : 17
    <444>   DW_AT_type        : <0xb8>
    <448>   DW_AT_data_member_location: 40
 <2><449>: Abbrev Number: 4 (DW_TAG_member)
    <44a>   DW_AT_name        : ARR
    <44e>   DW_AT_decl_file   : 5
    <44e>   DW_AT_decl_line   : 741
    <450>   DW_AT_decl_column : 17
    <450>   DW_AT_type        : <0xb8>
    <454>   DW_AT_data_member_location: 44
 <2><455>: Abbrev Number: 4 (DW_TAG_member)
    <456>   DW_AT_name        : RCR
    <45a>   DW_AT_decl_file   : 5
    <45a>   DW_AT_decl_line   : 742
    <45c>   DW_AT_decl_column : 17
    <45c>   DW_AT_type        : <0xb8>
    <460>   DW_AT_data_member_location: 48
 <2><461>: Abbrev Number: 1 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0x16c8f): CCR1
    <466>   DW_AT_decl_file   : 5
    <467>   DW_AT_decl_line   : 743
    <469>   DW_AT_decl_column : 17
    <46a>   DW_AT_type        : <0xb8>
    <46e>   DW_AT_data_member_location: 52
 <2><46f>: Abbrev Number: 1 (DW_TAG_member)
    <470>   DW_AT_name        : (indirect string, offset: 0x51a35): CCR2
    <474>   DW_AT_decl_file   : 5
    <475>   DW_AT_decl_line   : 744
    <477>   DW_AT_decl_column : 17
    <478>   DW_AT_type        : <0xb8>
    <47c>   DW_AT_data_member_location: 56
 <2><47d>: Abbrev Number: 1 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x9411c): CCR3
    <482>   DW_AT_decl_file   : 5
    <483>   DW_AT_decl_line   : 745
    <485>   DW_AT_decl_column : 17
    <486>   DW_AT_type        : <0xb8>
    <48a>   DW_AT_data_member_location: 60
 <2><48b>: Abbrev Number: 1 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0xbd68): CCR4
    <490>   DW_AT_decl_file   : 5
    <491>   DW_AT_decl_line   : 746
    <493>   DW_AT_decl_column : 17
    <494>   DW_AT_type        : <0xb8>
    <498>   DW_AT_data_member_location: 64
 <2><499>: Abbrev Number: 1 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x842af): BDTR
    <49e>   DW_AT_decl_file   : 5
    <49f>   DW_AT_decl_line   : 747
    <4a1>   DW_AT_decl_column : 17
    <4a2>   DW_AT_type        : <0xb8>
    <4a6>   DW_AT_data_member_location: 68
 <2><4a7>: Abbrev Number: 4 (DW_TAG_member)
    <4a8>   DW_AT_name        : DCR
    <4ac>   DW_AT_decl_file   : 5
    <4ac>   DW_AT_decl_line   : 748
    <4ae>   DW_AT_decl_column : 17
    <4ae>   DW_AT_type        : <0xb8>
    <4b2>   DW_AT_data_member_location: 72
 <2><4b3>: Abbrev Number: 1 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0xa6a03): DMAR
    <4b8>   DW_AT_decl_file   : 5
    <4b9>   DW_AT_decl_line   : 749
    <4bb>   DW_AT_decl_column : 17
    <4bc>   DW_AT_type        : <0xb8>
    <4c0>   DW_AT_data_member_location: 76
 <2><4c1>: Abbrev Number: 4 (DW_TAG_member)
    <4c2>   DW_AT_name        : OR
    <4c5>   DW_AT_decl_file   : 5
    <4c5>   DW_AT_decl_line   : 750
    <4c7>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0xb8>
    <4cb>   DW_AT_data_member_location: 80
 <2><4cc>: Abbrev Number: 0
 <1><4cd>: Abbrev Number: 8 (DW_TAG_typedef)
    <4ce>   DW_AT_name        : (indirect string, offset: 0xb7be4): TIM_TypeDef
    <4d2>   DW_AT_decl_file   : 5
    <4d3>   DW_AT_decl_line   : 751
    <4d5>   DW_AT_decl_column : 3
    <4d5>   DW_AT_type        : <0x3b3>
 <1><4d9>: Abbrev Number: 7 (DW_TAG_base_type)
    <4da>   DW_AT_byte_size   : 8
    <4db>   DW_AT_encoding    : 4	(float)
    <4dc>   DW_AT_name        : (indirect string, offset: 0xc33e0): long double
 <1><4e0>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <4e1>   DW_AT_encoding    : 7	(unsigned)
    <4e1>   DW_AT_byte_size   : 1
    <4e1>   DW_AT_type        : <0x3d>
    <4e5>   DW_AT_decl_file   : 6
    <4e6>   DW_AT_decl_line   : 39
    <4e7>   DW_AT_decl_column : 1
    <4e7>   DW_AT_sibling     : <0x504>
 <2><4eb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x41fcf): HAL_OK
    <4f0>   DW_AT_const_value : 0
 <2><4f1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x797f1): HAL_ERROR
    <4f6>   DW_AT_const_value : 1
 <2><4f7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x22519): HAL_BUSY
    <4fc>   DW_AT_const_value : 2
 <2><4fd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x396ca): HAL_TIMEOUT
    <502>   DW_AT_const_value : 3
 <2><503>: Abbrev Number: 0
 <1><504>: Abbrev Number: 5 (DW_TAG_typedef)
    <505>   DW_AT_name        : (indirect string, offset: 0x2367): HAL_StatusTypeDef
    <509>   DW_AT_decl_file   : 6
    <50a>   DW_AT_decl_line   : 44
    <50b>   DW_AT_decl_column : 3
    <50c>   DW_AT_type        : <0x4e0>
 <1><510>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <511>   DW_AT_encoding    : 7	(unsigned)
    <511>   DW_AT_byte_size   : 1
    <511>   DW_AT_type        : <0x3d>
    <515>   DW_AT_decl_file   : 6
    <516>   DW_AT_decl_line   : 50
    <517>   DW_AT_decl_column : 1
    <517>   DW_AT_sibling     : <0x528>
 <2><51b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <51c>   DW_AT_name        : (indirect string, offset: 0x8f406): HAL_UNLOCKED
    <520>   DW_AT_const_value : 0
 <2><521>: Abbrev Number: 3 (DW_TAG_enumerator)
    <522>   DW_AT_name        : (indirect string, offset: 0xc1db5): HAL_LOCKED
    <526>   DW_AT_const_value : 1
 <2><527>: Abbrev Number: 0
 <1><528>: Abbrev Number: 5 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x72d0d): HAL_LockTypeDef
    <52d>   DW_AT_decl_file   : 6
    <52e>   DW_AT_decl_line   : 53
    <52f>   DW_AT_decl_column : 3
    <530>   DW_AT_type        : <0x510>
 <1><534>: Abbrev Number: 13 (DW_TAG_structure_type)
    <535>   DW_AT_byte_size   : 24
    <536>   DW_AT_decl_file   : 7
    <537>   DW_AT_decl_line   : 45
    <538>   DW_AT_decl_column : 9
    <538>   DW_AT_sibling     : <0x58b>
 <2><53c>: Abbrev Number: 2 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x81ecd): PLLState
    <541>   DW_AT_decl_file   : 7
    <542>   DW_AT_decl_line   : 47
    <543>   DW_AT_decl_column : 12
    <544>   DW_AT_type        : <0xac>
    <548>   DW_AT_data_member_location: 0
 <2><549>: Abbrev Number: 2 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x86526): PLLSource
    <54e>   DW_AT_decl_file   : 7
    <54f>   DW_AT_decl_line   : 50
    <550>   DW_AT_decl_column : 12
    <551>   DW_AT_type        : <0xac>
    <555>   DW_AT_data_member_location: 4
 <2><556>: Abbrev Number: 2 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0xa0aa2): PLLM
    <55b>   DW_AT_decl_file   : 7
    <55c>   DW_AT_decl_line   : 53
    <55d>   DW_AT_decl_column : 12
    <55e>   DW_AT_type        : <0xac>
    <562>   DW_AT_data_member_location: 8
 <2><563>: Abbrev Number: 2 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0xa0aa7): PLLN
    <568>   DW_AT_decl_file   : 7
    <569>   DW_AT_decl_line   : 56
    <56a>   DW_AT_decl_column : 12
    <56b>   DW_AT_type        : <0xac>
    <56f>   DW_AT_data_member_location: 12
 <2><570>: Abbrev Number: 2 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0xa0ac4): PLLP
    <575>   DW_AT_decl_file   : 7
    <576>   DW_AT_decl_line   : 60
    <577>   DW_AT_decl_column : 12
    <578>   DW_AT_type        : <0xac>
    <57c>   DW_AT_data_member_location: 16
 <2><57d>: Abbrev Number: 2 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x48958): PLLQ
    <582>   DW_AT_decl_file   : 7
    <583>   DW_AT_decl_line   : 63
    <584>   DW_AT_decl_column : 12
    <585>   DW_AT_type        : <0xac>
    <589>   DW_AT_data_member_location: 20
 <2><58a>: Abbrev Number: 0
 <1><58b>: Abbrev Number: 5 (DW_TAG_typedef)
    <58c>   DW_AT_name        : (indirect string, offset: 0x7598c): RCC_PLLInitTypeDef
    <590>   DW_AT_decl_file   : 7
    <591>   DW_AT_decl_line   : 73
    <592>   DW_AT_decl_column : 3
    <593>   DW_AT_type        : <0x534>
 <1><597>: Abbrev Number: 13 (DW_TAG_structure_type)
    <598>   DW_AT_byte_size   : 48
    <599>   DW_AT_decl_file   : 8
    <59a>   DW_AT_decl_line   : 49
    <59b>   DW_AT_decl_column : 9
    <59b>   DW_AT_sibling     : <0x5fb>
 <2><59f>: Abbrev Number: 2 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x9de0c): OscillatorType
    <5a4>   DW_AT_decl_file   : 8
    <5a5>   DW_AT_decl_line   : 51
    <5a6>   DW_AT_decl_column : 12
    <5a7>   DW_AT_type        : <0xac>
    <5ab>   DW_AT_data_member_location: 0
 <2><5ac>: Abbrev Number: 2 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x83546): HSEState
    <5b1>   DW_AT_decl_file   : 8
    <5b2>   DW_AT_decl_line   : 54
    <5b3>   DW_AT_decl_column : 12
    <5b4>   DW_AT_type        : <0xac>
    <5b8>   DW_AT_data_member_location: 4
 <2><5b9>: Abbrev Number: 2 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x7a0ea): LSEState
    <5be>   DW_AT_decl_file   : 8
    <5bf>   DW_AT_decl_line   : 57
    <5c0>   DW_AT_decl_column : 12
    <5c1>   DW_AT_type        : <0xac>
    <5c5>   DW_AT_data_member_location: 8
 <2><5c6>: Abbrev Number: 2 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x56cbc): HSIState
    <5cb>   DW_AT_decl_file   : 8
    <5cc>   DW_AT_decl_line   : 60
    <5cd>   DW_AT_decl_column : 12
    <5ce>   DW_AT_type        : <0xac>
    <5d2>   DW_AT_data_member_location: 12
 <2><5d3>: Abbrev Number: 2 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0xa6c0b): HSICalibrationValue
    <5d8>   DW_AT_decl_file   : 8
    <5d9>   DW_AT_decl_line   : 63
    <5da>   DW_AT_decl_column : 12
    <5db>   DW_AT_type        : <0xac>
    <5df>   DW_AT_data_member_location: 16
 <2><5e0>: Abbrev Number: 2 (DW_TAG_member)
    <5e1>   DW_AT_name        : (indirect string, offset: 0x4473e): LSIState
    <5e5>   DW_AT_decl_file   : 8
    <5e6>   DW_AT_decl_line   : 66
    <5e7>   DW_AT_decl_column : 12
    <5e8>   DW_AT_type        : <0xac>
    <5ec>   DW_AT_data_member_location: 20
 <2><5ed>: Abbrev Number: 19 (DW_TAG_member)
    <5ee>   DW_AT_name        : PLL
    <5f2>   DW_AT_decl_file   : 8
    <5f3>   DW_AT_decl_line   : 69
    <5f4>   DW_AT_decl_column : 22
    <5f5>   DW_AT_type        : <0x58b>
    <5f9>   DW_AT_data_member_location: 24
 <2><5fa>: Abbrev Number: 0
 <1><5fb>: Abbrev Number: 5 (DW_TAG_typedef)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x6757a): RCC_OscInitTypeDef
    <600>   DW_AT_decl_file   : 8
    <601>   DW_AT_decl_line   : 70
    <602>   DW_AT_decl_column : 3
    <603>   DW_AT_type        : <0x597>
 <1><607>: Abbrev Number: 13 (DW_TAG_structure_type)
    <608>   DW_AT_byte_size   : 20
    <609>   DW_AT_decl_file   : 8
    <60a>   DW_AT_decl_line   : 75
    <60b>   DW_AT_decl_column : 9
    <60b>   DW_AT_sibling     : <0x651>
 <2><60f>: Abbrev Number: 2 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x3bee9): ClockType
    <614>   DW_AT_decl_file   : 8
    <615>   DW_AT_decl_line   : 77
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xac>
    <61b>   DW_AT_data_member_location: 0
 <2><61c>: Abbrev Number: 2 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x75423): SYSCLKSource
    <621>   DW_AT_decl_file   : 8
    <622>   DW_AT_decl_line   : 80
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xac>
    <628>   DW_AT_data_member_location: 4
 <2><629>: Abbrev Number: 2 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0xa0508): AHBCLKDivider
    <62e>   DW_AT_decl_file   : 8
    <62f>   DW_AT_decl_line   : 83
    <630>   DW_AT_decl_column : 12
    <631>   DW_AT_type        : <0xac>
    <635>   DW_AT_data_member_location: 8
 <2><636>: Abbrev Number: 2 (DW_TAG_member)
    <637>   DW_AT_name        : (indirect string, offset: 0x73b4): APB1CLKDivider
    <63b>   DW_AT_decl_file   : 8
    <63c>   DW_AT_decl_line   : 86
    <63d>   DW_AT_decl_column : 12
    <63e>   DW_AT_type        : <0xac>
    <642>   DW_AT_data_member_location: 12
 <2><643>: Abbrev Number: 2 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x59375): APB2CLKDivider
    <648>   DW_AT_decl_file   : 8
    <649>   DW_AT_decl_line   : 89
    <64a>   DW_AT_decl_column : 12
    <64b>   DW_AT_type        : <0xac>
    <64f>   DW_AT_data_member_location: 16
 <2><650>: Abbrev Number: 0
 <1><651>: Abbrev Number: 5 (DW_TAG_typedef)
    <652>   DW_AT_name        : (indirect string, offset: 0x876ea): RCC_ClkInitTypeDef
    <656>   DW_AT_decl_file   : 8
    <657>   DW_AT_decl_line   : 92
    <658>   DW_AT_decl_column : 3
    <659>   DW_AT_type        : <0x607>
 <1><65d>: Abbrev Number: 13 (DW_TAG_structure_type)
    <65e>   DW_AT_byte_size   : 20
    <65f>   DW_AT_decl_file   : 9
    <660>   DW_AT_decl_line   : 46
    <661>   DW_AT_decl_column : 9
    <661>   DW_AT_sibling     : <0x6a7>
 <2><665>: Abbrev Number: 19 (DW_TAG_member)
    <666>   DW_AT_name        : Pin
    <66a>   DW_AT_decl_file   : 9
    <66b>   DW_AT_decl_line   : 48
    <66c>   DW_AT_decl_column : 12
    <66d>   DW_AT_type        : <0xac>
    <671>   DW_AT_data_member_location: 0
 <2><672>: Abbrev Number: 2 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0xc9cd0): Mode
    <677>   DW_AT_decl_file   : 9
    <678>   DW_AT_decl_line   : 51
    <679>   DW_AT_decl_column : 12
    <67a>   DW_AT_type        : <0xac>
    <67e>   DW_AT_data_member_location: 4
 <2><67f>: Abbrev Number: 2 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0x63fb6): Pull
    <684>   DW_AT_decl_file   : 9
    <685>   DW_AT_decl_line   : 54
    <686>   DW_AT_decl_column : 12
    <687>   DW_AT_type        : <0xac>
    <68b>   DW_AT_data_member_location: 8
 <2><68c>: Abbrev Number: 2 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x720e5): Speed
    <691>   DW_AT_decl_file   : 9
    <692>   DW_AT_decl_line   : 57
    <693>   DW_AT_decl_column : 12
    <694>   DW_AT_type        : <0xac>
    <698>   DW_AT_data_member_location: 12
 <2><699>: Abbrev Number: 2 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0x59336): Alternate
    <69e>   DW_AT_decl_file   : 9
    <69f>   DW_AT_decl_line   : 60
    <6a0>   DW_AT_decl_column : 12
    <6a1>   DW_AT_type        : <0xac>
    <6a5>   DW_AT_data_member_location: 16
 <2><6a6>: Abbrev Number: 0
 <1><6a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <6a8>   DW_AT_name        : (indirect string, offset: 0x97b44): GPIO_InitTypeDef
    <6ac>   DW_AT_decl_file   : 9
    <6ad>   DW_AT_decl_line   : 62
    <6ae>   DW_AT_decl_column : 2
    <6af>   DW_AT_type        : <0x65d>
 <1><6b3>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <6b4>   DW_AT_encoding    : 7	(unsigned)
    <6b4>   DW_AT_byte_size   : 1
    <6b4>   DW_AT_type        : <0x3d>
    <6b8>   DW_AT_decl_file   : 9
    <6b9>   DW_AT_decl_line   : 68
    <6ba>   DW_AT_decl_column : 1
    <6ba>   DW_AT_sibling     : <0x6cb>
 <2><6be>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x28a89): GPIO_PIN_RESET
    <6c3>   DW_AT_const_value : 0
 <2><6c4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x31778): GPIO_PIN_SET
    <6c9>   DW_AT_const_value : 1
 <2><6ca>: Abbrev Number: 0
 <1><6cb>: Abbrev Number: 5 (DW_TAG_typedef)
    <6cc>   DW_AT_name        : (indirect string, offset: 0xbeb0e): GPIO_PinState
    <6d0>   DW_AT_decl_file   : 9
    <6d1>   DW_AT_decl_line   : 71
    <6d2>   DW_AT_decl_column : 2
    <6d3>   DW_AT_type        : <0x6b3>
 <1><6d7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6d8>   DW_AT_byte_size   : 48
    <6d9>   DW_AT_decl_file   : 10
    <6da>   DW_AT_decl_line   : 48
    <6db>   DW_AT_decl_column : 9
    <6db>   DW_AT_sibling     : <0x77c>
 <2><6df>: Abbrev Number: 2 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x64fdf): Channel
    <6e4>   DW_AT_decl_file   : 10
    <6e5>   DW_AT_decl_line   : 50
    <6e6>   DW_AT_decl_column : 12
    <6e7>   DW_AT_type        : <0xac>
    <6eb>   DW_AT_data_member_location: 0
 <2><6ec>: Abbrev Number: 2 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x485c4): Direction
    <6f1>   DW_AT_decl_file   : 10
    <6f2>   DW_AT_decl_line   : 53
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0xac>
    <6f8>   DW_AT_data_member_location: 4
 <2><6f9>: Abbrev Number: 2 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xc886): PeriphInc
    <6fe>   DW_AT_decl_file   : 10
    <6ff>   DW_AT_decl_line   : 57
    <700>   DW_AT_decl_column : 12
    <701>   DW_AT_type        : <0xac>
    <705>   DW_AT_data_member_location: 8
 <2><706>: Abbrev Number: 2 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x1e72c): MemInc
    <70b>   DW_AT_decl_file   : 10
    <70c>   DW_AT_decl_line   : 60
    <70d>   DW_AT_decl_column : 12
    <70e>   DW_AT_type        : <0xac>
    <712>   DW_AT_data_member_location: 12
 <2><713>: Abbrev Number: 2 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x607e3): PeriphDataAlignment
    <718>   DW_AT_decl_file   : 10
    <719>   DW_AT_decl_line   : 63
    <71a>   DW_AT_decl_column : 12
    <71b>   DW_AT_type        : <0xac>
    <71f>   DW_AT_data_member_location: 16
 <2><720>: Abbrev Number: 2 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0xaf784): MemDataAlignment
    <725>   DW_AT_decl_file   : 10
    <726>   DW_AT_decl_line   : 66
    <727>   DW_AT_decl_column : 12
    <728>   DW_AT_type        : <0xac>
    <72c>   DW_AT_data_member_location: 20
 <2><72d>: Abbrev Number: 2 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0xc9cd0): Mode
    <732>   DW_AT_decl_file   : 10
    <733>   DW_AT_decl_line   : 69
    <734>   DW_AT_decl_column : 12
    <735>   DW_AT_type        : <0xac>
    <739>   DW_AT_data_member_location: 24
 <2><73a>: Abbrev Number: 2 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0xc91e1): Priority
    <73f>   DW_AT_decl_file   : 10
    <740>   DW_AT_decl_line   : 74
    <741>   DW_AT_decl_column : 12
    <742>   DW_AT_type        : <0xac>
    <746>   DW_AT_data_member_location: 28
 <2><747>: Abbrev Number: 2 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x53ebd): FIFOMode
    <74c>   DW_AT_decl_file   : 10
    <74d>   DW_AT_decl_line   : 77
    <74e>   DW_AT_decl_column : 12
    <74f>   DW_AT_type        : <0xac>
    <753>   DW_AT_data_member_location: 32
 <2><754>: Abbrev Number: 2 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0x936ba): FIFOThreshold
    <759>   DW_AT_decl_file   : 10
    <75a>   DW_AT_decl_line   : 82
    <75b>   DW_AT_decl_column : 12
    <75c>   DW_AT_type        : <0xac>
    <760>   DW_AT_data_member_location: 36
 <2><761>: Abbrev Number: 2 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x919f1): MemBurst
    <766>   DW_AT_decl_file   : 10
    <767>   DW_AT_decl_line   : 85
    <768>   DW_AT_decl_column : 12
    <769>   DW_AT_type        : <0xac>
    <76d>   DW_AT_data_member_location: 40
 <2><76e>: Abbrev Number: 2 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x42e19): PeriphBurst
    <773>   DW_AT_decl_file   : 10
    <774>   DW_AT_decl_line   : 91
    <775>   DW_AT_decl_column : 12
    <776>   DW_AT_type        : <0xac>
    <77a>   DW_AT_data_member_location: 44
 <2><77b>: Abbrev Number: 0
 <1><77c>: Abbrev Number: 5 (DW_TAG_typedef)
    <77d>   DW_AT_name        : (indirect string, offset: 0x34af0): DMA_InitTypeDef
    <781>   DW_AT_decl_file   : 10
    <782>   DW_AT_decl_line   : 96
    <783>   DW_AT_decl_column : 2
    <784>   DW_AT_type        : <0x6d7>
 <1><788>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <789>   DW_AT_encoding    : 7	(unsigned)
    <789>   DW_AT_byte_size   : 1
    <789>   DW_AT_type        : <0x3d>
    <78d>   DW_AT_decl_file   : 10
    <78e>   DW_AT_decl_line   : 103
    <78f>   DW_AT_decl_column : 1
    <78f>   DW_AT_sibling     : <0x7b8>
 <2><793>: Abbrev Number: 3 (DW_TAG_enumerator)
    <794>   DW_AT_name        : (indirect string, offset: 0xc396): HAL_DMA_STATE_RESET
    <798>   DW_AT_const_value : 0
 <2><799>: Abbrev Number: 3 (DW_TAG_enumerator)
    <79a>   DW_AT_name        : (indirect string, offset: 0x35e5d): HAL_DMA_STATE_READY
    <79e>   DW_AT_const_value : 1
 <2><79f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x85e55): HAL_DMA_STATE_BUSY
    <7a4>   DW_AT_const_value : 2
 <2><7a5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a6>   DW_AT_name        : (indirect string, offset: 0xbeeb8): HAL_DMA_STATE_TIMEOUT
    <7aa>   DW_AT_const_value : 3
 <2><7ab>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x93153): HAL_DMA_STATE_ERROR
    <7b0>   DW_AT_const_value : 4
 <2><7b1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x4c426): HAL_DMA_STATE_ABORT
    <7b6>   DW_AT_const_value : 5
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 5 (DW_TAG_typedef)
    <7b9>   DW_AT_name        : (indirect string, offset: 0xaead7): HAL_DMA_StateTypeDef
    <7bd>   DW_AT_decl_file   : 10
    <7be>   DW_AT_decl_line   : 110
    <7bf>   DW_AT_decl_column : 2
    <7c0>   DW_AT_type        : <0x788>
 <1><7c4>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <7c5>   DW_AT_type        : <0x7b8>
 <1><7c9>: Abbrev Number: 26 (DW_TAG_structure_type)
    <7ca>   DW_AT_name        : (indirect string, offset: 0xa501b): __DMA_HandleTypeDef
    <7ce>   DW_AT_byte_size   : 96
    <7cf>   DW_AT_decl_file   : 10
    <7d0>   DW_AT_decl_line   : 138
    <7d1>   DW_AT_decl_column : 16
    <7d2>   DW_AT_sibling     : <0x88d>
 <2><7d6>: Abbrev Number: 2 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xbbb38): Instance
    <7db>   DW_AT_decl_file   : 10
    <7dc>   DW_AT_decl_line   : 140
    <7dd>   DW_AT_decl_column : 31
    <7de>   DW_AT_type        : <0x88d>
    <7e2>   DW_AT_data_member_location: 0
 <2><7e3>: Abbrev Number: 2 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xc9922): Init
    <7e8>   DW_AT_decl_file   : 10
    <7e9>   DW_AT_decl_line   : 142
    <7ea>   DW_AT_decl_column : 30
    <7eb>   DW_AT_type        : <0x77c>
    <7ef>   DW_AT_data_member_location: 4
 <2><7f0>: Abbrev Number: 2 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x89f6d): Lock
    <7f5>   DW_AT_decl_file   : 10
    <7f6>   DW_AT_decl_line   : 144
    <7f7>   DW_AT_decl_column : 30
    <7f8>   DW_AT_type        : <0x528>
    <7fc>   DW_AT_data_member_location: 52
 <2><7fd>: Abbrev Number: 2 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x83549): State
    <802>   DW_AT_decl_file   : 10
    <803>   DW_AT_decl_line   : 146
    <804>   DW_AT_decl_column : 30
    <805>   DW_AT_type        : <0x7c4>
    <809>   DW_AT_data_member_location: 53
 <2><80a>: Abbrev Number: 2 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0xb8a33): Parent
    <80f>   DW_AT_decl_file   : 10
    <810>   DW_AT_decl_line   : 148
    <811>   DW_AT_decl_column : 31
    <812>   DW_AT_type        : <0x892>
    <816>   DW_AT_data_member_location: 56
 <2><817>: Abbrev Number: 2 (DW_TAG_member)
    <818>   DW_AT_name        : (indirect string, offset: 0xc12bb): XferCpltCallback
    <81c>   DW_AT_decl_file   : 10
    <81d>   DW_AT_decl_line   : 150
    <81e>   DW_AT_decl_column : 33
    <81f>   DW_AT_type        : <0x8a4>
    <823>   DW_AT_data_member_location: 60
 <2><824>: Abbrev Number: 2 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0x96c08): XferHalfCpltCallback
    <829>   DW_AT_decl_file   : 10
    <82a>   DW_AT_decl_line   : 152
    <82b>   DW_AT_decl_column : 33
    <82c>   DW_AT_type        : <0x8a4>
    <830>   DW_AT_data_member_location: 64
 <2><831>: Abbrev Number: 2 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x72315): XferM1CpltCallback
    <836>   DW_AT_decl_file   : 10
    <837>   DW_AT_decl_line   : 154
    <838>   DW_AT_decl_column : 33
    <839>   DW_AT_type        : <0x8a4>
    <83d>   DW_AT_data_member_location: 68
 <2><83e>: Abbrev Number: 2 (DW_TAG_member)
    <83f>   DW_AT_name        : (indirect string, offset: 0x5d8c2): XferM1HalfCpltCallback
    <843>   DW_AT_decl_file   : 10
    <844>   DW_AT_decl_line   : 156
    <845>   DW_AT_decl_column : 33
    <846>   DW_AT_type        : <0x8a4>
    <84a>   DW_AT_data_member_location: 72
 <2><84b>: Abbrev Number: 2 (DW_TAG_member)
    <84c>   DW_AT_name        : (indirect string, offset: 0x1c04c): XferErrorCallback
    <850>   DW_AT_decl_file   : 10
    <851>   DW_AT_decl_line   : 158
    <852>   DW_AT_decl_column : 33
    <853>   DW_AT_type        : <0x8a4>
    <857>   DW_AT_data_member_location: 76
 <2><858>: Abbrev Number: 2 (DW_TAG_member)
    <859>   DW_AT_name        : (indirect string, offset: 0xb5246): XferAbortCallback
    <85d>   DW_AT_decl_file   : 10
    <85e>   DW_AT_decl_line   : 160
    <85f>   DW_AT_decl_column : 33
    <860>   DW_AT_type        : <0x8a4>
    <864>   DW_AT_data_member_location: 80
 <2><865>: Abbrev Number: 2 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0xbdc35): ErrorCode
    <86a>   DW_AT_decl_file   : 10
    <86b>   DW_AT_decl_line   : 162
    <86c>   DW_AT_decl_column : 30
    <86d>   DW_AT_type        : <0xb8>
    <871>   DW_AT_data_member_location: 84
 <2><872>: Abbrev Number: 2 (DW_TAG_member)
    <873>   DW_AT_name        : (indirect string, offset: 0x57081): StreamBaseAddress
    <877>   DW_AT_decl_file   : 10
    <878>   DW_AT_decl_line   : 164
    <879>   DW_AT_decl_column : 30
    <87a>   DW_AT_type        : <0xac>
    <87e>   DW_AT_data_member_location: 88
 <2><87f>: Abbrev Number: 2 (DW_TAG_member)
    <880>   DW_AT_name        : (indirect string, offset: 0xa3191): StreamIndex
    <884>   DW_AT_decl_file   : 10
    <885>   DW_AT_decl_line   : 166
    <886>   DW_AT_decl_column : 30
    <887>   DW_AT_type        : <0xac>
    <88b>   DW_AT_data_member_location: 92
 <2><88c>: Abbrev Number: 0
 <1><88d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <88e>   DW_AT_byte_size   : 4
    <88e>   DW_AT_type        : <0x124>
 <1><892>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <893>   DW_AT_byte_size   : 4
 <1><894>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <895>   DW_AT_prototyped  : 1
    <895>   DW_AT_sibling     : <0x89f>
 <2><899>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <89a>   DW_AT_type        : <0x89f>
 <2><89e>: Abbrev Number: 0
 <1><89f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <8a0>   DW_AT_byte_size   : 4
    <8a0>   DW_AT_type        : <0x7c9>
 <1><8a4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <8a5>   DW_AT_byte_size   : 4
    <8a5>   DW_AT_type        : <0x894>
 <1><8a9>: Abbrev Number: 5 (DW_TAG_typedef)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xa501d): DMA_HandleTypeDef
    <8ae>   DW_AT_decl_file   : 10
    <8af>   DW_AT_decl_line   : 168
    <8b0>   DW_AT_decl_column : 2
    <8b1>   DW_AT_type        : <0x7c9>
 <1><8b5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8b6>   DW_AT_byte_size   : 24
    <8b7>   DW_AT_decl_file   : 11
    <8b8>   DW_AT_decl_line   : 46
    <8b9>   DW_AT_decl_column : 9
    <8b9>   DW_AT_sibling     : <0x90c>
 <2><8bd>: Abbrev Number: 2 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0xc2ea4): Prescaler
    <8c2>   DW_AT_decl_file   : 11
    <8c3>   DW_AT_decl_line   : 48
    <8c4>   DW_AT_decl_column : 12
    <8c5>   DW_AT_type        : <0xac>
    <8c9>   DW_AT_data_member_location: 0
 <2><8ca>: Abbrev Number: 2 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xb03d1): CounterMode
    <8cf>   DW_AT_decl_file   : 11
    <8d0>   DW_AT_decl_line   : 51
    <8d1>   DW_AT_decl_column : 12
    <8d2>   DW_AT_type        : <0xac>
    <8d6>   DW_AT_data_member_location: 4
 <2><8d7>: Abbrev Number: 2 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xd30e8): Period
    <8dc>   DW_AT_decl_file   : 11
    <8dd>   DW_AT_decl_line   : 54
    <8de>   DW_AT_decl_column : 12
    <8df>   DW_AT_type        : <0xac>
    <8e3>   DW_AT_data_member_location: 8
 <2><8e4>: Abbrev Number: 2 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x4f386): ClockDivision
    <8e9>   DW_AT_decl_file   : 11
    <8ea>   DW_AT_decl_line   : 58
    <8eb>   DW_AT_decl_column : 12
    <8ec>   DW_AT_type        : <0xac>
    <8f0>   DW_AT_data_member_location: 12
 <2><8f1>: Abbrev Number: 2 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x87573): RepetitionCounter
    <8f6>   DW_AT_decl_file   : 11
    <8f7>   DW_AT_decl_line   : 61
    <8f8>   DW_AT_decl_column : 12
    <8f9>   DW_AT_type        : <0xac>
    <8fd>   DW_AT_data_member_location: 16
 <2><8fe>: Abbrev Number: 2 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0xb2f77): AutoReloadPreload
    <903>   DW_AT_decl_file   : 11
    <904>   DW_AT_decl_line   : 72
    <905>   DW_AT_decl_column : 12
    <906>   DW_AT_type        : <0xac>
    <90a>   DW_AT_data_member_location: 20
 <2><90b>: Abbrev Number: 0
 <1><90c>: Abbrev Number: 5 (DW_TAG_typedef)
    <90d>   DW_AT_name        : (indirect string, offset: 0x4370b): TIM_Base_InitTypeDef
    <911>   DW_AT_decl_file   : 11
    <912>   DW_AT_decl_line   : 74
    <913>   DW_AT_decl_column : 3
    <914>   DW_AT_type        : <0x8b5>
 <1><918>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <919>   DW_AT_encoding    : 7	(unsigned)
    <919>   DW_AT_byte_size   : 1
    <919>   DW_AT_type        : <0x3d>
    <91d>   DW_AT_decl_file   : 11
    <91d>   DW_AT_decl_line   : 291
    <91f>   DW_AT_decl_column : 1
    <91f>   DW_AT_sibling     : <0x942>
 <2><923>: Abbrev Number: 3 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x79d4a): HAL_TIM_STATE_RESET
    <928>   DW_AT_const_value : 0
 <2><929>: Abbrev Number: 3 (DW_TAG_enumerator)
    <92a>   DW_AT_name        : (indirect string, offset: 0x6a5c): HAL_TIM_STATE_READY
    <92e>   DW_AT_const_value : 1
 <2><92f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <930>   DW_AT_name        : (indirect string, offset: 0x31712): HAL_TIM_STATE_BUSY
    <934>   DW_AT_const_value : 2
 <2><935>: Abbrev Number: 3 (DW_TAG_enumerator)
    <936>   DW_AT_name        : (indirect string, offset: 0xa2284): HAL_TIM_STATE_TIMEOUT
    <93a>   DW_AT_const_value : 3
 <2><93b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <93c>   DW_AT_name        : (indirect string, offset: 0x77fb5): HAL_TIM_STATE_ERROR
    <940>   DW_AT_const_value : 4
 <2><941>: Abbrev Number: 0
 <1><942>: Abbrev Number: 8 (DW_TAG_typedef)
    <943>   DW_AT_name        : (indirect string, offset: 0x7f53e): HAL_TIM_StateTypeDef
    <947>   DW_AT_decl_file   : 11
    <948>   DW_AT_decl_line   : 297
    <94a>   DW_AT_decl_column : 3
    <94a>   DW_AT_type        : <0x918>
 <1><94e>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <94f>   DW_AT_type        : <0x942>
 <1><953>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <954>   DW_AT_encoding    : 7	(unsigned)
    <954>   DW_AT_byte_size   : 1
    <954>   DW_AT_type        : <0x3d>
    <958>   DW_AT_decl_file   : 11
    <958>   DW_AT_decl_line   : 303
    <95a>   DW_AT_decl_column : 1
    <95a>   DW_AT_sibling     : <0x971>
 <2><95e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <95f>   DW_AT_name        : (indirect string, offset: 0x888b1): HAL_TIM_CHANNEL_STATE_RESET
    <963>   DW_AT_const_value : 0
 <2><964>: Abbrev Number: 3 (DW_TAG_enumerator)
    <965>   DW_AT_name        : (indirect string, offset: 0x725f7): HAL_TIM_CHANNEL_STATE_READY
    <969>   DW_AT_const_value : 1
 <2><96a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <96b>   DW_AT_name        : (indirect string, offset: 0x5da6f): HAL_TIM_CHANNEL_STATE_BUSY
    <96f>   DW_AT_const_value : 2
 <2><970>: Abbrev Number: 0
 <1><971>: Abbrev Number: 8 (DW_TAG_typedef)
    <972>   DW_AT_name        : (indirect string, offset: 0x29427): HAL_TIM_ChannelStateTypeDef
    <976>   DW_AT_decl_file   : 11
    <977>   DW_AT_decl_line   : 307
    <979>   DW_AT_decl_column : 3
    <979>   DW_AT_type        : <0x953>
 <1><97d>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <97e>   DW_AT_type        : <0x971>
 <1><982>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <983>   DW_AT_encoding    : 7	(unsigned)
    <983>   DW_AT_byte_size   : 1
    <983>   DW_AT_type        : <0x3d>
    <987>   DW_AT_decl_file   : 11
    <987>   DW_AT_decl_line   : 313
    <989>   DW_AT_decl_column : 1
    <989>   DW_AT_sibling     : <0x9a0>
 <2><98d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <98e>   DW_AT_name        : (indirect string, offset: 0x3d12): HAL_DMA_BURST_STATE_RESET
    <992>   DW_AT_const_value : 0
 <2><993>: Abbrev Number: 3 (DW_TAG_enumerator)
    <994>   DW_AT_name        : (indirect string, offset: 0x6b378): HAL_DMA_BURST_STATE_READY
    <998>   DW_AT_const_value : 1
 <2><999>: Abbrev Number: 3 (DW_TAG_enumerator)
    <99a>   DW_AT_name        : (indirect string, offset: 0x41f1c): HAL_DMA_BURST_STATE_BUSY
    <99e>   DW_AT_const_value : 2
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 8 (DW_TAG_typedef)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x1a696): HAL_TIM_DMABurstStateTypeDef
    <9a5>   DW_AT_decl_file   : 11
    <9a6>   DW_AT_decl_line   : 317
    <9a8>   DW_AT_decl_column : 3
    <9a8>   DW_AT_type        : <0x982>
 <1><9ac>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <9ad>   DW_AT_type        : <0x9a0>
 <1><9b1>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <9b2>   DW_AT_encoding    : 7	(unsigned)
    <9b2>   DW_AT_byte_size   : 1
    <9b2>   DW_AT_type        : <0x3d>
    <9b6>   DW_AT_decl_file   : 11
    <9b6>   DW_AT_decl_line   : 323
    <9b8>   DW_AT_decl_column : 1
    <9b8>   DW_AT_sibling     : <0x9db>
 <2><9bc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x6d421): HAL_TIM_ACTIVE_CHANNEL_1
    <9c1>   DW_AT_const_value : 1
 <2><9c2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x6d43a): HAL_TIM_ACTIVE_CHANNEL_2
    <9c7>   DW_AT_const_value : 2
 <2><9c8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x6d453): HAL_TIM_ACTIVE_CHANNEL_3
    <9cd>   DW_AT_const_value : 4
 <2><9ce>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x6d46c): HAL_TIM_ACTIVE_CHANNEL_4
    <9d3>   DW_AT_const_value : 8
 <2><9d4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x504d4): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <9d9>   DW_AT_const_value : 0
 <2><9da>: Abbrev Number: 0
 <1><9db>: Abbrev Number: 8 (DW_TAG_typedef)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x64fd1): HAL_TIM_ActiveChannel
    <9e0>   DW_AT_decl_file   : 11
    <9e1>   DW_AT_decl_line   : 329
    <9e3>   DW_AT_decl_column : 3
    <9e3>   DW_AT_type        : <0x9b1>
 <1><9e7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <9e8>   DW_AT_byte_size   : 72
    <9e9>   DW_AT_decl_file   : 11
    <9ea>   DW_AT_decl_line   : 337
    <9ec>   DW_AT_decl_column : 9
    <9ec>   DW_AT_sibling     : <0xa6f>
 <2><9f0>: Abbrev Number: 1 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xbbb38): Instance
    <9f5>   DW_AT_decl_file   : 11
    <9f6>   DW_AT_decl_line   : 340
    <9f8>   DW_AT_decl_column : 39
    <9f9>   DW_AT_type        : <0xa6f>
    <9fd>   DW_AT_data_member_location: 0
 <2><9fe>: Abbrev Number: 1 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0xc9922): Init
    <a03>   DW_AT_decl_file   : 11
    <a04>   DW_AT_decl_line   : 341
    <a06>   DW_AT_decl_column : 38
    <a07>   DW_AT_type        : <0x90c>
    <a0b>   DW_AT_data_member_location: 4
 <2><a0c>: Abbrev Number: 1 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x64fdf): Channel
    <a11>   DW_AT_decl_file   : 11
    <a12>   DW_AT_decl_line   : 342
    <a14>   DW_AT_decl_column : 38
    <a15>   DW_AT_type        : <0x9db>
    <a19>   DW_AT_data_member_location: 28
 <2><a1a>: Abbrev Number: 1 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x74ae8): hdma
    <a1f>   DW_AT_decl_file   : 11
    <a20>   DW_AT_decl_line   : 343
    <a22>   DW_AT_decl_column : 39
    <a23>   DW_AT_type        : <0xa74>
    <a27>   DW_AT_data_member_location: 32
 <2><a28>: Abbrev Number: 1 (DW_TAG_member)
    <a29>   DW_AT_name        : (indirect string, offset: 0x89f6d): Lock
    <a2d>   DW_AT_decl_file   : 11
    <a2e>   DW_AT_decl_line   : 345
    <a30>   DW_AT_decl_column : 38
    <a31>   DW_AT_type        : <0x528>
    <a35>   DW_AT_data_member_location: 60
 <2><a36>: Abbrev Number: 1 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0x83549): State
    <a3b>   DW_AT_decl_file   : 11
    <a3c>   DW_AT_decl_line   : 346
    <a3e>   DW_AT_decl_column : 38
    <a3f>   DW_AT_type        : <0x94e>
    <a43>   DW_AT_data_member_location: 61
 <2><a44>: Abbrev Number: 1 (DW_TAG_member)
    <a45>   DW_AT_name        : (indirect string, offset: 0xca3ab): ChannelState
    <a49>   DW_AT_decl_file   : 11
    <a4a>   DW_AT_decl_line   : 347
    <a4c>   DW_AT_decl_column : 38
    <a4d>   DW_AT_type        : <0xa99>
    <a51>   DW_AT_data_member_location: 62
 <2><a52>: Abbrev Number: 1 (DW_TAG_member)
    <a53>   DW_AT_name        : (indirect string, offset: 0xca9dc): ChannelNState
    <a57>   DW_AT_decl_file   : 11
    <a58>   DW_AT_decl_line   : 348
    <a5a>   DW_AT_decl_column : 38
    <a5b>   DW_AT_type        : <0xa99>
    <a5f>   DW_AT_data_member_location: 66
 <2><a60>: Abbrev Number: 1 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0xc9f46): DMABurstState
    <a65>   DW_AT_decl_file   : 11
    <a66>   DW_AT_decl_line   : 349
    <a68>   DW_AT_decl_column : 38
    <a69>   DW_AT_type        : <0x9ac>
    <a6d>   DW_AT_data_member_location: 70
 <2><a6e>: Abbrev Number: 0
 <1><a6f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a70>   DW_AT_byte_size   : 4
    <a70>   DW_AT_type        : <0x4cd>
 <1><a74>: Abbrev Number: 15 (DW_TAG_array_type)
    <a75>   DW_AT_type        : <0xa84>
    <a79>   DW_AT_sibling     : <0xa84>
 <2><a7d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a7e>   DW_AT_type        : <0x8d>
    <a82>   DW_AT_upper_bound : 6
 <2><a83>: Abbrev Number: 0
 <1><a84>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a85>   DW_AT_byte_size   : 4
    <a85>   DW_AT_type        : <0x8a9>
 <1><a89>: Abbrev Number: 15 (DW_TAG_array_type)
    <a8a>   DW_AT_type        : <0x97d>
    <a8e>   DW_AT_sibling     : <0xa99>
 <2><a92>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a93>   DW_AT_type        : <0x8d>
    <a97>   DW_AT_upper_bound : 3
 <2><a98>: Abbrev Number: 0
 <1><a99>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <a9a>   DW_AT_type        : <0xa89>
 <1><a9e>: Abbrev Number: 8 (DW_TAG_typedef)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x43163): TIM_HandleTypeDef
    <aa3>   DW_AT_decl_file   : 11
    <aa4>   DW_AT_decl_line   : 380
    <aa6>   DW_AT_decl_column : 3
    <aa6>   DW_AT_type        : <0x9e7>
 <1><aaa>: Abbrev Number: 20 (DW_TAG_subprogram)
    <aab>   DW_AT_external    : 1
    <aab>   DW_AT_name        : (indirect string, offset: 0x42632): HAL_IncTick
    <aaf>   DW_AT_decl_file   : 12
    <ab0>   DW_AT_decl_line   : 232
    <ab1>   DW_AT_decl_column : 6
    <ab1>   DW_AT_prototyped  : 1
    <ab1>   DW_AT_declaration : 1
 <1><ab1>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ab2>   DW_AT_external    : 1
    <ab2>   DW_AT_name        : (indirect string, offset: 0x778a0): HAL_GPIO_Init
    <ab6>   DW_AT_decl_file   : 9
    <ab6>   DW_AT_decl_line   : 224
    <ab7>   DW_AT_decl_column : 7
    <ab8>   DW_AT_prototyped  : 1
    <ab8>   DW_AT_declaration : 1
    <ab8>   DW_AT_sibling     : <0xac7>
 <2><abc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <abd>   DW_AT_type        : <0xac7>
 <2><ac1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ac2>   DW_AT_type        : <0xacc>
 <2><ac6>: Abbrev Number: 0
 <1><ac7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ac8>   DW_AT_byte_size   : 4
    <ac8>   DW_AT_type        : <0x1c7>
 <1><acc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <acd>   DW_AT_byte_size   : 4
    <acd>   DW_AT_type        : <0x6a7>
 <1><ad1>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ad2>   DW_AT_external    : 1
    <ad2>   DW_AT_name        : (indirect string, offset: 0x22c6e): HAL_GPIO_WritePin
    <ad6>   DW_AT_decl_file   : 9
    <ad6>   DW_AT_decl_line   : 235
    <ad7>   DW_AT_decl_column : 6
    <ad8>   DW_AT_prototyped  : 1
    <ad8>   DW_AT_declaration : 1
    <ad8>   DW_AT_sibling     : <0xaec>
 <2><adc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <add>   DW_AT_type        : <0xac7>
 <2><ae1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ae2>   DW_AT_type        : <0xa0>
 <2><ae6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ae7>   DW_AT_type        : <0x6cb>
 <2><aeb>: Abbrev Number: 0
 <1><aec>: Abbrev Number: 22 (DW_TAG_subprogram)
    <aed>   DW_AT_external    : 1
    <aed>   DW_AT_name        : (indirect string, offset: 0xa6289): HAL_RCC_ClockConfig
    <af1>   DW_AT_decl_file   : 8
    <af1>   DW_AT_decl_line   : 1246
    <af3>   DW_AT_decl_column : 19
    <af3>   DW_AT_prototyped  : 1
    <af3>   DW_AT_type        : <0x504>
    <af7>   DW_AT_declaration : 1
    <af7>   DW_AT_sibling     : <0xb06>
 <2><afb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <afc>   DW_AT_type        : <0xb06>
 <2><b00>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b01>   DW_AT_type        : <0xac>
 <2><b05>: Abbrev Number: 0
 <1><b06>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b07>   DW_AT_byte_size   : 4
    <b07>   DW_AT_type        : <0x651>
 <1><b0b>: Abbrev Number: 22 (DW_TAG_subprogram)
    <b0c>   DW_AT_external    : 1
    <b0c>   DW_AT_name        : (indirect string, offset: 0x859a0): HAL_RCC_OscConfig
    <b10>   DW_AT_decl_file   : 8
    <b10>   DW_AT_decl_line   : 1245
    <b12>   DW_AT_decl_column : 19
    <b12>   DW_AT_prototyped  : 1
    <b12>   DW_AT_type        : <0x504>
    <b16>   DW_AT_declaration : 1
    <b16>   DW_AT_sibling     : <0xb20>
 <2><b1a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b1b>   DW_AT_type        : <0xb20>
 <2><b1f>: Abbrev Number: 0
 <1><b20>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b21>   DW_AT_byte_size   : 4
    <b21>   DW_AT_type        : <0x5fb>
 <1><b25>: Abbrev Number: 20 (DW_TAG_subprogram)
    <b26>   DW_AT_external    : 1
    <b26>   DW_AT_name        : (indirect string, offset: 0x218e8): user_app_init
    <b2a>   DW_AT_decl_file   : 13
    <b2b>   DW_AT_decl_line   : 11
    <b2c>   DW_AT_decl_column : 6
    <b2c>   DW_AT_prototyped  : 1
    <b2c>   DW_AT_declaration : 1
 <1><b2c>: Abbrev Number: 29 (DW_TAG_subprogram)
    <b2d>   DW_AT_external    : 1
    <b2d>   DW_AT_name        : (indirect string, offset: 0xb5eda): HAL_Init
    <b31>   DW_AT_decl_file   : 12
    <b32>   DW_AT_decl_line   : 219
    <b33>   DW_AT_decl_column : 19
    <b34>   DW_AT_prototyped  : 1
    <b34>   DW_AT_type        : <0x504>
    <b38>   DW_AT_declaration : 1
 <1><b38>: Abbrev Number: 30 (DW_TAG_subprogram)
    <b39>   DW_AT_external    : 1
    <b39>   DW_AT_name        : (indirect string, offset: 0x562ea): Error_Handler
    <b3d>   DW_AT_decl_file   : 1
    <b3e>   DW_AT_decl_line   : 322
    <b40>   DW_AT_decl_column : 6
    <b41>   DW_AT_prototyped  : 1
    <b41>   DW_AT_low_pc      : 0x800088c
    <b45>   DW_AT_high_pc     : 0xc
    <b49>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b4b>   DW_AT_call_all_calls: 1
    <b4b>   DW_AT_sibling     : <0xb61>
 <2><b4f>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <b50>   DW_AT_abstract_origin: <0xcd7>
    <b54>   DW_AT_low_pc      : 0x8000890
    <b58>   DW_AT_high_pc     : 0x4
    <b5c>   DW_AT_call_file   : 1
    <b5d>   DW_AT_call_line   : 326
    <b5f>   DW_AT_call_column : 3
 <2><b60>: Abbrev Number: 0
 <1><b61>: Abbrev Number: 32 (DW_TAG_subprogram)
    <b62>   DW_AT_external    : 1
    <b62>   DW_AT_name        : (indirect string, offset: 0xa28a9): HAL_TIM_PeriodElapsedCallback
    <b66>   DW_AT_decl_file   : 1
    <b67>   DW_AT_decl_line   : 305
    <b69>   DW_AT_decl_column : 6
    <b6a>   DW_AT_prototyped  : 1
    <b6a>   DW_AT_low_pc      : 0x8000868
    <b6e>   DW_AT_high_pc     : 0x24
    <b72>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b74>   DW_AT_call_all_tail_calls: 1
    <b74>   DW_AT_sibling     : <0xb89>
 <2><b78>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <b79>   DW_AT_name        : (indirect string, offset: 0x98633): htim
    <b7d>   DW_AT_decl_file   : 1
    <b7e>   DW_AT_decl_line   : 305
    <b80>   DW_AT_decl_column : 55
    <b81>   DW_AT_type        : <0xb89>
    <b85>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b88>: Abbrev Number: 0
 <1><b89>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b8a>   DW_AT_byte_size   : 4
    <b8a>   DW_AT_type        : <0xa9e>
 <1><b8e>: Abbrev Number: 34 (DW_TAG_subprogram)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x4f928): MX_GPIO_Init
    <b93>   DW_AT_decl_file   : 1
    <b94>   DW_AT_decl_line   : 156
    <b95>   DW_AT_decl_column : 13
    <b96>   DW_AT_prototyped  : 1
    <b96>   DW_AT_low_pc      : 0x80005ac
    <b9a>   DW_AT_high_pc     : 0x2bc
    <b9e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ba0>   DW_AT_call_all_tail_calls: 1
    <ba0>   DW_AT_sibling     : <0xc57>
 <2><ba4>: Abbrev Number: 6 (DW_TAG_variable)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x12289): GPIO_InitStruct
    <ba9>   DW_AT_decl_file   : 1
    <ba9>   DW_AT_decl_line   : 158
    <baa>   DW_AT_decl_column : 20
    <bab>   DW_AT_type        : <0x6a7>
    <baf>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><bb2>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <bb3>   DW_AT_low_pc      : 0x80005c2
    <bb7>   DW_AT_high_pc     : 0x1c
    <bbb>   DW_AT_sibling     : <0xbce>
 <3><bbf>: Abbrev Number: 6 (DW_TAG_variable)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <bc4>   DW_AT_decl_file   : 1
    <bc4>   DW_AT_decl_line   : 163
    <bc5>   DW_AT_decl_column : 3
    <bc6>   DW_AT_type        : <0xb8>
    <bca>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><bcd>: Abbrev Number: 0
 <2><bce>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <bcf>   DW_AT_low_pc      : 0x80005de
    <bd3>   DW_AT_high_pc     : 0x1c
    <bd7>   DW_AT_sibling     : <0xbea>
 <3><bdb>: Abbrev Number: 6 (DW_TAG_variable)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <be0>   DW_AT_decl_file   : 1
    <be0>   DW_AT_decl_line   : 164
    <be1>   DW_AT_decl_column : 3
    <be2>   DW_AT_type        : <0xb8>
    <be6>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><be9>: Abbrev Number: 0
 <2><bea>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <beb>   DW_AT_low_pc      : 0x80005fa
    <bef>   DW_AT_high_pc     : 0x1c
    <bf3>   DW_AT_sibling     : <0xc06>
 <3><bf7>: Abbrev Number: 6 (DW_TAG_variable)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <bfc>   DW_AT_decl_file   : 1
    <bfc>   DW_AT_decl_line   : 165
    <bfd>   DW_AT_decl_column : 3
    <bfe>   DW_AT_type        : <0xb8>
    <c02>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><c05>: Abbrev Number: 0
 <2><c06>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <c07>   DW_AT_low_pc      : 0x8000616
    <c0b>   DW_AT_high_pc     : 0x1c
    <c0f>   DW_AT_sibling     : <0xc22>
 <3><c13>: Abbrev Number: 6 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c18>   DW_AT_decl_file   : 1
    <c18>   DW_AT_decl_line   : 166
    <c19>   DW_AT_decl_column : 3
    <c1a>   DW_AT_type        : <0xb8>
    <c1e>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><c21>: Abbrev Number: 0
 <2><c22>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <c23>   DW_AT_low_pc      : 0x8000632
    <c27>   DW_AT_high_pc     : 0x1c
    <c2b>   DW_AT_sibling     : <0xc3e>
 <3><c2f>: Abbrev Number: 6 (DW_TAG_variable)
    <c30>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c34>   DW_AT_decl_file   : 1
    <c34>   DW_AT_decl_line   : 167
    <c35>   DW_AT_decl_column : 3
    <c36>   DW_AT_type        : <0xb8>
    <c3a>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><c3d>: Abbrev Number: 0
 <2><c3e>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <c3f>   DW_AT_low_pc      : 0x800064e
    <c43>   DW_AT_high_pc     : 0x1c
 <3><c47>: Abbrev Number: 6 (DW_TAG_variable)
    <c48>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c4c>   DW_AT_decl_file   : 1
    <c4c>   DW_AT_decl_line   : 168
    <c4d>   DW_AT_decl_column : 3
    <c4e>   DW_AT_type        : <0xb8>
    <c52>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><c55>: Abbrev Number: 0
 <2><c56>: Abbrev Number: 0
 <1><c57>: Abbrev Number: 35 (DW_TAG_subprogram)
    <c58>   DW_AT_external    : 1
    <c58>   DW_AT_name        : (indirect string, offset: 0x85d6d): SystemClock_Config
    <c5c>   DW_AT_decl_file   : 1
    <c5d>   DW_AT_decl_line   : 109
    <c5e>   DW_AT_decl_column : 6
    <c5f>   DW_AT_prototyped  : 1
    <c5f>   DW_AT_low_pc      : 0x80004d8
    <c63>   DW_AT_high_pc     : 0xd4
    <c67>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c69>   DW_AT_call_all_tail_calls: 1
    <c69>   DW_AT_sibling     : <0xcc1>
 <2><c6d>: Abbrev Number: 6 (DW_TAG_variable)
    <c6e>   DW_AT_name        : (indirect string, offset: 0x2ae9f): RCC_OscInitStruct
    <c72>   DW_AT_decl_file   : 1
    <c72>   DW_AT_decl_line   : 111
    <c73>   DW_AT_decl_column : 22
    <c74>   DW_AT_type        : <0x5fb>
    <c78>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><c7b>: Abbrev Number: 6 (DW_TAG_variable)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x49aa4): RCC_ClkInitStruct
    <c80>   DW_AT_decl_file   : 1
    <c80>   DW_AT_decl_line   : 112
    <c81>   DW_AT_decl_column : 22
    <c82>   DW_AT_type        : <0x651>
    <c86>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><c8a>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <c8b>   DW_AT_low_pc      : 0x80004fc
    <c8f>   DW_AT_high_pc     : 0x1c
    <c93>   DW_AT_sibling     : <0xca7>
 <3><c97>: Abbrev Number: 6 (DW_TAG_variable)
    <c98>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c9c>   DW_AT_decl_file   : 1
    <c9c>   DW_AT_decl_line   : 116
    <c9d>   DW_AT_decl_column : 3
    <c9e>   DW_AT_type        : <0xb8>
    <ca2>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><ca6>: Abbrev Number: 0
 <2><ca7>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <ca8>   DW_AT_low_pc      : 0x8000518
    <cac>   DW_AT_high_pc     : 0x1c
 <3><cb0>: Abbrev Number: 6 (DW_TAG_variable)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <cb5>   DW_AT_decl_file   : 1
    <cb5>   DW_AT_decl_line   : 117
    <cb6>   DW_AT_decl_column : 3
    <cb7>   DW_AT_type        : <0xb8>
    <cbb>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><cbf>: Abbrev Number: 0
 <2><cc0>: Abbrev Number: 0
 <1><cc1>: Abbrev Number: 36 (DW_TAG_subprogram)
    <cc2>   DW_AT_external    : 1
    <cc2>   DW_AT_name        : (indirect string, offset: 0x12d16): main
    <cc6>   DW_AT_decl_file   : 1
    <cc7>   DW_AT_decl_line   : 64
    <cc8>   DW_AT_decl_column : 5
    <cc9>   DW_AT_prototyped  : 1
    <cc9>   DW_AT_type        : <0x86>
    <ccd>   DW_AT_low_pc      : 0x80004c0
    <cd1>   DW_AT_high_pc     : 0x18
    <cd5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cd7>   DW_AT_call_all_tail_calls: 1
 <1><cd7>: Abbrev Number: 37 (DW_TAG_subprogram)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x6b56c): __disable_irq
    <cdc>   DW_AT_decl_file   : 2
    <cdd>   DW_AT_decl_line   : 960
    <cdf>   DW_AT_decl_column : 27
    <ce0>   DW_AT_prototyped  : 1
    <ce0>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><ce1>: Abbrev Number: 0
  Compilation Unit @ offset 0xce2:
   Length:        0x265 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x268
   Pointer Size:  4
 <0><cee>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <cef>   DW_AT_producer    : (indirect string, offset: 0x33617): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <cf3>   DW_AT_language    : 29	(C11)
    <cf4>   DW_AT_name        : (indirect string, offset: 0xc2ba8): ../Core/Src/stm32f4xx_hal_msp.c
    <cf8>   DW_AT_comp_dir    : (indirect string, offset: 0xc31a): /Users/sandeep/Documents/github-projects/frtos/free-rtos/first_project/Debug
    <cfc>   DW_AT_ranges      : 0x39
    <d00>   DW_AT_low_pc      : 0
    <d04>   DW_AT_stmt_list   : 0x8ad
    <d08>   DW_AT_macros      : 0x1ec4a
 <1><d0c>: Abbrev Number: 2 (DW_TAG_base_type)
    <d0d>   DW_AT_byte_size   : 1
    <d0e>   DW_AT_encoding    : 6	(signed char)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x6150b): signed char
 <1><d13>: Abbrev Number: 2 (DW_TAG_base_type)
    <d14>   DW_AT_byte_size   : 1
    <d15>   DW_AT_encoding    : 8	(unsigned char)
    <d16>   DW_AT_name        : (indirect string, offset: 0xbb71e): unsigned char
 <1><d1a>: Abbrev Number: 2 (DW_TAG_base_type)
    <d1b>   DW_AT_byte_size   : 2
    <d1c>   DW_AT_encoding    : 5	(signed)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x90694): short int
 <1><d21>: Abbrev Number: 2 (DW_TAG_base_type)
    <d22>   DW_AT_byte_size   : 2
    <d23>   DW_AT_encoding    : 7	(unsigned)
    <d24>   DW_AT_name        : (indirect string, offset: 0xb9f8f): short unsigned int
 <1><d28>: Abbrev Number: 2 (DW_TAG_base_type)
    <d29>   DW_AT_byte_size   : 4
    <d2a>   DW_AT_encoding    : 5	(signed)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xff1a): long int
 <1><d2f>: Abbrev Number: 4 (DW_TAG_typedef)
    <d30>   DW_AT_name        : (indirect string, offset: 0x7ba0a): __uint32_t
    <d34>   DW_AT_decl_file   : 2
    <d35>   DW_AT_decl_line   : 79
    <d36>   DW_AT_decl_column : 25
    <d37>   DW_AT_type        : <0xd3b>
 <1><d3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <d3c>   DW_AT_byte_size   : 4
    <d3d>   DW_AT_encoding    : 7	(unsigned)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x4a8ac): long unsigned int
 <1><d42>: Abbrev Number: 2 (DW_TAG_base_type)
    <d43>   DW_AT_byte_size   : 8
    <d44>   DW_AT_encoding    : 5	(signed)
    <d45>   DW_AT_name        : (indirect string, offset: 0x58d87): long long int
 <1><d49>: Abbrev Number: 2 (DW_TAG_base_type)
    <d4a>   DW_AT_byte_size   : 8
    <d4b>   DW_AT_encoding    : 7	(unsigned)
    <d4c>   DW_AT_name        : (indirect string, offset: 0x28f01): long long unsigned int
 <1><d50>: Abbrev Number: 7 (DW_TAG_base_type)
    <d51>   DW_AT_byte_size   : 4
    <d52>   DW_AT_encoding    : 5	(signed)
    <d53>   DW_AT_name        : int
 <1><d57>: Abbrev Number: 2 (DW_TAG_base_type)
    <d58>   DW_AT_byte_size   : 4
    <d59>   DW_AT_encoding    : 7	(unsigned)
    <d5a>   DW_AT_name        : (indirect string, offset: 0xf619): unsigned int
 <1><d5e>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5f>   DW_AT_name        : (indirect string, offset: 0xce185): uint32_t
    <d63>   DW_AT_decl_file   : 3
    <d64>   DW_AT_decl_line   : 48
    <d65>   DW_AT_decl_column : 20
    <d66>   DW_AT_type        : <0xd2f>
 <1><d6a>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d6b>   DW_AT_type        : <0xd5e>
 <1><d6f>: Abbrev Number: 9 (DW_TAG_array_type)
    <d70>   DW_AT_type        : <0xd5e>
    <d74>   DW_AT_sibling     : <0xd7f>
 <2><d78>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <d79>   DW_AT_type        : <0xd57>
    <d7d>   DW_AT_upper_bound : 1
 <2><d7e>: Abbrev Number: 0
 <1><d7f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <d80>   DW_AT_byte_size   : 136
    <d81>   DW_AT_decl_file   : 4
    <d82>   DW_AT_decl_line   : 596
    <d84>   DW_AT_decl_column : 9
    <d85>   DW_AT_sibling     : <0xef1>
 <2><d89>: Abbrev Number: 3 (DW_TAG_member)
    <d8a>   DW_AT_name        : CR
    <d8d>   DW_AT_decl_file   : 4
    <d8d>   DW_AT_decl_line   : 598
    <d8f>   DW_AT_decl_column : 17
    <d8f>   DW_AT_type        : <0xd6a>
    <d93>   DW_AT_data_member_location: 0
 <2><d94>: Abbrev Number: 1 (DW_TAG_member)
    <d95>   DW_AT_name        : (indirect string, offset: 0x876fd): PLLCFGR
    <d99>   DW_AT_decl_file   : 4
    <d99>   DW_AT_decl_line   : 599
    <d9b>   DW_AT_decl_column : 17
    <d9b>   DW_AT_type        : <0xd6a>
    <d9f>   DW_AT_data_member_location: 4
 <2><da0>: Abbrev Number: 1 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0x87700): CFGR
    <da5>   DW_AT_decl_file   : 4
    <da5>   DW_AT_decl_line   : 600
    <da7>   DW_AT_decl_column : 17
    <da7>   DW_AT_type        : <0xd6a>
    <dab>   DW_AT_data_member_location: 8
 <2><dac>: Abbrev Number: 3 (DW_TAG_member)
    <dad>   DW_AT_name        : CIR
    <db1>   DW_AT_decl_file   : 4
    <db1>   DW_AT_decl_line   : 601
    <db3>   DW_AT_decl_column : 17
    <db3>   DW_AT_type        : <0xd6a>
    <db7>   DW_AT_data_member_location: 12
 <2><db8>: Abbrev Number: 1 (DW_TAG_member)
    <db9>   DW_AT_name        : (indirect string, offset: 0x9a57d): AHB1RSTR
    <dbd>   DW_AT_decl_file   : 4
    <dbd>   DW_AT_decl_line   : 602
    <dbf>   DW_AT_decl_column : 17
    <dbf>   DW_AT_type        : <0xd6a>
    <dc3>   DW_AT_data_member_location: 16
 <2><dc4>: Abbrev Number: 1 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x15b65): AHB2RSTR
    <dc9>   DW_AT_decl_file   : 4
    <dc9>   DW_AT_decl_line   : 603
    <dcb>   DW_AT_decl_column : 17
    <dcb>   DW_AT_type        : <0xd6a>
    <dcf>   DW_AT_data_member_location: 20
 <2><dd0>: Abbrev Number: 1 (DW_TAG_member)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x405e8): AHB3RSTR
    <dd5>   DW_AT_decl_file   : 4
    <dd5>   DW_AT_decl_line   : 604
    <dd7>   DW_AT_decl_column : 17
    <dd7>   DW_AT_type        : <0xd6a>
    <ddb>   DW_AT_data_member_location: 24
 <2><ddc>: Abbrev Number: 1 (DW_TAG_member)
    <ddd>   DW_AT_name        : (indirect string, offset: 0xb7082): RESERVED0
    <de1>   DW_AT_decl_file   : 4
    <de1>   DW_AT_decl_line   : 605
    <de3>   DW_AT_decl_column : 17
    <de3>   DW_AT_type        : <0xd5e>
    <de7>   DW_AT_data_member_location: 28
 <2><de8>: Abbrev Number: 1 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x156de): APB1RSTR
    <ded>   DW_AT_decl_file   : 4
    <ded>   DW_AT_decl_line   : 606
    <def>   DW_AT_decl_column : 17
    <def>   DW_AT_type        : <0xd6a>
    <df3>   DW_AT_data_member_location: 32
 <2><df4>: Abbrev Number: 1 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0x5450f): APB2RSTR
    <df9>   DW_AT_decl_file   : 4
    <df9>   DW_AT_decl_line   : 607
    <dfb>   DW_AT_decl_column : 17
    <dfb>   DW_AT_type        : <0xd6a>
    <dff>   DW_AT_data_member_location: 36
 <2><e00>: Abbrev Number: 1 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0xb708c): RESERVED1
    <e05>   DW_AT_decl_file   : 4
    <e05>   DW_AT_decl_line   : 608
    <e07>   DW_AT_decl_column : 17
    <e07>   DW_AT_type        : <0xd6f>
    <e0b>   DW_AT_data_member_location: 40
 <2><e0c>: Abbrev Number: 1 (DW_TAG_member)
    <e0d>   DW_AT_name        : (indirect string, offset: 0xf5ae): AHB1ENR
    <e11>   DW_AT_decl_file   : 4
    <e11>   DW_AT_decl_line   : 609
    <e13>   DW_AT_decl_column : 17
    <e13>   DW_AT_type        : <0xd6a>
    <e17>   DW_AT_data_member_location: 48
 <2><e18>: Abbrev Number: 1 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0x340eb): AHB2ENR
    <e1d>   DW_AT_decl_file   : 4
    <e1d>   DW_AT_decl_line   : 610
    <e1f>   DW_AT_decl_column : 17
    <e1f>   DW_AT_type        : <0xd6a>
    <e23>   DW_AT_data_member_location: 52
 <2><e24>: Abbrev Number: 1 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x57584): AHB3ENR
    <e29>   DW_AT_decl_file   : 4
    <e29>   DW_AT_decl_line   : 611
    <e2b>   DW_AT_decl_column : 17
    <e2b>   DW_AT_type        : <0xd6a>
    <e2f>   DW_AT_data_member_location: 56
 <2><e30>: Abbrev Number: 1 (DW_TAG_member)
    <e31>   DW_AT_name        : (indirect string, offset: 0xb7096): RESERVED2
    <e35>   DW_AT_decl_file   : 4
    <e35>   DW_AT_decl_line   : 612
    <e37>   DW_AT_decl_column : 17
    <e37>   DW_AT_type        : <0xd5e>
    <e3b>   DW_AT_data_member_location: 60
 <2><e3c>: Abbrev Number: 1 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x6f7e8): APB1ENR
    <e41>   DW_AT_decl_file   : 4
    <e41>   DW_AT_decl_line   : 613
    <e43>   DW_AT_decl_column : 17
    <e43>   DW_AT_type        : <0xd6a>
    <e47>   DW_AT_data_member_location: 64
 <2><e48>: Abbrev Number: 1 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x16c94): APB2ENR
    <e4d>   DW_AT_decl_file   : 4
    <e4d>   DW_AT_decl_line   : 614
    <e4f>   DW_AT_decl_column : 17
    <e4f>   DW_AT_type        : <0xd6a>
    <e53>   DW_AT_data_member_location: 68
 <2><e54>: Abbrev Number: 1 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0xb70a0): RESERVED3
    <e59>   DW_AT_decl_file   : 4
    <e59>   DW_AT_decl_line   : 615
    <e5b>   DW_AT_decl_column : 17
    <e5b>   DW_AT_type        : <0xd6f>
    <e5f>   DW_AT_data_member_location: 72
 <2><e60>: Abbrev Number: 1 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0x9e399): AHB1LPENR
    <e65>   DW_AT_decl_file   : 4
    <e65>   DW_AT_decl_line   : 616
    <e67>   DW_AT_decl_column : 17
    <e67>   DW_AT_type        : <0xd6a>
    <e6b>   DW_AT_data_member_location: 80
 <2><e6c>: Abbrev Number: 1 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x2c0d6): AHB2LPENR
    <e71>   DW_AT_decl_file   : 4
    <e71>   DW_AT_decl_line   : 617
    <e73>   DW_AT_decl_column : 17
    <e73>   DW_AT_type        : <0xd6a>
    <e77>   DW_AT_data_member_location: 84
 <2><e78>: Abbrev Number: 1 (DW_TAG_member)
    <e79>   DW_AT_name        : (indirect string, offset: 0x82f27): AHB3LPENR
    <e7d>   DW_AT_decl_file   : 4
    <e7d>   DW_AT_decl_line   : 618
    <e7f>   DW_AT_decl_column : 17
    <e7f>   DW_AT_type        : <0xd6a>
    <e83>   DW_AT_data_member_location: 88
 <2><e84>: Abbrev Number: 1 (DW_TAG_member)
    <e85>   DW_AT_name        : (indirect string, offset: 0xb70aa): RESERVED4
    <e89>   DW_AT_decl_file   : 4
    <e89>   DW_AT_decl_line   : 619
    <e8b>   DW_AT_decl_column : 17
    <e8b>   DW_AT_type        : <0xd5e>
    <e8f>   DW_AT_data_member_location: 92
 <2><e90>: Abbrev Number: 1 (DW_TAG_member)
    <e91>   DW_AT_name        : (indirect string, offset: 0xa2df6): APB1LPENR
    <e95>   DW_AT_decl_file   : 4
    <e95>   DW_AT_decl_line   : 620
    <e97>   DW_AT_decl_column : 17
    <e97>   DW_AT_type        : <0xd6a>
    <e9b>   DW_AT_data_member_location: 96
 <2><e9c>: Abbrev Number: 1 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x31bf5): APB2LPENR
    <ea1>   DW_AT_decl_file   : 4
    <ea1>   DW_AT_decl_line   : 621
    <ea3>   DW_AT_decl_column : 17
    <ea3>   DW_AT_type        : <0xd6a>
    <ea7>   DW_AT_data_member_location: 100
 <2><ea8>: Abbrev Number: 1 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0xb70b4): RESERVED5
    <ead>   DW_AT_decl_file   : 4
    <ead>   DW_AT_decl_line   : 622
    <eaf>   DW_AT_decl_column : 17
    <eaf>   DW_AT_type        : <0xd6f>
    <eb3>   DW_AT_data_member_location: 104
 <2><eb4>: Abbrev Number: 1 (DW_TAG_member)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x1b05c): BDCR
    <eb9>   DW_AT_decl_file   : 4
    <eb9>   DW_AT_decl_line   : 623
    <ebb>   DW_AT_decl_column : 17
    <ebb>   DW_AT_type        : <0xd6a>
    <ebf>   DW_AT_data_member_location: 112
 <2><ec0>: Abbrev Number: 3 (DW_TAG_member)
    <ec1>   DW_AT_name        : CSR
    <ec5>   DW_AT_decl_file   : 4
    <ec5>   DW_AT_decl_line   : 624
    <ec7>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0xd6a>
    <ecb>   DW_AT_data_member_location: 116
 <2><ecc>: Abbrev Number: 1 (DW_TAG_member)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x73cf6): RESERVED6
    <ed1>   DW_AT_decl_file   : 4
    <ed1>   DW_AT_decl_line   : 625
    <ed3>   DW_AT_decl_column : 17
    <ed3>   DW_AT_type        : <0xd6f>
    <ed7>   DW_AT_data_member_location: 120
 <2><ed8>: Abbrev Number: 1 (DW_TAG_member)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x66f88): SSCGR
    <edd>   DW_AT_decl_file   : 4
    <edd>   DW_AT_decl_line   : 626
    <edf>   DW_AT_decl_column : 17
    <edf>   DW_AT_type        : <0xd6a>
    <ee3>   DW_AT_data_member_location: 128
 <2><ee4>: Abbrev Number: 1 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x40f0c): PLLI2SCFGR
    <ee9>   DW_AT_decl_file   : 4
    <ee9>   DW_AT_decl_line   : 627
    <eeb>   DW_AT_decl_column : 17
    <eeb>   DW_AT_type        : <0xd6a>
    <eef>   DW_AT_data_member_location: 132
 <2><ef0>: Abbrev Number: 0
 <1><ef1>: Abbrev Number: 12 (DW_TAG_typedef)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x5a178): RCC_TypeDef
    <ef6>   DW_AT_decl_file   : 4
    <ef7>   DW_AT_decl_line   : 628
    <ef9>   DW_AT_decl_column : 3
    <efa>   DW_AT_type        : <0xd7f>
 <1><efe>: Abbrev Number: 2 (DW_TAG_base_type)
    <eff>   DW_AT_byte_size   : 8
    <f00>   DW_AT_encoding    : 4	(float)
    <f01>   DW_AT_name        : (indirect string, offset: 0xc33e0): long double
 <1><f05>: Abbrev Number: 13 (DW_TAG_subprogram)
    <f06>   DW_AT_external    : 1
    <f06>   DW_AT_name        : (indirect string, offset: 0xc2b9c): HAL_MspInit
    <f0a>   DW_AT_decl_file   : 1
    <f0b>   DW_AT_decl_line   : 63
    <f0c>   DW_AT_decl_column : 6
    <f0d>   DW_AT_prototyped  : 1
    <f0d>   DW_AT_low_pc      : 0x8000898
    <f11>   DW_AT_high_pc     : 0x50
    <f15>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f17>   DW_AT_call_all_calls: 1
 <2><f17>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <f18>   DW_AT_low_pc      : 0x800089e
    <f1c>   DW_AT_high_pc     : 0x1c
    <f20>   DW_AT_sibling     : <0xf32>
 <3><f24>: Abbrev Number: 5 (DW_TAG_variable)
    <f25>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <f29>   DW_AT_decl_file   : 1
    <f29>   DW_AT_decl_line   : 70
    <f2a>   DW_AT_decl_column : 3
    <f2a>   DW_AT_type        : <0xd6a>
    <f2e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><f31>: Abbrev Number: 0
 <2><f32>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <f33>   DW_AT_low_pc      : 0x80008ba
    <f37>   DW_AT_high_pc     : 0x1c
 <3><f3b>: Abbrev Number: 5 (DW_TAG_variable)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <f40>   DW_AT_decl_file   : 1
    <f40>   DW_AT_decl_line   : 71
    <f41>   DW_AT_decl_column : 3
    <f41>   DW_AT_type        : <0xd6a>
    <f45>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><f48>: Abbrev Number: 0
 <2><f49>: Abbrev Number: 0
 <1><f4a>: Abbrev Number: 0
  Compilation Unit @ offset 0xf4b:
   Length:        0xbea (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x340
   Pointer Size:  4
 <0><f57>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <f58>   DW_AT_producer    : (indirect string, offset: 0x33617): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f5c>   DW_AT_language    : 29	(C11)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xc2ece): ../Core/Src/stm32f4xx_hal_timebase_tim.c
    <f61>   DW_AT_comp_dir    : (indirect string, offset: 0xc31a): /Users/sandeep/Documents/github-projects/frtos/free-rtos/first_project/Debug
    <f65>   DW_AT_ranges      : 0x4c
    <f69>   DW_AT_low_pc      : 0
    <f6d>   DW_AT_stmt_list   : 0xf70
    <f71>   DW_AT_macros      : 0x1ee1d
 <1><f75>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <f76>   DW_AT_encoding    : 5	(signed)
    <f77>   DW_AT_byte_size   : 1
    <f77>   DW_AT_type        : <0x1198>
    <f7b>   DW_AT_decl_file   : 2
    <f7c>   DW_AT_decl_line   : 66
    <f7d>   DW_AT_decl_column : 1
    <f7d>   DW_AT_sibling     : <0x1198>
 <2><f81>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f82>   DW_AT_name        : (indirect string, offset: 0xc2c7f): NonMaskableInt_IRQn
    <f86>   DW_AT_const_value : -14
 <2><f87>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f88>   DW_AT_name        : (indirect string, offset: 0xc2e6b): MemoryManagement_IRQn
    <f8c>   DW_AT_const_value : -12
 <2><f8d>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f8e>   DW_AT_name        : (indirect string, offset: 0xc3093): BusFault_IRQn
    <f92>   DW_AT_const_value : -11
 <2><f93>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f94>   DW_AT_name        : (indirect string, offset: 0xc2fb7): UsageFault_IRQn
    <f98>   DW_AT_const_value : -10
 <2><f99>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f9a>   DW_AT_name        : (indirect string, offset: 0xc2bc8): SVCall_IRQn
    <f9e>   DW_AT_const_value : -5
 <2><f9f>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fa0>   DW_AT_name        : (indirect string, offset: 0xc2e81): DebugMonitor_IRQn
    <fa4>   DW_AT_const_value : -4
 <2><fa5>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xc2f09): PendSV_IRQn
    <faa>   DW_AT_const_value : -2
 <2><fab>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fac>   DW_AT_name        : (indirect string, offset: 0xc30c1): SysTick_IRQn
    <fb0>   DW_AT_const_value : -1
 <2><fb1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb2>   DW_AT_name        : (indirect string, offset: 0xc300d): WWDG_IRQn
    <fb6>   DW_AT_const_value : 0
 <2><fb7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb8>   DW_AT_name        : (indirect string, offset: 0xc2c76): PVD_IRQn
    <fbc>   DW_AT_const_value : 1
 <2><fbd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fbe>   DW_AT_name        : (indirect string, offset: 0xc3197): TAMP_STAMP_IRQn
    <fc2>   DW_AT_const_value : 2
 <2><fc3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc4>   DW_AT_name        : (indirect string, offset: 0xc2f59): RTC_WKUP_IRQn
    <fc8>   DW_AT_const_value : 3
 <2><fc9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fca>   DW_AT_name        : (indirect string, offset: 0xc2cde): FLASH_IRQn
    <fce>   DW_AT_const_value : 4
 <2><fcf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fd0>   DW_AT_name        : (indirect string, offset: 0xc308a): RCC_IRQn
    <fd4>   DW_AT_const_value : 5
 <2><fd5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fd6>   DW_AT_name        : (indirect string, offset: 0xc2e93): EXTI0_IRQn
    <fda>   DW_AT_const_value : 6
 <2><fdb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fdc>   DW_AT_name        : (indirect string, offset: 0xc318c): EXTI1_IRQn
    <fe0>   DW_AT_const_value : 7
 <2><fe1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xc2dcc): EXTI2_IRQn
    <fe6>   DW_AT_const_value : 8
 <2><fe7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fe8>   DW_AT_name        : (indirect string, offset: 0xc3060): EXTI3_IRQn
    <fec>   DW_AT_const_value : 9
 <2><fed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fee>   DW_AT_name        : (indirect string, offset: 0xc2c6b): EXTI4_IRQn
    <ff2>   DW_AT_const_value : 10
 <2><ff3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ff4>   DW_AT_name        : (indirect string, offset: 0xc2c39): DMA1_Stream0_IRQn
    <ff8>   DW_AT_const_value : 11
 <2><ff9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xc2e4c): DMA1_Stream1_IRQn
    <ffe>   DW_AT_const_value : 12
 <2><fff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1000>   DW_AT_name        : (indirect string, offset: 0xc2e18): DMA1_Stream2_IRQn
    <1004>   DW_AT_const_value : 13
 <2><1005>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1006>   DW_AT_name        : (indirect string, offset: 0xc313e): DMA1_Stream3_IRQn
    <100a>   DW_AT_const_value : 14
 <2><100b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <100c>   DW_AT_name        : (indirect string, offset: 0xc2d03): DMA1_Stream4_IRQn
    <1010>   DW_AT_const_value : 15
 <2><1011>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1012>   DW_AT_name        : (indirect string, offset: 0xc304e): DMA1_Stream5_IRQn
    <1016>   DW_AT_const_value : 16
 <2><1017>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1018>   DW_AT_name        : (indirect string, offset: 0xc2cad): DMA1_Stream6_IRQn
    <101c>   DW_AT_const_value : 17
 <2><101d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <101e>   DW_AT_name        : (indirect string, offset: 0xc2eae): ADC_IRQn
    <1022>   DW_AT_const_value : 18
 <2><1023>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1024>   DW_AT_name        : (indirect string, offset: 0xc3167): CAN1_TX_IRQn
    <1028>   DW_AT_const_value : 19
 <2><1029>: Abbrev Number: 1 (DW_TAG_enumerator)
    <102a>   DW_AT_name        : (indirect string, offset: 0xc2cbf): CAN1_RX0_IRQn
    <102e>   DW_AT_const_value : 20
 <2><102f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1030>   DW_AT_name        : (indirect string, offset: 0xc2fd5): CAN1_RX1_IRQn
    <1034>   DW_AT_const_value : 21
 <2><1035>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1036>   DW_AT_name        : (indirect string, offset: 0xc2fc7): CAN1_SCE_IRQn
    <103a>   DW_AT_const_value : 22
 <2><103b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <103c>   DW_AT_name        : (indirect string, offset: 0xc3041): EXTI9_5_IRQn
    <1040>   DW_AT_const_value : 23
 <2><1041>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1042>   DW_AT_name        : (indirect string, offset: 0xc2de3): TIM1_BRK_TIM9_IRQn
    <1046>   DW_AT_const_value : 24
 <2><1047>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1048>   DW_AT_name        : (indirect string, offset: 0xc2f46): TIM1_UP_TIM10_IRQn
    <104c>   DW_AT_const_value : 25
 <2><104d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <104e>   DW_AT_name        : (indirect string, offset: 0xc2e34): TIM1_TRG_COM_TIM11_IRQn
    <1052>   DW_AT_const_value : 26
 <2><1053>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1054>   DW_AT_name        : (indirect string, offset: 0xc2e5e): TIM1_CC_IRQn
    <1058>   DW_AT_const_value : 27
 <2><1059>: Abbrev Number: 1 (DW_TAG_enumerator)
