Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xce0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3364c): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xacfe2): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x359b7): /Users/sandeep/Documents/github-projects/frtos/free-rtos/led_tasks/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x61583): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x39073): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 7 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xbb710): unsigned char
 <1><44>: Abbrev Number: 7 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x906c6): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x9e531): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 7 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xb9f81): short unsigned int
 <1><5e>: Abbrev Number: 7 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xff40): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x7ba89): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 7 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4a90e): long unsigned int
 <1><78>: Abbrev Number: 7 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x58dc2): long long int
 <1><7f>: Abbrev Number: 7 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x28f36): long long unsigned int
 <1><86>: Abbrev Number: 25 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 7 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xf63f): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x39075): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0xcc72c): uint16_t
    <a5>   DW_AT_decl_file   : 4
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xcc70c): uint32_t
    <b1>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 15 (DW_TAG_array_type)
    <be>   DW_AT_type        : <0xac>
    <c2>   DW_AT_sibling     : <0xcd>
 <2><c6>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <c7>   DW_AT_type        : <0x8d>
    <cb>   DW_AT_upper_bound : 1
 <2><cc>: Abbrev Number: 0
 <1><cd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ce>   DW_AT_byte_size   : 24
    <cf>   DW_AT_decl_file   : 5
    <d0>   DW_AT_decl_line   : 345
    <d2>   DW_AT_decl_column : 9
    <d2>   DW_AT_sibling     : <0x124>
 <2><d6>: Abbrev Number: 4 (DW_TAG_member)
    <d7>   DW_AT_name        : CR
    <da>   DW_AT_decl_file   : 5
    <da>   DW_AT_decl_line   : 347
    <dc>   DW_AT_decl_column : 17
    <dc>   DW_AT_type        : <0xb8>
    <e0>   DW_AT_data_member_location: 0
 <2><e1>: Abbrev Number: 1 (DW_TAG_member)
    <e2>   DW_AT_name        : (indirect string, offset: 0x4a18c): NDTR
    <e6>   DW_AT_decl_file   : 5
    <e7>   DW_AT_decl_line   : 348
    <e9>   DW_AT_decl_column : 17
    <ea>   DW_AT_type        : <0xb8>
    <ee>   DW_AT_data_member_location: 4
 <2><ef>: Abbrev Number: 4 (DW_TAG_member)
    <f0>   DW_AT_name        : PAR
    <f4>   DW_AT_decl_file   : 5
    <f4>   DW_AT_decl_line   : 349
    <f6>   DW_AT_decl_column : 17
    <f6>   DW_AT_type        : <0xb8>
    <fa>   DW_AT_data_member_location: 8
 <2><fb>: Abbrev Number: 1 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x50f0d): M0AR
    <100>   DW_AT_decl_file   : 5
    <101>   DW_AT_decl_line   : 350
    <103>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xb8>
    <108>   DW_AT_data_member_location: 12
 <2><109>: Abbrev Number: 1 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x6b922): M1AR
    <10e>   DW_AT_decl_file   : 5
    <10f>   DW_AT_decl_line   : 351
    <111>   DW_AT_decl_column : 17
    <112>   DW_AT_type        : <0xb8>
    <116>   DW_AT_data_member_location: 16
 <2><117>: Abbrev Number: 4 (DW_TAG_member)
    <118>   DW_AT_name        : FCR
    <11c>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 352
    <11e>   DW_AT_decl_column : 17
    <11e>   DW_AT_type        : <0xb8>
    <122>   DW_AT_data_member_location: 20
 <2><123>: Abbrev Number: 0
 <1><124>: Abbrev Number: 8 (DW_TAG_typedef)
    <125>   DW_AT_name        : (indirect string, offset: 0xb022b): DMA_Stream_TypeDef
    <129>   DW_AT_decl_file   : 5
    <12a>   DW_AT_decl_line   : 353
    <12c>   DW_AT_decl_column : 3
    <12c>   DW_AT_type        : <0xcd>
 <1><130>: Abbrev Number: 12 (DW_TAG_structure_type)
    <131>   DW_AT_byte_size   : 40
    <132>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 526
    <135>   DW_AT_decl_column : 9
    <135>   DW_AT_sibling     : <0x1b2>
 <2><139>: Abbrev Number: 1 (DW_TAG_member)
    <13a>   DW_AT_name        : (indirect string, offset: 0x7e365): MODER
    <13e>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 528
    <141>   DW_AT_decl_column : 17
    <142>   DW_AT_type        : <0xb8>
    <146>   DW_AT_data_member_location: 0
 <2><147>: Abbrev Number: 1 (DW_TAG_member)
    <148>   DW_AT_name        : (indirect string, offset: 0x96090): OTYPER
    <14c>   DW_AT_decl_file   : 5
    <14d>   DW_AT_decl_line   : 529
    <14f>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xb8>
    <154>   DW_AT_data_member_location: 4
 <2><155>: Abbrev Number: 1 (DW_TAG_member)
    <156>   DW_AT_name        : (indirect string, offset: 0xa8b9b): OSPEEDR
    <15a>   DW_AT_decl_file   : 5
    <15b>   DW_AT_decl_line   : 530
    <15d>   DW_AT_decl_column : 17
    <15e>   DW_AT_type        : <0xb8>
    <162>   DW_AT_data_member_location: 8
 <2><163>: Abbrev Number: 1 (DW_TAG_member)
    <164>   DW_AT_name        : (indirect string, offset: 0x706d0): PUPDR
    <168>   DW_AT_decl_file   : 5
    <169>   DW_AT_decl_line   : 531
    <16b>   DW_AT_decl_column : 17
    <16c>   DW_AT_type        : <0xb8>
    <170>   DW_AT_data_member_location: 12
 <2><171>: Abbrev Number: 4 (DW_TAG_member)
    <172>   DW_AT_name        : IDR
    <176>   DW_AT_decl_file   : 5
    <176>   DW_AT_decl_line   : 532
    <178>   DW_AT_decl_column : 17
    <178>   DW_AT_type        : <0xb8>
    <17c>   DW_AT_data_member_location: 16
 <2><17d>: Abbrev Number: 4 (DW_TAG_member)
    <17e>   DW_AT_name        : ODR
    <182>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 533
    <184>   DW_AT_decl_column : 17
    <184>   DW_AT_type        : <0xb8>
    <188>   DW_AT_data_member_location: 20
 <2><189>: Abbrev Number: 1 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x2c4ba): BSRR
    <18e>   DW_AT_decl_file   : 5
    <18f>   DW_AT_decl_line   : 534
    <191>   DW_AT_decl_column : 17
    <192>   DW_AT_type        : <0xb8>
    <196>   DW_AT_data_member_location: 24
 <2><197>: Abbrev Number: 1 (DW_TAG_member)
    <198>   DW_AT_name        : (indirect string, offset: 0xa6421): LCKR
    <19c>   DW_AT_decl_file   : 5
    <19d>   DW_AT_decl_line   : 535
    <19f>   DW_AT_decl_column : 17
    <1a0>   DW_AT_type        : <0xb8>
    <1a4>   DW_AT_data_member_location: 28
 <2><1a5>: Abbrev Number: 4 (DW_TAG_member)
    <1a6>   DW_AT_name        : AFR
    <1aa>   DW_AT_decl_file   : 5
    <1aa>   DW_AT_decl_line   : 536
    <1ac>   DW_AT_decl_column : 17
    <1ac>   DW_AT_type        : <0x1c2>
    <1b0>   DW_AT_data_member_location: 32
 <2><1b1>: Abbrev Number: 0
 <1><1b2>: Abbrev Number: 15 (DW_TAG_array_type)
    <1b3>   DW_AT_type        : <0xb8>
    <1b7>   DW_AT_sibling     : <0x1c2>
 <2><1bb>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <1bc>   DW_AT_type        : <0x8d>
    <1c0>   DW_AT_upper_bound : 1
 <2><1c1>: Abbrev Number: 0
 <1><1c2>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <1c3>   DW_AT_type        : <0x1b2>
 <1><1c7>: Abbrev Number: 8 (DW_TAG_typedef)
    <1c8>   DW_AT_name        : (indirect string, offset: 0xbc7fc): GPIO_TypeDef
    <1cc>   DW_AT_decl_file   : 5
    <1cd>   DW_AT_decl_line   : 537
    <1cf>   DW_AT_decl_column : 3
    <1cf>   DW_AT_type        : <0x130>
 <1><1d3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1d4>   DW_AT_byte_size   : 8
    <1d5>   DW_AT_decl_file   : 5
    <1d6>   DW_AT_decl_line   : 586
    <1d8>   DW_AT_decl_column : 9
    <1d8>   DW_AT_sibling     : <0x1f4>
 <2><1dc>: Abbrev Number: 4 (DW_TAG_member)
    <1dd>   DW_AT_name        : CR
    <1e0>   DW_AT_decl_file   : 5
    <1e0>   DW_AT_decl_line   : 588
    <1e2>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0xb8>
    <1e6>   DW_AT_data_member_location: 0
 <2><1e7>: Abbrev Number: 4 (DW_TAG_member)
    <1e8>   DW_AT_name        : CSR
    <1ec>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 589
    <1ee>   DW_AT_decl_column : 17
    <1ee>   DW_AT_type        : <0xb8>
    <1f2>   DW_AT_data_member_location: 4
 <2><1f3>: Abbrev Number: 0
 <1><1f4>: Abbrev Number: 8 (DW_TAG_typedef)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x8c00a): PWR_TypeDef
    <1f9>   DW_AT_decl_file   : 5
    <1fa>   DW_AT_decl_line   : 590
    <1fc>   DW_AT_decl_column : 3
    <1fc>   DW_AT_type        : <0x1d3>
 <1><200>: Abbrev Number: 12 (DW_TAG_structure_type)
    <201>   DW_AT_byte_size   : 136
    <202>   DW_AT_decl_file   : 5
    <203>   DW_AT_decl_line   : 596
    <205>   DW_AT_decl_column : 9
    <205>   DW_AT_sibling     : <0x3a7>
 <2><209>: Abbrev Number: 4 (DW_TAG_member)
    <20a>   DW_AT_name        : CR
    <20d>   DW_AT_decl_file   : 5
    <20d>   DW_AT_decl_line   : 598
    <20f>   DW_AT_decl_column : 17
    <20f>   DW_AT_type        : <0xb8>
    <213>   DW_AT_data_member_location: 0
 <2><214>: Abbrev Number: 1 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x8777c): PLLCFGR
    <219>   DW_AT_decl_file   : 5
    <21a>   DW_AT_decl_line   : 599
    <21c>   DW_AT_decl_column : 17
    <21d>   DW_AT_type        : <0xb8>
    <221>   DW_AT_data_member_location: 4
 <2><222>: Abbrev Number: 1 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x8777f): CFGR
    <227>   DW_AT_decl_file   : 5
    <228>   DW_AT_decl_line   : 600
    <22a>   DW_AT_decl_column : 17
    <22b>   DW_AT_type        : <0xb8>
    <22f>   DW_AT_data_member_location: 8
 <2><230>: Abbrev Number: 4 (DW_TAG_member)
    <231>   DW_AT_name        : CIR
    <235>   DW_AT_decl_file   : 5
    <235>   DW_AT_decl_line   : 601
    <237>   DW_AT_decl_column : 17
    <237>   DW_AT_type        : <0xb8>
    <23b>   DW_AT_data_member_location: 12
 <2><23c>: Abbrev Number: 1 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x9a59a): AHB1RSTR
    <241>   DW_AT_decl_file   : 5
    <242>   DW_AT_decl_line   : 602
    <244>   DW_AT_decl_column : 17
    <245>   DW_AT_type        : <0xb8>
    <249>   DW_AT_data_member_location: 16
 <2><24a>: Abbrev Number: 1 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x15b89): AHB2RSTR
    <24f>   DW_AT_decl_file   : 5
    <250>   DW_AT_decl_line   : 603
    <252>   DW_AT_decl_column : 17
    <253>   DW_AT_type        : <0xb8>
    <257>   DW_AT_data_member_location: 20
 <2><258>: Abbrev Number: 1 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x4064a): AHB3RSTR
    <25d>   DW_AT_decl_file   : 5
    <25e>   DW_AT_decl_line   : 604
    <260>   DW_AT_decl_column : 17
    <261>   DW_AT_type        : <0xb8>
    <265>   DW_AT_data_member_location: 24
 <2><266>: Abbrev Number: 1 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0xb7074): RESERVED0
    <26b>   DW_AT_decl_file   : 5
    <26c>   DW_AT_decl_line   : 605
    <26e>   DW_AT_decl_column : 17
    <26f>   DW_AT_type        : <0xac>
    <273>   DW_AT_data_member_location: 28
 <2><274>: Abbrev Number: 1 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x15702): APB1RSTR
    <279>   DW_AT_decl_file   : 5
    <27a>   DW_AT_decl_line   : 606
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xb8>
    <281>   DW_AT_data_member_location: 32
 <2><282>: Abbrev Number: 1 (DW_TAG_member)
    <283>   DW_AT_name        : (indirect string, offset: 0x5454a): APB2RSTR
    <287>   DW_AT_decl_file   : 5
    <288>   DW_AT_decl_line   : 607
    <28a>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0xb8>
    <28f>   DW_AT_data_member_location: 36
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xb707e): RESERVED1
    <295>   DW_AT_decl_file   : 5
    <296>   DW_AT_decl_line   : 608
    <298>   DW_AT_decl_column : 17
    <299>   DW_AT_type        : <0xbd>
    <29d>   DW_AT_data_member_location: 40
 <2><29e>: Abbrev Number: 1 (DW_TAG_member)
    <29f>   DW_AT_name        : (indirect string, offset: 0xf5d4): AHB1ENR
    <2a3>   DW_AT_decl_file   : 5
    <2a4>   DW_AT_decl_line   : 609
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0xb8>
    <2ab>   DW_AT_data_member_location: 48
 <2><2ac>: Abbrev Number: 1 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x34120): AHB2ENR
    <2b1>   DW_AT_decl_file   : 5
    <2b2>   DW_AT_decl_line   : 610
    <2b4>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xb8>
    <2b9>   DW_AT_data_member_location: 52
 <2><2ba>: Abbrev Number: 1 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x575bf): AHB3ENR
    <2bf>   DW_AT_decl_file   : 5
    <2c0>   DW_AT_decl_line   : 611
    <2c2>   DW_AT_decl_column : 17
    <2c3>   DW_AT_type        : <0xb8>
    <2c7>   DW_AT_data_member_location: 56
 <2><2c8>: Abbrev Number: 1 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0xb7088): RESERVED2
    <2cd>   DW_AT_decl_file   : 5
    <2ce>   DW_AT_decl_line   : 612
    <2d0>   DW_AT_decl_column : 17
    <2d1>   DW_AT_type        : <0xac>
    <2d5>   DW_AT_data_member_location: 60
 <2><2d6>: Abbrev Number: 1 (DW_TAG_member)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x6f860): APB1ENR
    <2db>   DW_AT_decl_file   : 5
    <2dc>   DW_AT_decl_line   : 613
    <2de>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0xb8>
    <2e3>   DW_AT_data_member_location: 64
 <2><2e4>: Abbrev Number: 1 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x16cb8): APB2ENR
    <2e9>   DW_AT_decl_file   : 5
    <2ea>   DW_AT_decl_line   : 614
    <2ec>   DW_AT_decl_column : 17
    <2ed>   DW_AT_type        : <0xb8>
    <2f1>   DW_AT_data_member_location: 68
 <2><2f2>: Abbrev Number: 1 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0xb7092): RESERVED3
    <2f7>   DW_AT_decl_file   : 5
    <2f8>   DW_AT_decl_line   : 615
    <2fa>   DW_AT_decl_column : 17
    <2fb>   DW_AT_type        : <0xbd>
    <2ff>   DW_AT_data_member_location: 72
 <2><300>: Abbrev Number: 1 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0x9e3b6): AHB1LPENR
    <305>   DW_AT_decl_file   : 5
    <306>   DW_AT_decl_line   : 616
    <308>   DW_AT_decl_column : 17
    <309>   DW_AT_type        : <0xb8>
    <30d>   DW_AT_data_member_location: 80
 <2><30e>: Abbrev Number: 1 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x2c10b): AHB2LPENR
    <313>   DW_AT_decl_file   : 5
    <314>   DW_AT_decl_line   : 617
    <316>   DW_AT_decl_column : 17
    <317>   DW_AT_type        : <0xb8>
    <31b>   DW_AT_data_member_location: 84
 <2><31c>: Abbrev Number: 1 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x82fa6): AHB3LPENR
    <321>   DW_AT_decl_file   : 5
    <322>   DW_AT_decl_line   : 618
    <324>   DW_AT_decl_column : 17
    <325>   DW_AT_type        : <0xb8>
    <329>   DW_AT_data_member_location: 88
 <2><32a>: Abbrev Number: 1 (DW_TAG_member)
    <32b>   DW_AT_name        : (indirect string, offset: 0xb709c): RESERVED4
    <32f>   DW_AT_decl_file   : 5
    <330>   DW_AT_decl_line   : 619
    <332>   DW_AT_decl_column : 17
    <333>   DW_AT_type        : <0xac>
    <337>   DW_AT_data_member_location: 92
 <2><338>: Abbrev Number: 1 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0xa2e13): APB1LPENR
    <33d>   DW_AT_decl_file   : 5
    <33e>   DW_AT_decl_line   : 620
    <340>   DW_AT_decl_column : 17
    <341>   DW_AT_type        : <0xb8>
    <345>   DW_AT_data_member_location: 96
 <2><346>: Abbrev Number: 1 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x31c2a): APB2LPENR
    <34b>   DW_AT_decl_file   : 5
    <34c>   DW_AT_decl_line   : 621
    <34e>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0xb8>
    <353>   DW_AT_data_member_location: 100
 <2><354>: Abbrev Number: 1 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xb70a6): RESERVED5
    <359>   DW_AT_decl_file   : 5
    <35a>   DW_AT_decl_line   : 622
    <35c>   DW_AT_decl_column : 17
    <35d>   DW_AT_type        : <0xbd>
    <361>   DW_AT_data_member_location: 104
 <2><362>: Abbrev Number: 1 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x1b080): BDCR
    <367>   DW_AT_decl_file   : 5
    <368>   DW_AT_decl_line   : 623
    <36a>   DW_AT_decl_column : 17
    <36b>   DW_AT_type        : <0xb8>
    <36f>   DW_AT_data_member_location: 112
 <2><370>: Abbrev Number: 4 (DW_TAG_member)
    <371>   DW_AT_name        : CSR
    <375>   DW_AT_decl_file   : 5
    <375>   DW_AT_decl_line   : 624
    <377>   DW_AT_decl_column : 17
    <377>   DW_AT_type        : <0xb8>
    <37b>   DW_AT_data_member_location: 116
 <2><37c>: Abbrev Number: 1 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x73d75): RESERVED6
    <381>   DW_AT_decl_file   : 5
    <382>   DW_AT_decl_line   : 625
    <384>   DW_AT_decl_column : 17
    <385>   DW_AT_type        : <0xbd>
    <389>   DW_AT_data_member_location: 120
 <2><38a>: Abbrev Number: 1 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x67000): SSCGR
    <38f>   DW_AT_decl_file   : 5
    <390>   DW_AT_decl_line   : 626
    <392>   DW_AT_decl_column : 17
    <393>   DW_AT_type        : <0xb8>
    <397>   DW_AT_data_member_location: 128
 <2><398>: Abbrev Number: 1 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0x40f6e): PLLI2SCFGR
    <39d>   DW_AT_decl_file   : 5
    <39e>   DW_AT_decl_line   : 627
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0xb8>
    <3a5>   DW_AT_data_member_location: 132
 <2><3a6>: Abbrev Number: 0
 <1><3a7>: Abbrev Number: 8 (DW_TAG_typedef)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x5a1b3): RCC_TypeDef
    <3ac>   DW_AT_decl_file   : 5
    <3ad>   DW_AT_decl_line   : 628
    <3af>   DW_AT_decl_column : 3
    <3af>   DW_AT_type        : <0x200>
 <1><3b3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <3b4>   DW_AT_byte_size   : 84
    <3b5>   DW_AT_decl_file   : 5
    <3b6>   DW_AT_decl_line   : 728
    <3b8>   DW_AT_decl_column : 9
    <3b8>   DW_AT_sibling     : <0x4cd>
 <2><3bc>: Abbrev Number: 4 (DW_TAG_member)
    <3bd>   DW_AT_name        : CR1
    <3c1>   DW_AT_decl_file   : 5
    <3c1>   DW_AT_decl_line   : 730
    <3c3>   DW_AT_decl_column : 17
    <3c3>   DW_AT_type        : <0xb8>
    <3c7>   DW_AT_data_member_location: 0
 <2><3c8>: Abbrev Number: 4 (DW_TAG_member)
    <3c9>   DW_AT_name        : CR2
    <3cd>   DW_AT_decl_file   : 5
    <3cd>   DW_AT_decl_line   : 731
    <3cf>   DW_AT_decl_column : 17
    <3cf>   DW_AT_type        : <0xb8>
    <3d3>   DW_AT_data_member_location: 4
 <2><3d4>: Abbrev Number: 1 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x397ff): SMCR
    <3d9>   DW_AT_decl_file   : 5
    <3da>   DW_AT_decl_line   : 732
    <3dc>   DW_AT_decl_column : 17
    <3dd>   DW_AT_type        : <0xb8>
    <3e1>   DW_AT_data_member_location: 8
 <2><3e2>: Abbrev Number: 1 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x3f6c3): DIER
    <3e7>   DW_AT_decl_file   : 5
    <3e8>   DW_AT_decl_line   : 733
    <3ea>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0xb8>
    <3ef>   DW_AT_data_member_location: 12
 <2><3f0>: Abbrev Number: 4 (DW_TAG_member)
    <3f1>   DW_AT_name        : SR
    <3f4>   DW_AT_decl_file   : 5
    <3f4>   DW_AT_decl_line   : 734
    <3f6>   DW_AT_decl_column : 17
    <3f6>   DW_AT_type        : <0xb8>
    <3fa>   DW_AT_data_member_location: 16
 <2><3fb>: Abbrev Number: 4 (DW_TAG_member)
    <3fc>   DW_AT_name        : EGR
    <400>   DW_AT_decl_file   : 5
    <400>   DW_AT_decl_line   : 735
    <402>   DW_AT_decl_column : 17
    <402>   DW_AT_type        : <0xb8>
    <406>   DW_AT_data_member_location: 20
 <2><407>: Abbrev Number: 1 (DW_TAG_member)
    <408>   DW_AT_name        : (indirect string, offset: 0xb0f94): CCMR1
    <40c>   DW_AT_decl_file   : 5
    <40d>   DW_AT_decl_line   : 736
    <40f>   DW_AT_decl_column : 17
    <410>   DW_AT_type        : <0xb8>
    <414>   DW_AT_data_member_location: 24
 <2><415>: Abbrev Number: 1 (DW_TAG_member)
    <416>   DW_AT_name        : (indirect string, offset: 0x4dd27): CCMR2
    <41a>   DW_AT_decl_file   : 5
    <41b>   DW_AT_decl_line   : 737
    <41d>   DW_AT_decl_column : 17
    <41e>   DW_AT_type        : <0xb8>
    <422>   DW_AT_data_member_location: 28
 <2><423>: Abbrev Number: 1 (DW_TAG_member)
    <424>   DW_AT_name        : (indirect string, offset: 0x2fba0): CCER
    <428>   DW_AT_decl_file   : 5
    <429>   DW_AT_decl_line   : 738
    <42b>   DW_AT_decl_column : 17
    <42c>   DW_AT_type        : <0xb8>
    <430>   DW_AT_data_member_location: 32
 <2><431>: Abbrev Number: 4 (DW_TAG_member)
    <432>   DW_AT_name        : CNT
    <436>   DW_AT_decl_file   : 5
    <436>   DW_AT_decl_line   : 739
    <438>   DW_AT_decl_column : 17
    <438>   DW_AT_type        : <0xb8>
    <43c>   DW_AT_data_member_location: 36
 <2><43d>: Abbrev Number: 4 (DW_TAG_member)
    <43e>   DW_AT_name        : PSC
    <442>   DW_AT_decl_file   : 5
    <442>   DW_AT_decl_line   : 740
    <444>   DW_AT_decl_column : 17
    <444>   DW_AT_type        : <0xb8>
    <448>   DW_AT_data_member_location: 40
 <2><449>: Abbrev Number: 4 (DW_TAG_member)
    <44a>   DW_AT_name        : ARR
    <44e>   DW_AT_decl_file   : 5
    <44e>   DW_AT_decl_line   : 741
    <450>   DW_AT_decl_column : 17
    <450>   DW_AT_type        : <0xb8>
    <454>   DW_AT_data_member_location: 44
 <2><455>: Abbrev Number: 4 (DW_TAG_member)
    <456>   DW_AT_name        : RCR
    <45a>   DW_AT_decl_file   : 5
    <45a>   DW_AT_decl_line   : 742
    <45c>   DW_AT_decl_column : 17
    <45c>   DW_AT_type        : <0xb8>
    <460>   DW_AT_data_member_location: 48
 <2><461>: Abbrev Number: 1 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0x16cb3): CCR1
    <466>   DW_AT_decl_file   : 5
    <467>   DW_AT_decl_line   : 743
    <469>   DW_AT_decl_column : 17
    <46a>   DW_AT_type        : <0xb8>
    <46e>   DW_AT_data_member_location: 52
 <2><46f>: Abbrev Number: 1 (DW_TAG_member)
    <470>   DW_AT_name        : (indirect string, offset: 0x51a70): CCR2
    <474>   DW_AT_decl_file   : 5
    <475>   DW_AT_decl_line   : 744
    <477>   DW_AT_decl_column : 17
    <478>   DW_AT_type        : <0xb8>
    <47c>   DW_AT_data_member_location: 56
 <2><47d>: Abbrev Number: 1 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x9414e): CCR3
    <482>   DW_AT_decl_file   : 5
    <483>   DW_AT_decl_line   : 745
    <485>   DW_AT_decl_column : 17
    <486>   DW_AT_type        : <0xb8>
    <48a>   DW_AT_data_member_location: 60
 <2><48b>: Abbrev Number: 1 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0xbd9b): CCR4
    <490>   DW_AT_decl_file   : 5
    <491>   DW_AT_decl_line   : 746
    <493>   DW_AT_decl_column : 17
    <494>   DW_AT_type        : <0xb8>
    <498>   DW_AT_data_member_location: 64
 <2><499>: Abbrev Number: 1 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x8432e): BDTR
    <49e>   DW_AT_decl_file   : 5
    <49f>   DW_AT_decl_line   : 747
    <4a1>   DW_AT_decl_column : 17
    <4a2>   DW_AT_type        : <0xb8>
    <4a6>   DW_AT_data_member_location: 68
 <2><4a7>: Abbrev Number: 4 (DW_TAG_member)
    <4a8>   DW_AT_name        : DCR
    <4ac>   DW_AT_decl_file   : 5
    <4ac>   DW_AT_decl_line   : 748
    <4ae>   DW_AT_decl_column : 17
    <4ae>   DW_AT_type        : <0xb8>
    <4b2>   DW_AT_data_member_location: 72
 <2><4b3>: Abbrev Number: 1 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0xa6a20): DMAR
    <4b8>   DW_AT_decl_file   : 5
    <4b9>   DW_AT_decl_line   : 749
    <4bb>   DW_AT_decl_column : 17
    <4bc>   DW_AT_type        : <0xb8>
    <4c0>   DW_AT_data_member_location: 76
 <2><4c1>: Abbrev Number: 4 (DW_TAG_member)
    <4c2>   DW_AT_name        : OR
    <4c5>   DW_AT_decl_file   : 5
    <4c5>   DW_AT_decl_line   : 750
    <4c7>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0xb8>
    <4cb>   DW_AT_data_member_location: 80
 <2><4cc>: Abbrev Number: 0
 <1><4cd>: Abbrev Number: 8 (DW_TAG_typedef)
    <4ce>   DW_AT_name        : (indirect string, offset: 0xb7bd6): TIM_TypeDef
    <4d2>   DW_AT_decl_file   : 5
    <4d3>   DW_AT_decl_line   : 751
    <4d5>   DW_AT_decl_column : 3
    <4d5>   DW_AT_type        : <0x3b3>
 <1><4d9>: Abbrev Number: 7 (DW_TAG_base_type)
    <4da>   DW_AT_byte_size   : 8
    <4db>   DW_AT_encoding    : 4	(float)
    <4dc>   DW_AT_name        : (indirect string, offset: 0xc33d2): long double
 <1><4e0>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <4e1>   DW_AT_encoding    : 7	(unsigned)
    <4e1>   DW_AT_byte_size   : 1
    <4e1>   DW_AT_type        : <0x3d>
    <4e5>   DW_AT_decl_file   : 6
    <4e6>   DW_AT_decl_line   : 39
    <4e7>   DW_AT_decl_column : 1
    <4e7>   DW_AT_sibling     : <0x504>
 <2><4eb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x42031): HAL_OK
    <4f0>   DW_AT_const_value : 0
 <2><4f1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x79870): HAL_ERROR
    <4f6>   DW_AT_const_value : 1
 <2><4f7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x2254e): HAL_BUSY
    <4fc>   DW_AT_const_value : 2
 <2><4fd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x39748): HAL_TIMEOUT
    <502>   DW_AT_const_value : 3
 <2><503>: Abbrev Number: 0
 <1><504>: Abbrev Number: 5 (DW_TAG_typedef)
    <505>   DW_AT_name        : (indirect string, offset: 0x2367): HAL_StatusTypeDef
    <509>   DW_AT_decl_file   : 6
    <50a>   DW_AT_decl_line   : 44
    <50b>   DW_AT_decl_column : 3
    <50c>   DW_AT_type        : <0x4e0>
 <1><510>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <511>   DW_AT_encoding    : 7	(unsigned)
    <511>   DW_AT_byte_size   : 1
    <511>   DW_AT_type        : <0x3d>
    <515>   DW_AT_decl_file   : 6
    <516>   DW_AT_decl_line   : 50
    <517>   DW_AT_decl_column : 1
    <517>   DW_AT_sibling     : <0x528>
 <2><51b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <51c>   DW_AT_name        : (indirect string, offset: 0x8f44a): HAL_UNLOCKED
    <520>   DW_AT_const_value : 0
 <2><521>: Abbrev Number: 3 (DW_TAG_enumerator)
    <522>   DW_AT_name        : (indirect string, offset: 0xc1da7): HAL_LOCKED
    <526>   DW_AT_const_value : 1
 <2><527>: Abbrev Number: 0
 <1><528>: Abbrev Number: 5 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x72d8c): HAL_LockTypeDef
    <52d>   DW_AT_decl_file   : 6
    <52e>   DW_AT_decl_line   : 53
    <52f>   DW_AT_decl_column : 3
    <530>   DW_AT_type        : <0x510>
 <1><534>: Abbrev Number: 13 (DW_TAG_structure_type)
    <535>   DW_AT_byte_size   : 24
    <536>   DW_AT_decl_file   : 7
    <537>   DW_AT_decl_line   : 45
    <538>   DW_AT_decl_column : 9
    <538>   DW_AT_sibling     : <0x58b>
 <2><53c>: Abbrev Number: 2 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x81f4c): PLLState
    <541>   DW_AT_decl_file   : 7
    <542>   DW_AT_decl_line   : 47
    <543>   DW_AT_decl_column : 12
    <544>   DW_AT_type        : <0xac>
    <548>   DW_AT_data_member_location: 0
 <2><549>: Abbrev Number: 2 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x865a5): PLLSource
    <54e>   DW_AT_decl_file   : 7
    <54f>   DW_AT_decl_line   : 50
    <550>   DW_AT_decl_column : 12
    <551>   DW_AT_type        : <0xac>
    <555>   DW_AT_data_member_location: 4
 <2><556>: Abbrev Number: 2 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0xa0abf): PLLM
    <55b>   DW_AT_decl_file   : 7
    <55c>   DW_AT_decl_line   : 53
    <55d>   DW_AT_decl_column : 12
    <55e>   DW_AT_type        : <0xac>
    <562>   DW_AT_data_member_location: 8
 <2><563>: Abbrev Number: 2 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0xa0ac4): PLLN
    <568>   DW_AT_decl_file   : 7
    <569>   DW_AT_decl_line   : 56
    <56a>   DW_AT_decl_column : 12
    <56b>   DW_AT_type        : <0xac>
    <56f>   DW_AT_data_member_location: 12
 <2><570>: Abbrev Number: 2 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0xa0ae1): PLLP
    <575>   DW_AT_decl_file   : 7
    <576>   DW_AT_decl_line   : 60
    <577>   DW_AT_decl_column : 12
    <578>   DW_AT_type        : <0xac>
    <57c>   DW_AT_data_member_location: 16
 <2><57d>: Abbrev Number: 2 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x489ba): PLLQ
    <582>   DW_AT_decl_file   : 7
    <583>   DW_AT_decl_line   : 63
    <584>   DW_AT_decl_column : 12
    <585>   DW_AT_type        : <0xac>
    <589>   DW_AT_data_member_location: 20
 <2><58a>: Abbrev Number: 0
 <1><58b>: Abbrev Number: 5 (DW_TAG_typedef)
    <58c>   DW_AT_name        : (indirect string, offset: 0x75a0b): RCC_PLLInitTypeDef
    <590>   DW_AT_decl_file   : 7
    <591>   DW_AT_decl_line   : 73
    <592>   DW_AT_decl_column : 3
    <593>   DW_AT_type        : <0x534>
 <1><597>: Abbrev Number: 13 (DW_TAG_structure_type)
    <598>   DW_AT_byte_size   : 48
    <599>   DW_AT_decl_file   : 8
    <59a>   DW_AT_decl_line   : 49
    <59b>   DW_AT_decl_column : 9
    <59b>   DW_AT_sibling     : <0x5fb>
 <2><59f>: Abbrev Number: 2 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x9de29): OscillatorType
    <5a4>   DW_AT_decl_file   : 8
    <5a5>   DW_AT_decl_line   : 51
    <5a6>   DW_AT_decl_column : 12
    <5a7>   DW_AT_type        : <0xac>
    <5ab>   DW_AT_data_member_location: 0
 <2><5ac>: Abbrev Number: 2 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x835c5): HSEState
    <5b1>   DW_AT_decl_file   : 8
    <5b2>   DW_AT_decl_line   : 54
    <5b3>   DW_AT_decl_column : 12
    <5b4>   DW_AT_type        : <0xac>
    <5b8>   DW_AT_data_member_location: 4
 <2><5b9>: Abbrev Number: 2 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x7a169): LSEState
    <5be>   DW_AT_decl_file   : 8
    <5bf>   DW_AT_decl_line   : 57
    <5c0>   DW_AT_decl_column : 12
    <5c1>   DW_AT_type        : <0xac>
    <5c5>   DW_AT_data_member_location: 8
 <2><5c6>: Abbrev Number: 2 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x56cf7): HSIState
    <5cb>   DW_AT_decl_file   : 8
    <5cc>   DW_AT_decl_line   : 60
    <5cd>   DW_AT_decl_column : 12
    <5ce>   DW_AT_type        : <0xac>
    <5d2>   DW_AT_data_member_location: 12
 <2><5d3>: Abbrev Number: 2 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0xa6c28): HSICalibrationValue
    <5d8>   DW_AT_decl_file   : 8
    <5d9>   DW_AT_decl_line   : 63
    <5da>   DW_AT_decl_column : 12
    <5db>   DW_AT_type        : <0xac>
    <5df>   DW_AT_data_member_location: 16
 <2><5e0>: Abbrev Number: 2 (DW_TAG_member)
    <5e1>   DW_AT_name        : (indirect string, offset: 0x447a0): LSIState
    <5e5>   DW_AT_decl_file   : 8
    <5e6>   DW_AT_decl_line   : 66
    <5e7>   DW_AT_decl_column : 12
    <5e8>   DW_AT_type        : <0xac>
    <5ec>   DW_AT_data_member_location: 20
 <2><5ed>: Abbrev Number: 19 (DW_TAG_member)
    <5ee>   DW_AT_name        : PLL
    <5f2>   DW_AT_decl_file   : 8
    <5f3>   DW_AT_decl_line   : 69
    <5f4>   DW_AT_decl_column : 22
    <5f5>   DW_AT_type        : <0x58b>
    <5f9>   DW_AT_data_member_location: 24
 <2><5fa>: Abbrev Number: 0
 <1><5fb>: Abbrev Number: 5 (DW_TAG_typedef)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x675f2): RCC_OscInitTypeDef
    <600>   DW_AT_decl_file   : 8
    <601>   DW_AT_decl_line   : 70
    <602>   DW_AT_decl_column : 3
    <603>   DW_AT_type        : <0x597>
 <1><607>: Abbrev Number: 13 (DW_TAG_structure_type)
    <608>   DW_AT_byte_size   : 20
    <609>   DW_AT_decl_file   : 8
    <60a>   DW_AT_decl_line   : 75
    <60b>   DW_AT_decl_column : 9
    <60b>   DW_AT_sibling     : <0x651>
 <2><60f>: Abbrev Number: 2 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x3bf67): ClockType
    <614>   DW_AT_decl_file   : 8
    <615>   DW_AT_decl_line   : 77
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xac>
    <61b>   DW_AT_data_member_location: 0
 <2><61c>: Abbrev Number: 2 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x754a2): SYSCLKSource
    <621>   DW_AT_decl_file   : 8
    <622>   DW_AT_decl_line   : 80
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xac>
    <628>   DW_AT_data_member_location: 4
 <2><629>: Abbrev Number: 2 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0xa0525): AHBCLKDivider
    <62e>   DW_AT_decl_file   : 8
    <62f>   DW_AT_decl_line   : 83
    <630>   DW_AT_decl_column : 12
    <631>   DW_AT_type        : <0xac>
    <635>   DW_AT_data_member_location: 8
 <2><636>: Abbrev Number: 2 (DW_TAG_member)
    <637>   DW_AT_name        : (indirect string, offset: 0x73e7): APB1CLKDivider
    <63b>   DW_AT_decl_file   : 8
    <63c>   DW_AT_decl_line   : 86
    <63d>   DW_AT_decl_column : 12
    <63e>   DW_AT_type        : <0xac>
    <642>   DW_AT_data_member_location: 12
 <2><643>: Abbrev Number: 2 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x593b0): APB2CLKDivider
    <648>   DW_AT_decl_file   : 8
    <649>   DW_AT_decl_line   : 89
    <64a>   DW_AT_decl_column : 12
    <64b>   DW_AT_type        : <0xac>
    <64f>   DW_AT_data_member_location: 16
 <2><650>: Abbrev Number: 0
 <1><651>: Abbrev Number: 5 (DW_TAG_typedef)
    <652>   DW_AT_name        : (indirect string, offset: 0x87769): RCC_ClkInitTypeDef
    <656>   DW_AT_decl_file   : 8
    <657>   DW_AT_decl_line   : 92
    <658>   DW_AT_decl_column : 3
    <659>   DW_AT_type        : <0x607>
 <1><65d>: Abbrev Number: 13 (DW_TAG_structure_type)
    <65e>   DW_AT_byte_size   : 20
    <65f>   DW_AT_decl_file   : 9
    <660>   DW_AT_decl_line   : 46
    <661>   DW_AT_decl_column : 9
    <661>   DW_AT_sibling     : <0x6a7>
 <2><665>: Abbrev Number: 19 (DW_TAG_member)
    <666>   DW_AT_name        : Pin
    <66a>   DW_AT_decl_file   : 9
    <66b>   DW_AT_decl_line   : 48
    <66c>   DW_AT_decl_column : 12
    <66d>   DW_AT_type        : <0xac>
    <671>   DW_AT_data_member_location: 0
 <2><672>: Abbrev Number: 2 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0xcedc6): Mode
    <677>   DW_AT_decl_file   : 9
    <678>   DW_AT_decl_line   : 51
    <679>   DW_AT_decl_column : 12
    <67a>   DW_AT_type        : <0xac>
    <67e>   DW_AT_data_member_location: 4
 <2><67f>: Abbrev Number: 2 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0x6402e): Pull
    <684>   DW_AT_decl_file   : 9
    <685>   DW_AT_decl_line   : 54
    <686>   DW_AT_decl_column : 12
    <687>   DW_AT_type        : <0xac>
    <68b>   DW_AT_data_member_location: 8
 <2><68c>: Abbrev Number: 2 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x7215d): Speed
    <691>   DW_AT_decl_file   : 9
    <692>   DW_AT_decl_line   : 57
    <693>   DW_AT_decl_column : 12
    <694>   DW_AT_type        : <0xac>
    <698>   DW_AT_data_member_location: 12
 <2><699>: Abbrev Number: 2 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0x59371): Alternate
    <69e>   DW_AT_decl_file   : 9
    <69f>   DW_AT_decl_line   : 60
    <6a0>   DW_AT_decl_column : 12
    <6a1>   DW_AT_type        : <0xac>
    <6a5>   DW_AT_data_member_location: 16
 <2><6a6>: Abbrev Number: 0
 <1><6a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <6a8>   DW_AT_name        : (indirect string, offset: 0x97b76): GPIO_InitTypeDef
    <6ac>   DW_AT_decl_file   : 9
    <6ad>   DW_AT_decl_line   : 62
    <6ae>   DW_AT_decl_column : 2
    <6af>   DW_AT_type        : <0x65d>
 <1><6b3>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <6b4>   DW_AT_encoding    : 7	(unsigned)
    <6b4>   DW_AT_byte_size   : 1
    <6b4>   DW_AT_type        : <0x3d>
    <6b8>   DW_AT_decl_file   : 9
    <6b9>   DW_AT_decl_line   : 68
    <6ba>   DW_AT_decl_column : 1
    <6ba>   DW_AT_sibling     : <0x6cb>
 <2><6be>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x28abe): GPIO_PIN_RESET
    <6c3>   DW_AT_const_value : 0
 <2><6c4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x317ad): GPIO_PIN_SET
    <6c9>   DW_AT_const_value : 1
 <2><6ca>: Abbrev Number: 0
 <1><6cb>: Abbrev Number: 5 (DW_TAG_typedef)
    <6cc>   DW_AT_name        : (indirect string, offset: 0xbeb00): GPIO_PinState
    <6d0>   DW_AT_decl_file   : 9
    <6d1>   DW_AT_decl_line   : 71
    <6d2>   DW_AT_decl_column : 2
    <6d3>   DW_AT_type        : <0x6b3>
 <1><6d7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6d8>   DW_AT_byte_size   : 48
    <6d9>   DW_AT_decl_file   : 10
    <6da>   DW_AT_decl_line   : 48
    <6db>   DW_AT_decl_column : 9
    <6db>   DW_AT_sibling     : <0x77c>
 <2><6df>: Abbrev Number: 2 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x65057): Channel
    <6e4>   DW_AT_decl_file   : 10
    <6e5>   DW_AT_decl_line   : 50
    <6e6>   DW_AT_decl_column : 12
    <6e7>   DW_AT_type        : <0xac>
    <6eb>   DW_AT_data_member_location: 0
 <2><6ec>: Abbrev Number: 2 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x48626): Direction
    <6f1>   DW_AT_decl_file   : 10
    <6f2>   DW_AT_decl_line   : 53
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0xac>
    <6f8>   DW_AT_data_member_location: 4
 <2><6f9>: Abbrev Number: 2 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xc8ac): PeriphInc
    <6fe>   DW_AT_decl_file   : 10
    <6ff>   DW_AT_decl_line   : 57
    <700>   DW_AT_decl_column : 12
    <701>   DW_AT_type        : <0xac>
    <705>   DW_AT_data_member_location: 8
 <2><706>: Abbrev Number: 2 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x1e750): MemInc
    <70b>   DW_AT_decl_file   : 10
    <70c>   DW_AT_decl_line   : 60
    <70d>   DW_AT_decl_column : 12
    <70e>   DW_AT_type        : <0xac>
    <712>   DW_AT_data_member_location: 12
 <2><713>: Abbrev Number: 2 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x6085b): PeriphDataAlignment
    <718>   DW_AT_decl_file   : 10
    <719>   DW_AT_decl_line   : 63
    <71a>   DW_AT_decl_column : 12
    <71b>   DW_AT_type        : <0xac>
    <71f>   DW_AT_data_member_location: 16
 <2><720>: Abbrev Number: 2 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0xaf779): MemDataAlignment
    <725>   DW_AT_decl_file   : 10
    <726>   DW_AT_decl_line   : 66
    <727>   DW_AT_decl_column : 12
    <728>   DW_AT_type        : <0xac>
    <72c>   DW_AT_data_member_location: 20
 <2><72d>: Abbrev Number: 2 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0xcedc6): Mode
    <732>   DW_AT_decl_file   : 10
    <733>   DW_AT_decl_line   : 69
    <734>   DW_AT_decl_column : 12
    <735>   DW_AT_type        : <0xac>
    <739>   DW_AT_data_member_location: 24
 <2><73a>: Abbrev Number: 2 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0xce2ea): Priority
    <73f>   DW_AT_decl_file   : 10
    <740>   DW_AT_decl_line   : 74
    <741>   DW_AT_decl_column : 12
    <742>   DW_AT_type        : <0xac>
    <746>   DW_AT_data_member_location: 28
 <2><747>: Abbrev Number: 2 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x53ef8): FIFOMode
    <74c>   DW_AT_decl_file   : 10
    <74d>   DW_AT_decl_line   : 77
    <74e>   DW_AT_decl_column : 12
    <74f>   DW_AT_type        : <0xac>
    <753>   DW_AT_data_member_location: 32
 <2><754>: Abbrev Number: 2 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0x936ec): FIFOThreshold
    <759>   DW_AT_decl_file   : 10
    <75a>   DW_AT_decl_line   : 82
    <75b>   DW_AT_decl_column : 12
    <75c>   DW_AT_type        : <0xac>
    <760>   DW_AT_data_member_location: 36
 <2><761>: Abbrev Number: 2 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x91a23): MemBurst
    <766>   DW_AT_decl_file   : 10
    <767>   DW_AT_decl_line   : 85
    <768>   DW_AT_decl_column : 12
    <769>   DW_AT_type        : <0xac>
    <76d>   DW_AT_data_member_location: 40
 <2><76e>: Abbrev Number: 2 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x42e7b): PeriphBurst
    <773>   DW_AT_decl_file   : 10
    <774>   DW_AT_decl_line   : 91
    <775>   DW_AT_decl_column : 12
    <776>   DW_AT_type        : <0xac>
    <77a>   DW_AT_data_member_location: 44
 <2><77b>: Abbrev Number: 0
 <1><77c>: Abbrev Number: 5 (DW_TAG_typedef)
    <77d>   DW_AT_name        : (indirect string, offset: 0x34b25): DMA_InitTypeDef
    <781>   DW_AT_decl_file   : 10
    <782>   DW_AT_decl_line   : 96
    <783>   DW_AT_decl_column : 2
    <784>   DW_AT_type        : <0x6d7>
 <1><788>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <789>   DW_AT_encoding    : 7	(unsigned)
    <789>   DW_AT_byte_size   : 1
    <789>   DW_AT_type        : <0x3d>
    <78d>   DW_AT_decl_file   : 10
    <78e>   DW_AT_decl_line   : 103
    <78f>   DW_AT_decl_column : 1
    <78f>   DW_AT_sibling     : <0x7b8>
 <2><793>: Abbrev Number: 3 (DW_TAG_enumerator)
    <794>   DW_AT_name        : (indirect string, offset: 0xc3bc): HAL_DMA_STATE_RESET
    <798>   DW_AT_const_value : 0
 <2><799>: Abbrev Number: 3 (DW_TAG_enumerator)
    <79a>   DW_AT_name        : (indirect string, offset: 0x35edb): HAL_DMA_STATE_READY
    <79e>   DW_AT_const_value : 1
 <2><79f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x85ed4): HAL_DMA_STATE_BUSY
    <7a4>   DW_AT_const_value : 2
 <2><7a5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a6>   DW_AT_name        : (indirect string, offset: 0xbeeaa): HAL_DMA_STATE_TIMEOUT
    <7aa>   DW_AT_const_value : 3
 <2><7ab>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x93185): HAL_DMA_STATE_ERROR
    <7b0>   DW_AT_const_value : 4
 <2><7b1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x4c488): HAL_DMA_STATE_ABORT
    <7b6>   DW_AT_const_value : 5
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 5 (DW_TAG_typedef)
    <7b9>   DW_AT_name        : (indirect string, offset: 0xaeacc): HAL_DMA_StateTypeDef
    <7bd>   DW_AT_decl_file   : 10
    <7be>   DW_AT_decl_line   : 110
    <7bf>   DW_AT_decl_column : 2
    <7c0>   DW_AT_type        : <0x788>
 <1><7c4>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <7c5>   DW_AT_type        : <0x7b8>
 <1><7c9>: Abbrev Number: 26 (DW_TAG_structure_type)
    <7ca>   DW_AT_name        : (indirect string, offset: 0xa5038): __DMA_HandleTypeDef
    <7ce>   DW_AT_byte_size   : 96
    <7cf>   DW_AT_decl_file   : 10
    <7d0>   DW_AT_decl_line   : 138
    <7d1>   DW_AT_decl_column : 16
    <7d2>   DW_AT_sibling     : <0x88d>
 <2><7d6>: Abbrev Number: 2 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xbbb2a): Instance
    <7db>   DW_AT_decl_file   : 10
    <7dc>   DW_AT_decl_line   : 140
    <7dd>   DW_AT_decl_column : 31
    <7de>   DW_AT_type        : <0x88d>
    <7e2>   DW_AT_data_member_location: 0
 <2><7e3>: Abbrev Number: 2 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xcea18): Init
    <7e8>   DW_AT_decl_file   : 10
    <7e9>   DW_AT_decl_line   : 142
    <7ea>   DW_AT_decl_column : 30
    <7eb>   DW_AT_type        : <0x77c>
    <7ef>   DW_AT_data_member_location: 4
 <2><7f0>: Abbrev Number: 2 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x89fd0): Lock
    <7f5>   DW_AT_decl_file   : 10
    <7f6>   DW_AT_decl_line   : 144
    <7f7>   DW_AT_decl_column : 30
    <7f8>   DW_AT_type        : <0x528>
    <7fc>   DW_AT_data_member_location: 52
 <2><7fd>: Abbrev Number: 2 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x835c8): State
    <802>   DW_AT_decl_file   : 10
    <803>   DW_AT_decl_line   : 146
    <804>   DW_AT_decl_column : 30
    <805>   DW_AT_type        : <0x7c4>
    <809>   DW_AT_data_member_location: 53
 <2><80a>: Abbrev Number: 2 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0xb8a25): Parent
    <80f>   DW_AT_decl_file   : 10
    <810>   DW_AT_decl_line   : 148
    <811>   DW_AT_decl_column : 31
    <812>   DW_AT_type        : <0x892>
    <816>   DW_AT_data_member_location: 56
 <2><817>: Abbrev Number: 2 (DW_TAG_member)
    <818>   DW_AT_name        : (indirect string, offset: 0xc12ad): XferCpltCallback
    <81c>   DW_AT_decl_file   : 10
    <81d>   DW_AT_decl_line   : 150
    <81e>   DW_AT_decl_column : 33
    <81f>   DW_AT_type        : <0x8a4>
    <823>   DW_AT_data_member_location: 60
 <2><824>: Abbrev Number: 2 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0x96c3a): XferHalfCpltCallback
    <829>   DW_AT_decl_file   : 10
    <82a>   DW_AT_decl_line   : 152
    <82b>   DW_AT_decl_column : 33
    <82c>   DW_AT_type        : <0x8a4>
    <830>   DW_AT_data_member_location: 64
 <2><831>: Abbrev Number: 2 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x7238d): XferM1CpltCallback
    <836>   DW_AT_decl_file   : 10
    <837>   DW_AT_decl_line   : 154
    <838>   DW_AT_decl_column : 33
    <839>   DW_AT_type        : <0x8a4>
    <83d>   DW_AT_data_member_location: 68
 <2><83e>: Abbrev Number: 2 (DW_TAG_member)
    <83f>   DW_AT_name        : (indirect string, offset: 0x5d8fd): XferM1HalfCpltCallback
    <843>   DW_AT_decl_file   : 10
    <844>   DW_AT_decl_line   : 156
    <845>   DW_AT_decl_column : 33
    <846>   DW_AT_type        : <0x8a4>
    <84a>   DW_AT_data_member_location: 72
 <2><84b>: Abbrev Number: 2 (DW_TAG_member)
    <84c>   DW_AT_name        : (indirect string, offset: 0x1c070): XferErrorCallback
    <850>   DW_AT_decl_file   : 10
    <851>   DW_AT_decl_line   : 158
    <852>   DW_AT_decl_column : 33
    <853>   DW_AT_type        : <0x8a4>
    <857>   DW_AT_data_member_location: 76
 <2><858>: Abbrev Number: 2 (DW_TAG_member)
    <859>   DW_AT_name        : (indirect string, offset: 0xb5238): XferAbortCallback
    <85d>   DW_AT_decl_file   : 10
    <85e>   DW_AT_decl_line   : 160
    <85f>   DW_AT_decl_column : 33
    <860>   DW_AT_type        : <0x8a4>
    <864>   DW_AT_data_member_location: 80
 <2><865>: Abbrev Number: 2 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0xbdc27): ErrorCode
    <86a>   DW_AT_decl_file   : 10
    <86b>   DW_AT_decl_line   : 162
    <86c>   DW_AT_decl_column : 30
    <86d>   DW_AT_type        : <0xb8>
    <871>   DW_AT_data_member_location: 84
 <2><872>: Abbrev Number: 2 (DW_TAG_member)
    <873>   DW_AT_name        : (indirect string, offset: 0x570bc): StreamBaseAddress
    <877>   DW_AT_decl_file   : 10
    <878>   DW_AT_decl_line   : 164
    <879>   DW_AT_decl_column : 30
    <87a>   DW_AT_type        : <0xac>
    <87e>   DW_AT_data_member_location: 88
 <2><87f>: Abbrev Number: 2 (DW_TAG_member)
    <880>   DW_AT_name        : (indirect string, offset: 0xa31ae): StreamIndex
    <884>   DW_AT_decl_file   : 10
    <885>   DW_AT_decl_line   : 166
    <886>   DW_AT_decl_column : 30
    <887>   DW_AT_type        : <0xac>
    <88b>   DW_AT_data_member_location: 92
 <2><88c>: Abbrev Number: 0
 <1><88d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <88e>   DW_AT_byte_size   : 4
    <88e>   DW_AT_type        : <0x124>
 <1><892>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <893>   DW_AT_byte_size   : 4
 <1><894>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <895>   DW_AT_prototyped  : 1
    <895>   DW_AT_sibling     : <0x89f>
 <2><899>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <89a>   DW_AT_type        : <0x89f>
 <2><89e>: Abbrev Number: 0
 <1><89f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <8a0>   DW_AT_byte_size   : 4
    <8a0>   DW_AT_type        : <0x7c9>
 <1><8a4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <8a5>   DW_AT_byte_size   : 4
    <8a5>   DW_AT_type        : <0x894>
 <1><8a9>: Abbrev Number: 5 (DW_TAG_typedef)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xa503a): DMA_HandleTypeDef
    <8ae>   DW_AT_decl_file   : 10
    <8af>   DW_AT_decl_line   : 168
    <8b0>   DW_AT_decl_column : 2
    <8b1>   DW_AT_type        : <0x7c9>
 <1><8b5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8b6>   DW_AT_byte_size   : 24
    <8b7>   DW_AT_decl_file   : 11
    <8b8>   DW_AT_decl_line   : 46
    <8b9>   DW_AT_decl_column : 9
    <8b9>   DW_AT_sibling     : <0x90c>
 <2><8bd>: Abbrev Number: 2 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0xc2e96): Prescaler
    <8c2>   DW_AT_decl_file   : 11
    <8c3>   DW_AT_decl_line   : 48
    <8c4>   DW_AT_decl_column : 12
    <8c5>   DW_AT_type        : <0xac>
    <8c9>   DW_AT_data_member_location: 0
 <2><8ca>: Abbrev Number: 2 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xb03c6): CounterMode
    <8cf>   DW_AT_decl_file   : 11
    <8d0>   DW_AT_decl_line   : 51
    <8d1>   DW_AT_decl_column : 12
    <8d2>   DW_AT_type        : <0xac>
    <8d6>   DW_AT_data_member_location: 4
 <2><8d7>: Abbrev Number: 2 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xd3257): Period
    <8dc>   DW_AT_decl_file   : 11
    <8dd>   DW_AT_decl_line   : 54
    <8de>   DW_AT_decl_column : 12
    <8df>   DW_AT_type        : <0xac>
    <8e3>   DW_AT_data_member_location: 8
 <2><8e4>: Abbrev Number: 2 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x4f3e8): ClockDivision
    <8e9>   DW_AT_decl_file   : 11
    <8ea>   DW_AT_decl_line   : 58
    <8eb>   DW_AT_decl_column : 12
    <8ec>   DW_AT_type        : <0xac>
    <8f0>   DW_AT_data_member_location: 12
 <2><8f1>: Abbrev Number: 2 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x875f2): RepetitionCounter
    <8f6>   DW_AT_decl_file   : 11
    <8f7>   DW_AT_decl_line   : 61
    <8f8>   DW_AT_decl_column : 12
    <8f9>   DW_AT_type        : <0xac>
    <8fd>   DW_AT_data_member_location: 16
 <2><8fe>: Abbrev Number: 2 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0xb2f6c): AutoReloadPreload
    <903>   DW_AT_decl_file   : 11
    <904>   DW_AT_decl_line   : 72
    <905>   DW_AT_decl_column : 12
    <906>   DW_AT_type        : <0xac>
    <90a>   DW_AT_data_member_location: 20
 <2><90b>: Abbrev Number: 0
 <1><90c>: Abbrev Number: 5 (DW_TAG_typedef)
    <90d>   DW_AT_name        : (indirect string, offset: 0x4376d): TIM_Base_InitTypeDef
    <911>   DW_AT_decl_file   : 11
    <912>   DW_AT_decl_line   : 74
    <913>   DW_AT_decl_column : 3
    <914>   DW_AT_type        : <0x8b5>
 <1><918>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <919>   DW_AT_encoding    : 7	(unsigned)
    <919>   DW_AT_byte_size   : 1
    <919>   DW_AT_type        : <0x3d>
    <91d>   DW_AT_decl_file   : 11
    <91d>   DW_AT_decl_line   : 291
    <91f>   DW_AT_decl_column : 1
    <91f>   DW_AT_sibling     : <0x942>
 <2><923>: Abbrev Number: 3 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x79dc9): HAL_TIM_STATE_RESET
    <928>   DW_AT_const_value : 0
 <2><929>: Abbrev Number: 3 (DW_TAG_enumerator)
    <92a>   DW_AT_name        : (indirect string, offset: 0x6a7a): HAL_TIM_STATE_READY
    <92e>   DW_AT_const_value : 1
 <2><92f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <930>   DW_AT_name        : (indirect string, offset: 0x31747): HAL_TIM_STATE_BUSY
    <934>   DW_AT_const_value : 2
 <2><935>: Abbrev Number: 3 (DW_TAG_enumerator)
    <936>   DW_AT_name        : (indirect string, offset: 0xa22a1): HAL_TIM_STATE_TIMEOUT
    <93a>   DW_AT_const_value : 3
 <2><93b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <93c>   DW_AT_name        : (indirect string, offset: 0x78034): HAL_TIM_STATE_ERROR
    <940>   DW_AT_const_value : 4
 <2><941>: Abbrev Number: 0
 <1><942>: Abbrev Number: 8 (DW_TAG_typedef)
    <943>   DW_AT_name        : (indirect string, offset: 0x7f5bd): HAL_TIM_StateTypeDef
    <947>   DW_AT_decl_file   : 11
    <948>   DW_AT_decl_line   : 297
    <94a>   DW_AT_decl_column : 3
    <94a>   DW_AT_type        : <0x918>
 <1><94e>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <94f>   DW_AT_type        : <0x942>
 <1><953>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <954>   DW_AT_encoding    : 7	(unsigned)
    <954>   DW_AT_byte_size   : 1
    <954>   DW_AT_type        : <0x3d>
    <958>   DW_AT_decl_file   : 11
    <958>   DW_AT_decl_line   : 303
    <95a>   DW_AT_decl_column : 1
    <95a>   DW_AT_sibling     : <0x971>
 <2><95e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <95f>   DW_AT_name        : (indirect string, offset: 0x88914): HAL_TIM_CHANNEL_STATE_RESET
    <963>   DW_AT_const_value : 0
 <2><964>: Abbrev Number: 3 (DW_TAG_enumerator)
    <965>   DW_AT_name        : (indirect string, offset: 0x72676): HAL_TIM_CHANNEL_STATE_READY
    <969>   DW_AT_const_value : 1
 <2><96a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <96b>   DW_AT_name        : (indirect string, offset: 0x5daaa): HAL_TIM_CHANNEL_STATE_BUSY
    <96f>   DW_AT_const_value : 2
 <2><970>: Abbrev Number: 0
 <1><971>: Abbrev Number: 8 (DW_TAG_typedef)
    <972>   DW_AT_name        : (indirect string, offset: 0x2945c): HAL_TIM_ChannelStateTypeDef
    <976>   DW_AT_decl_file   : 11
    <977>   DW_AT_decl_line   : 307
    <979>   DW_AT_decl_column : 3
    <979>   DW_AT_type        : <0x953>
 <1><97d>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <97e>   DW_AT_type        : <0x971>
 <1><982>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <983>   DW_AT_encoding    : 7	(unsigned)
    <983>   DW_AT_byte_size   : 1
    <983>   DW_AT_type        : <0x3d>
    <987>   DW_AT_decl_file   : 11
    <987>   DW_AT_decl_line   : 313
    <989>   DW_AT_decl_column : 1
    <989>   DW_AT_sibling     : <0x9a0>
 <2><98d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <98e>   DW_AT_name        : (indirect string, offset: 0x3d12): HAL_DMA_BURST_STATE_RESET
    <992>   DW_AT_const_value : 0
 <2><993>: Abbrev Number: 3 (DW_TAG_enumerator)
    <994>   DW_AT_name        : (indirect string, offset: 0x6b3f0): HAL_DMA_BURST_STATE_READY
    <998>   DW_AT_const_value : 1
 <2><999>: Abbrev Number: 3 (DW_TAG_enumerator)
    <99a>   DW_AT_name        : (indirect string, offset: 0x41f7e): HAL_DMA_BURST_STATE_BUSY
    <99e>   DW_AT_const_value : 2
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 8 (DW_TAG_typedef)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x1a6ba): HAL_TIM_DMABurstStateTypeDef
    <9a5>   DW_AT_decl_file   : 11
    <9a6>   DW_AT_decl_line   : 317
    <9a8>   DW_AT_decl_column : 3
    <9a8>   DW_AT_type        : <0x982>
 <1><9ac>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <9ad>   DW_AT_type        : <0x9a0>
 <1><9b1>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <9b2>   DW_AT_encoding    : 7	(unsigned)
    <9b2>   DW_AT_byte_size   : 1
    <9b2>   DW_AT_type        : <0x3d>
    <9b6>   DW_AT_decl_file   : 11
    <9b6>   DW_AT_decl_line   : 323
    <9b8>   DW_AT_decl_column : 1
    <9b8>   DW_AT_sibling     : <0x9db>
 <2><9bc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x6d499): HAL_TIM_ACTIVE_CHANNEL_1
    <9c1>   DW_AT_const_value : 1
 <2><9c2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x6d4b2): HAL_TIM_ACTIVE_CHANNEL_2
    <9c7>   DW_AT_const_value : 2
 <2><9c8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x6d4cb): HAL_TIM_ACTIVE_CHANNEL_3
    <9cd>   DW_AT_const_value : 4
 <2><9ce>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x6d4e4): HAL_TIM_ACTIVE_CHANNEL_4
    <9d3>   DW_AT_const_value : 8
 <2><9d4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x50536): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <9d9>   DW_AT_const_value : 0
 <2><9da>: Abbrev Number: 0
 <1><9db>: Abbrev Number: 8 (DW_TAG_typedef)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x65049): HAL_TIM_ActiveChannel
    <9e0>   DW_AT_decl_file   : 11
    <9e1>   DW_AT_decl_line   : 329
    <9e3>   DW_AT_decl_column : 3
    <9e3>   DW_AT_type        : <0x9b1>
 <1><9e7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <9e8>   DW_AT_byte_size   : 72
    <9e9>   DW_AT_decl_file   : 11
    <9ea>   DW_AT_decl_line   : 337
    <9ec>   DW_AT_decl_column : 9
    <9ec>   DW_AT_sibling     : <0xa6f>
 <2><9f0>: Abbrev Number: 1 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xbbb2a): Instance
    <9f5>   DW_AT_decl_file   : 11
    <9f6>   DW_AT_decl_line   : 340
    <9f8>   DW_AT_decl_column : 39
    <9f9>   DW_AT_type        : <0xa6f>
    <9fd>   DW_AT_data_member_location: 0
 <2><9fe>: Abbrev Number: 1 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0xcea18): Init
    <a03>   DW_AT_decl_file   : 11
    <a04>   DW_AT_decl_line   : 341
    <a06>   DW_AT_decl_column : 38
    <a07>   DW_AT_type        : <0x90c>
    <a0b>   DW_AT_data_member_location: 4
 <2><a0c>: Abbrev Number: 1 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x65057): Channel
    <a11>   DW_AT_decl_file   : 11
    <a12>   DW_AT_decl_line   : 342
    <a14>   DW_AT_decl_column : 38
    <a15>   DW_AT_type        : <0x9db>
    <a19>   DW_AT_data_member_location: 28
 <2><a1a>: Abbrev Number: 1 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x74b67): hdma
    <a1f>   DW_AT_decl_file   : 11
    <a20>   DW_AT_decl_line   : 343
    <a22>   DW_AT_decl_column : 39
    <a23>   DW_AT_type        : <0xa74>
    <a27>   DW_AT_data_member_location: 32
 <2><a28>: Abbrev Number: 1 (DW_TAG_member)
    <a29>   DW_AT_name        : (indirect string, offset: 0x89fd0): Lock
    <a2d>   DW_AT_decl_file   : 11
    <a2e>   DW_AT_decl_line   : 345
    <a30>   DW_AT_decl_column : 38
    <a31>   DW_AT_type        : <0x528>
    <a35>   DW_AT_data_member_location: 60
 <2><a36>: Abbrev Number: 1 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0x835c8): State
    <a3b>   DW_AT_decl_file   : 11
    <a3c>   DW_AT_decl_line   : 346
    <a3e>   DW_AT_decl_column : 38
    <a3f>   DW_AT_type        : <0x94e>
    <a43>   DW_AT_data_member_location: 61
 <2><a44>: Abbrev Number: 1 (DW_TAG_member)
    <a45>   DW_AT_name        : (indirect string, offset: 0xcf4a1): ChannelState
    <a49>   DW_AT_decl_file   : 11
    <a4a>   DW_AT_decl_line   : 347
    <a4c>   DW_AT_decl_column : 38
    <a4d>   DW_AT_type        : <0xa99>
    <a51>   DW_AT_data_member_location: 62
 <2><a52>: Abbrev Number: 1 (DW_TAG_member)
    <a53>   DW_AT_name        : (indirect string, offset: 0xcfad2): ChannelNState
    <a57>   DW_AT_decl_file   : 11
    <a58>   DW_AT_decl_line   : 348
    <a5a>   DW_AT_decl_column : 38
    <a5b>   DW_AT_type        : <0xa99>
    <a5f>   DW_AT_data_member_location: 66
 <2><a60>: Abbrev Number: 1 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0xcf03c): DMABurstState
    <a65>   DW_AT_decl_file   : 11
    <a66>   DW_AT_decl_line   : 349
    <a68>   DW_AT_decl_column : 38
    <a69>   DW_AT_type        : <0x9ac>
    <a6d>   DW_AT_data_member_location: 70
 <2><a6e>: Abbrev Number: 0
 <1><a6f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a70>   DW_AT_byte_size   : 4
    <a70>   DW_AT_type        : <0x4cd>
 <1><a74>: Abbrev Number: 15 (DW_TAG_array_type)
    <a75>   DW_AT_type        : <0xa84>
    <a79>   DW_AT_sibling     : <0xa84>
 <2><a7d>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a7e>   DW_AT_type        : <0x8d>
    <a82>   DW_AT_upper_bound : 6
 <2><a83>: Abbrev Number: 0
 <1><a84>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a85>   DW_AT_byte_size   : 4
    <a85>   DW_AT_type        : <0x8a9>
 <1><a89>: Abbrev Number: 15 (DW_TAG_array_type)
    <a8a>   DW_AT_type        : <0x97d>
    <a8e>   DW_AT_sibling     : <0xa99>
 <2><a92>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <a93>   DW_AT_type        : <0x8d>
    <a97>   DW_AT_upper_bound : 3
 <2><a98>: Abbrev Number: 0
 <1><a99>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <a9a>   DW_AT_type        : <0xa89>
 <1><a9e>: Abbrev Number: 8 (DW_TAG_typedef)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x431c5): TIM_HandleTypeDef
    <aa3>   DW_AT_decl_file   : 11
    <aa4>   DW_AT_decl_line   : 380
    <aa6>   DW_AT_decl_column : 3
    <aa6>   DW_AT_type        : <0x9e7>
 <1><aaa>: Abbrev Number: 20 (DW_TAG_subprogram)
    <aab>   DW_AT_external    : 1
    <aab>   DW_AT_name        : (indirect string, offset: 0x42694): HAL_IncTick
    <aaf>   DW_AT_decl_file   : 12
    <ab0>   DW_AT_decl_line   : 232
    <ab1>   DW_AT_decl_column : 6
    <ab2>   DW_AT_prototyped  : 1
    <ab2>   DW_AT_declaration : 1
 <1><ab2>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ab3>   DW_AT_external    : 1
    <ab3>   DW_AT_name        : (indirect string, offset: 0x7791f): HAL_GPIO_Init
    <ab7>   DW_AT_decl_file   : 9
    <ab7>   DW_AT_decl_line   : 224
    <ab8>   DW_AT_decl_column : 7
    <ab9>   DW_AT_prototyped  : 1
    <ab9>   DW_AT_declaration : 1
    <ab9>   DW_AT_sibling     : <0xac8>
 <2><abd>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <abe>   DW_AT_type        : <0xac8>
 <2><ac2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ac3>   DW_AT_type        : <0xacd>
 <2><ac7>: Abbrev Number: 0
 <1><ac8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ac9>   DW_AT_byte_size   : 4
    <ac9>   DW_AT_type        : <0x1c7>
 <1><acd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ace>   DW_AT_byte_size   : 4
    <ace>   DW_AT_type        : <0x6a7>
 <1><ad2>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ad3>   DW_AT_external    : 1
    <ad3>   DW_AT_name        : (indirect string, offset: 0x22ca3): HAL_GPIO_WritePin
    <ad7>   DW_AT_decl_file   : 9
    <ad7>   DW_AT_decl_line   : 235
    <ad8>   DW_AT_decl_column : 6
    <ad9>   DW_AT_prototyped  : 1
    <ad9>   DW_AT_declaration : 1
    <ad9>   DW_AT_sibling     : <0xaed>
 <2><add>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ade>   DW_AT_type        : <0xac8>
 <2><ae2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ae3>   DW_AT_type        : <0xa0>
 <2><ae7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ae8>   DW_AT_type        : <0x6cb>
 <2><aec>: Abbrev Number: 0
 <1><aed>: Abbrev Number: 22 (DW_TAG_subprogram)
    <aee>   DW_AT_external    : 1
    <aee>   DW_AT_name        : (indirect string, offset: 0xa62a6): HAL_RCC_ClockConfig
    <af2>   DW_AT_decl_file   : 8
    <af2>   DW_AT_decl_line   : 1246
    <af4>   DW_AT_decl_column : 19
    <af4>   DW_AT_prototyped  : 1
    <af4>   DW_AT_type        : <0x504>
    <af8>   DW_AT_declaration : 1
    <af8>   DW_AT_sibling     : <0xb07>
 <2><afc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <afd>   DW_AT_type        : <0xb07>
 <2><b01>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b02>   DW_AT_type        : <0xac>
 <2><b06>: Abbrev Number: 0
 <1><b07>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b08>   DW_AT_byte_size   : 4
    <b08>   DW_AT_type        : <0x651>
 <1><b0c>: Abbrev Number: 22 (DW_TAG_subprogram)
    <b0d>   DW_AT_external    : 1
    <b0d>   DW_AT_name        : (indirect string, offset: 0x85a1f): HAL_RCC_OscConfig
    <b11>   DW_AT_decl_file   : 8
    <b11>   DW_AT_decl_line   : 1245
    <b13>   DW_AT_decl_column : 19
    <b13>   DW_AT_prototyped  : 1
    <b13>   DW_AT_type        : <0x504>
    <b17>   DW_AT_declaration : 1
    <b17>   DW_AT_sibling     : <0xb21>
 <2><b1b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b1c>   DW_AT_type        : <0xb21>
 <2><b20>: Abbrev Number: 0
 <1><b21>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b22>   DW_AT_byte_size   : 4
    <b22>   DW_AT_type        : <0x5fb>
 <1><b26>: Abbrev Number: 20 (DW_TAG_subprogram)
    <b27>   DW_AT_external    : 1
    <b27>   DW_AT_name        : (indirect string, offset: 0x6b0f): led_blinker_app_init
    <b2b>   DW_AT_decl_file   : 1
    <b2c>   DW_AT_decl_line   : 57
    <b2d>   DW_AT_decl_column : 13
    <b2e>   DW_AT_prototyped  : 1
    <b2e>   DW_AT_declaration : 1
 <1><b2e>: Abbrev Number: 29 (DW_TAG_subprogram)
    <b2f>   DW_AT_external    : 1
    <b2f>   DW_AT_name        : (indirect string, offset: 0xb5ecc): HAL_Init
    <b33>   DW_AT_decl_file   : 12
    <b34>   DW_AT_decl_line   : 219
    <b35>   DW_AT_decl_column : 19
    <b36>   DW_AT_prototyped  : 1
    <b36>   DW_AT_type        : <0x504>
    <b3a>   DW_AT_declaration : 1
 <1><b3a>: Abbrev Number: 30 (DW_TAG_subprogram)
    <b3b>   DW_AT_external    : 1
    <b3b>   DW_AT_name        : (indirect string, offset: 0x56325): Error_Handler
    <b3f>   DW_AT_decl_file   : 1
    <b40>   DW_AT_decl_line   : 321
    <b42>   DW_AT_decl_column : 6
    <b43>   DW_AT_prototyped  : 1
    <b43>   DW_AT_low_pc      : 0x800088c
    <b47>   DW_AT_high_pc     : 0xc
    <b4b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b4d>   DW_AT_call_all_calls: 1
    <b4d>   DW_AT_sibling     : <0xb63>
 <2><b51>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <b52>   DW_AT_abstract_origin: <0xcd9>
    <b56>   DW_AT_low_pc      : 0x8000890
    <b5a>   DW_AT_high_pc     : 0x4
    <b5e>   DW_AT_call_file   : 1
    <b5f>   DW_AT_call_line   : 325
    <b61>   DW_AT_call_column : 3
 <2><b62>: Abbrev Number: 0
 <1><b63>: Abbrev Number: 32 (DW_TAG_subprogram)
    <b64>   DW_AT_external    : 1
    <b64>   DW_AT_name        : (indirect string, offset: 0xa28c6): HAL_TIM_PeriodElapsedCallback
    <b68>   DW_AT_decl_file   : 1
    <b69>   DW_AT_decl_line   : 304
    <b6b>   DW_AT_decl_column : 6
    <b6c>   DW_AT_prototyped  : 1
    <b6c>   DW_AT_low_pc      : 0x8000868
    <b70>   DW_AT_high_pc     : 0x24
    <b74>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b76>   DW_AT_call_all_tail_calls: 1
    <b76>   DW_AT_sibling     : <0xb8b>
 <2><b7a>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x98665): htim
    <b7f>   DW_AT_decl_file   : 1
    <b80>   DW_AT_decl_line   : 304
    <b82>   DW_AT_decl_column : 55
    <b83>   DW_AT_type        : <0xb8b>
    <b87>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b8a>: Abbrev Number: 0
 <1><b8b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b8c>   DW_AT_byte_size   : 4
    <b8c>   DW_AT_type        : <0xa9e>
 <1><b90>: Abbrev Number: 34 (DW_TAG_subprogram)
    <b91>   DW_AT_name        : (indirect string, offset: 0x4f98a): MX_GPIO_Init
    <b95>   DW_AT_decl_file   : 1
    <b96>   DW_AT_decl_line   : 155
    <b97>   DW_AT_decl_column : 13
    <b98>   DW_AT_prototyped  : 1
    <b98>   DW_AT_low_pc      : 0x80005ac
    <b9c>   DW_AT_high_pc     : 0x2bc
    <ba0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ba2>   DW_AT_call_all_tail_calls: 1
    <ba2>   DW_AT_sibling     : <0xc59>
 <2><ba6>: Abbrev Number: 6 (DW_TAG_variable)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x122af): GPIO_InitStruct
    <bab>   DW_AT_decl_file   : 1
    <bab>   DW_AT_decl_line   : 157
    <bac>   DW_AT_decl_column : 20
    <bad>   DW_AT_type        : <0x6a7>
    <bb1>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><bb4>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <bb5>   DW_AT_low_pc      : 0x80005c2
    <bb9>   DW_AT_high_pc     : 0x1c
    <bbd>   DW_AT_sibling     : <0xbd0>
 <3><bc1>: Abbrev Number: 6 (DW_TAG_variable)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <bc6>   DW_AT_decl_file   : 1
    <bc6>   DW_AT_decl_line   : 162
    <bc7>   DW_AT_decl_column : 3
    <bc8>   DW_AT_type        : <0xb8>
    <bcc>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><bcf>: Abbrev Number: 0
 <2><bd0>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <bd1>   DW_AT_low_pc      : 0x80005de
    <bd5>   DW_AT_high_pc     : 0x1c
    <bd9>   DW_AT_sibling     : <0xbec>
 <3><bdd>: Abbrev Number: 6 (DW_TAG_variable)
    <bde>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <be2>   DW_AT_decl_file   : 1
    <be2>   DW_AT_decl_line   : 163
    <be3>   DW_AT_decl_column : 3
    <be4>   DW_AT_type        : <0xb8>
    <be8>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><beb>: Abbrev Number: 0
 <2><bec>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <bed>   DW_AT_low_pc      : 0x80005fa
    <bf1>   DW_AT_high_pc     : 0x1c
    <bf5>   DW_AT_sibling     : <0xc08>
 <3><bf9>: Abbrev Number: 6 (DW_TAG_variable)
    <bfa>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <bfe>   DW_AT_decl_file   : 1
    <bfe>   DW_AT_decl_line   : 164
    <bff>   DW_AT_decl_column : 3
    <c00>   DW_AT_type        : <0xb8>
    <c04>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><c07>: Abbrev Number: 0
 <2><c08>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <c09>   DW_AT_low_pc      : 0x8000616
    <c0d>   DW_AT_high_pc     : 0x1c
    <c11>   DW_AT_sibling     : <0xc24>
 <3><c15>: Abbrev Number: 6 (DW_TAG_variable)
    <c16>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c1a>   DW_AT_decl_file   : 1
    <c1a>   DW_AT_decl_line   : 165
    <c1b>   DW_AT_decl_column : 3
    <c1c>   DW_AT_type        : <0xb8>
    <c20>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><c23>: Abbrev Number: 0
 <2><c24>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <c25>   DW_AT_low_pc      : 0x8000632
    <c29>   DW_AT_high_pc     : 0x1c
    <c2d>   DW_AT_sibling     : <0xc40>
 <3><c31>: Abbrev Number: 6 (DW_TAG_variable)
    <c32>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c36>   DW_AT_decl_file   : 1
    <c36>   DW_AT_decl_line   : 166
    <c37>   DW_AT_decl_column : 3
    <c38>   DW_AT_type        : <0xb8>
    <c3c>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><c3f>: Abbrev Number: 0
 <2><c40>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <c41>   DW_AT_low_pc      : 0x800064e
    <c45>   DW_AT_high_pc     : 0x1c
 <3><c49>: Abbrev Number: 6 (DW_TAG_variable)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c4e>   DW_AT_decl_file   : 1
    <c4e>   DW_AT_decl_line   : 167
    <c4f>   DW_AT_decl_column : 3
    <c50>   DW_AT_type        : <0xb8>
    <c54>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><c57>: Abbrev Number: 0
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 35 (DW_TAG_subprogram)
    <c5a>   DW_AT_external    : 1
    <c5a>   DW_AT_name        : (indirect string, offset: 0x85dec): SystemClock_Config
    <c5e>   DW_AT_decl_file   : 1
    <c5f>   DW_AT_decl_line   : 108
    <c60>   DW_AT_decl_column : 6
    <c61>   DW_AT_prototyped  : 1
    <c61>   DW_AT_low_pc      : 0x80004d8
    <c65>   DW_AT_high_pc     : 0xd4
    <c69>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c6b>   DW_AT_call_all_tail_calls: 1
    <c6b>   DW_AT_sibling     : <0xcc3>
 <2><c6f>: Abbrev Number: 6 (DW_TAG_variable)
    <c70>   DW_AT_name        : (indirect string, offset: 0x2aed4): RCC_OscInitStruct
    <c74>   DW_AT_decl_file   : 1
    <c74>   DW_AT_decl_line   : 110
    <c75>   DW_AT_decl_column : 22
    <c76>   DW_AT_type        : <0x5fb>
    <c7a>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><c7d>: Abbrev Number: 6 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x49b06): RCC_ClkInitStruct
    <c82>   DW_AT_decl_file   : 1
    <c82>   DW_AT_decl_line   : 111
    <c83>   DW_AT_decl_column : 22
    <c84>   DW_AT_type        : <0x651>
    <c88>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><c8c>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <c8d>   DW_AT_low_pc      : 0x80004fc
    <c91>   DW_AT_high_pc     : 0x1c
    <c95>   DW_AT_sibling     : <0xca9>
 <3><c99>: Abbrev Number: 6 (DW_TAG_variable)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <c9e>   DW_AT_decl_file   : 1
    <c9e>   DW_AT_decl_line   : 115
    <c9f>   DW_AT_decl_column : 3
    <ca0>   DW_AT_type        : <0xb8>
    <ca4>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><ca8>: Abbrev Number: 0
 <2><ca9>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <caa>   DW_AT_low_pc      : 0x8000518
    <cae>   DW_AT_high_pc     : 0x1c
 <3><cb2>: Abbrev Number: 6 (DW_TAG_variable)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <cb7>   DW_AT_decl_file   : 1
    <cb7>   DW_AT_decl_line   : 116
    <cb8>   DW_AT_decl_column : 3
    <cb9>   DW_AT_type        : <0xb8>
    <cbd>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><cc1>: Abbrev Number: 0
 <2><cc2>: Abbrev Number: 0
 <1><cc3>: Abbrev Number: 36 (DW_TAG_subprogram)
    <cc4>   DW_AT_external    : 1
    <cc4>   DW_AT_name        : (indirect string, offset: 0x12d3c): main
    <cc8>   DW_AT_decl_file   : 1
    <cc9>   DW_AT_decl_line   : 64
    <cca>   DW_AT_decl_column : 5
    <ccb>   DW_AT_prototyped  : 1
    <ccb>   DW_AT_type        : <0x86>
    <ccf>   DW_AT_low_pc      : 0x80004c0
    <cd3>   DW_AT_high_pc     : 0x18
    <cd7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cd9>   DW_AT_call_all_tail_calls: 1
 <1><cd9>: Abbrev Number: 37 (DW_TAG_subprogram)
    <cda>   DW_AT_name        : (indirect string, offset: 0x6b5e4): __disable_irq
    <cde>   DW_AT_decl_file   : 2
    <cdf>   DW_AT_decl_line   : 960
    <ce1>   DW_AT_decl_column : 27
    <ce2>   DW_AT_prototyped  : 1
    <ce2>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><ce3>: Abbrev Number: 0
  Compilation Unit @ offset 0xce4:
   Length:        0x265 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x267
   Pointer Size:  4
 <0><cf0>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <cf1>   DW_AT_producer    : (indirect string, offset: 0x3364c): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <cf5>   DW_AT_language    : 29	(C11)
    <cf6>   DW_AT_name        : (indirect string, offset: 0xc2b9a): ../Core/Src/stm32f4xx_hal_msp.c
    <cfa>   DW_AT_comp_dir    : (indirect string, offset: 0x359b7): /Users/sandeep/Documents/github-projects/frtos/free-rtos/led_tasks/Debug
    <cfe>   DW_AT_ranges      : 0x39
    <d02>   DW_AT_low_pc      : 0
    <d06>   DW_AT_stmt_list   : 0x842
    <d0a>   DW_AT_macros      : 0x1ec40
 <1><d0e>: Abbrev Number: 2 (DW_TAG_base_type)
    <d0f>   DW_AT_byte_size   : 1
    <d10>   DW_AT_encoding    : 6	(signed char)
    <d11>   DW_AT_name        : (indirect string, offset: 0x61583): signed char
 <1><d15>: Abbrev Number: 2 (DW_TAG_base_type)
    <d16>   DW_AT_byte_size   : 1
    <d17>   DW_AT_encoding    : 8	(unsigned char)
    <d18>   DW_AT_name        : (indirect string, offset: 0xbb710): unsigned char
 <1><d1c>: Abbrev Number: 2 (DW_TAG_base_type)
    <d1d>   DW_AT_byte_size   : 2
    <d1e>   DW_AT_encoding    : 5	(signed)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x906c6): short int
 <1><d23>: Abbrev Number: 2 (DW_TAG_base_type)
    <d24>   DW_AT_byte_size   : 2
    <d25>   DW_AT_encoding    : 7	(unsigned)
    <d26>   DW_AT_name        : (indirect string, offset: 0xb9f81): short unsigned int
 <1><d2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <d2b>   DW_AT_byte_size   : 4
    <d2c>   DW_AT_encoding    : 5	(signed)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xff40): long int
 <1><d31>: Abbrev Number: 4 (DW_TAG_typedef)
    <d32>   DW_AT_name        : (indirect string, offset: 0x7ba89): __uint32_t
    <d36>   DW_AT_decl_file   : 2
    <d37>   DW_AT_decl_line   : 79
    <d38>   DW_AT_decl_column : 25
    <d39>   DW_AT_type        : <0xd3d>
 <1><d3d>: Abbrev Number: 2 (DW_TAG_base_type)
    <d3e>   DW_AT_byte_size   : 4
    <d3f>   DW_AT_encoding    : 7	(unsigned)
    <d40>   DW_AT_name        : (indirect string, offset: 0x4a90e): long unsigned int
 <1><d44>: Abbrev Number: 2 (DW_TAG_base_type)
    <d45>   DW_AT_byte_size   : 8
    <d46>   DW_AT_encoding    : 5	(signed)
    <d47>   DW_AT_name        : (indirect string, offset: 0x58dc2): long long int
 <1><d4b>: Abbrev Number: 2 (DW_TAG_base_type)
    <d4c>   DW_AT_byte_size   : 8
    <d4d>   DW_AT_encoding    : 7	(unsigned)
    <d4e>   DW_AT_name        : (indirect string, offset: 0x28f36): long long unsigned int
 <1><d52>: Abbrev Number: 7 (DW_TAG_base_type)
    <d53>   DW_AT_byte_size   : 4
    <d54>   DW_AT_encoding    : 5	(signed)
    <d55>   DW_AT_name        : int
 <1><d59>: Abbrev Number: 2 (DW_TAG_base_type)
    <d5a>   DW_AT_byte_size   : 4
    <d5b>   DW_AT_encoding    : 7	(unsigned)
    <d5c>   DW_AT_name        : (indirect string, offset: 0xf63f): unsigned int
 <1><d60>: Abbrev Number: 4 (DW_TAG_typedef)
    <d61>   DW_AT_name        : (indirect string, offset: 0xcc70c): uint32_t
    <d65>   DW_AT_decl_file   : 3
    <d66>   DW_AT_decl_line   : 48
    <d67>   DW_AT_decl_column : 20
    <d68>   DW_AT_type        : <0xd31>
 <1><d6c>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d6d>   DW_AT_type        : <0xd60>
 <1><d71>: Abbrev Number: 9 (DW_TAG_array_type)
    <d72>   DW_AT_type        : <0xd60>
    <d76>   DW_AT_sibling     : <0xd81>
 <2><d7a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <d7b>   DW_AT_type        : <0xd59>
    <d7f>   DW_AT_upper_bound : 1
 <2><d80>: Abbrev Number: 0
 <1><d81>: Abbrev Number: 11 (DW_TAG_structure_type)
    <d82>   DW_AT_byte_size   : 136
    <d83>   DW_AT_decl_file   : 4
    <d84>   DW_AT_decl_line   : 596
    <d86>   DW_AT_decl_column : 9
    <d87>   DW_AT_sibling     : <0xef3>
 <2><d8b>: Abbrev Number: 3 (DW_TAG_member)
    <d8c>   DW_AT_name        : CR
    <d8f>   DW_AT_decl_file   : 4
    <d8f>   DW_AT_decl_line   : 598
    <d91>   DW_AT_decl_column : 17
    <d91>   DW_AT_type        : <0xd6c>
    <d95>   DW_AT_data_member_location: 0
 <2><d96>: Abbrev Number: 1 (DW_TAG_member)
    <d97>   DW_AT_name        : (indirect string, offset: 0x8777c): PLLCFGR
    <d9b>   DW_AT_decl_file   : 4
    <d9b>   DW_AT_decl_line   : 599
    <d9d>   DW_AT_decl_column : 17
    <d9d>   DW_AT_type        : <0xd6c>
    <da1>   DW_AT_data_member_location: 4
 <2><da2>: Abbrev Number: 1 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0x8777f): CFGR
    <da7>   DW_AT_decl_file   : 4
    <da7>   DW_AT_decl_line   : 600
    <da9>   DW_AT_decl_column : 17
    <da9>   DW_AT_type        : <0xd6c>
    <dad>   DW_AT_data_member_location: 8
 <2><dae>: Abbrev Number: 3 (DW_TAG_member)
    <daf>   DW_AT_name        : CIR
    <db3>   DW_AT_decl_file   : 4
    <db3>   DW_AT_decl_line   : 601
    <db5>   DW_AT_decl_column : 17
    <db5>   DW_AT_type        : <0xd6c>
    <db9>   DW_AT_data_member_location: 12
 <2><dba>: Abbrev Number: 1 (DW_TAG_member)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x9a59a): AHB1RSTR
    <dbf>   DW_AT_decl_file   : 4
    <dbf>   DW_AT_decl_line   : 602
    <dc1>   DW_AT_decl_column : 17
    <dc1>   DW_AT_type        : <0xd6c>
    <dc5>   DW_AT_data_member_location: 16
 <2><dc6>: Abbrev Number: 1 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x15b89): AHB2RSTR
    <dcb>   DW_AT_decl_file   : 4
    <dcb>   DW_AT_decl_line   : 603
    <dcd>   DW_AT_decl_column : 17
    <dcd>   DW_AT_type        : <0xd6c>
    <dd1>   DW_AT_data_member_location: 20
 <2><dd2>: Abbrev Number: 1 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x4064a): AHB3RSTR
    <dd7>   DW_AT_decl_file   : 4
    <dd7>   DW_AT_decl_line   : 604
    <dd9>   DW_AT_decl_column : 17
    <dd9>   DW_AT_type        : <0xd6c>
    <ddd>   DW_AT_data_member_location: 24
 <2><dde>: Abbrev Number: 1 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0xb7074): RESERVED0
    <de3>   DW_AT_decl_file   : 4
    <de3>   DW_AT_decl_line   : 605
    <de5>   DW_AT_decl_column : 17
    <de5>   DW_AT_type        : <0xd60>
    <de9>   DW_AT_data_member_location: 28
 <2><dea>: Abbrev Number: 1 (DW_TAG_member)
    <deb>   DW_AT_name        : (indirect string, offset: 0x15702): APB1RSTR
    <def>   DW_AT_decl_file   : 4
    <def>   DW_AT_decl_line   : 606
    <df1>   DW_AT_decl_column : 17
    <df1>   DW_AT_type        : <0xd6c>
    <df5>   DW_AT_data_member_location: 32
 <2><df6>: Abbrev Number: 1 (DW_TAG_member)
    <df7>   DW_AT_name        : (indirect string, offset: 0x5454a): APB2RSTR
    <dfb>   DW_AT_decl_file   : 4
    <dfb>   DW_AT_decl_line   : 607
    <dfd>   DW_AT_decl_column : 17
    <dfd>   DW_AT_type        : <0xd6c>
    <e01>   DW_AT_data_member_location: 36
 <2><e02>: Abbrev Number: 1 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0xb707e): RESERVED1
    <e07>   DW_AT_decl_file   : 4
    <e07>   DW_AT_decl_line   : 608
    <e09>   DW_AT_decl_column : 17
    <e09>   DW_AT_type        : <0xd71>
    <e0d>   DW_AT_data_member_location: 40
 <2><e0e>: Abbrev Number: 1 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0xf5d4): AHB1ENR
    <e13>   DW_AT_decl_file   : 4
    <e13>   DW_AT_decl_line   : 609
    <e15>   DW_AT_decl_column : 17
    <e15>   DW_AT_type        : <0xd6c>
    <e19>   DW_AT_data_member_location: 48
 <2><e1a>: Abbrev Number: 1 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x34120): AHB2ENR
    <e1f>   DW_AT_decl_file   : 4
    <e1f>   DW_AT_decl_line   : 610
    <e21>   DW_AT_decl_column : 17
    <e21>   DW_AT_type        : <0xd6c>
    <e25>   DW_AT_data_member_location: 52
 <2><e26>: Abbrev Number: 1 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0x575bf): AHB3ENR
    <e2b>   DW_AT_decl_file   : 4
    <e2b>   DW_AT_decl_line   : 611
    <e2d>   DW_AT_decl_column : 17
    <e2d>   DW_AT_type        : <0xd6c>
    <e31>   DW_AT_data_member_location: 56
 <2><e32>: Abbrev Number: 1 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0xb7088): RESERVED2
    <e37>   DW_AT_decl_file   : 4
    <e37>   DW_AT_decl_line   : 612
    <e39>   DW_AT_decl_column : 17
    <e39>   DW_AT_type        : <0xd60>
    <e3d>   DW_AT_data_member_location: 60
 <2><e3e>: Abbrev Number: 1 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x6f860): APB1ENR
    <e43>   DW_AT_decl_file   : 4
    <e43>   DW_AT_decl_line   : 613
    <e45>   DW_AT_decl_column : 17
    <e45>   DW_AT_type        : <0xd6c>
    <e49>   DW_AT_data_member_location: 64
 <2><e4a>: Abbrev Number: 1 (DW_TAG_member)
    <e4b>   DW_AT_name        : (indirect string, offset: 0x16cb8): APB2ENR
    <e4f>   DW_AT_decl_file   : 4
    <e4f>   DW_AT_decl_line   : 614
    <e51>   DW_AT_decl_column : 17
    <e51>   DW_AT_type        : <0xd6c>
    <e55>   DW_AT_data_member_location: 68
 <2><e56>: Abbrev Number: 1 (DW_TAG_member)
    <e57>   DW_AT_name        : (indirect string, offset: 0xb7092): RESERVED3
    <e5b>   DW_AT_decl_file   : 4
    <e5b>   DW_AT_decl_line   : 615
    <e5d>   DW_AT_decl_column : 17
    <e5d>   DW_AT_type        : <0xd71>
    <e61>   DW_AT_data_member_location: 72
 <2><e62>: Abbrev Number: 1 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0x9e3b6): AHB1LPENR
    <e67>   DW_AT_decl_file   : 4
    <e67>   DW_AT_decl_line   : 616
    <e69>   DW_AT_decl_column : 17
    <e69>   DW_AT_type        : <0xd6c>
    <e6d>   DW_AT_data_member_location: 80
 <2><e6e>: Abbrev Number: 1 (DW_TAG_member)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x2c10b): AHB2LPENR
    <e73>   DW_AT_decl_file   : 4
    <e73>   DW_AT_decl_line   : 617
    <e75>   DW_AT_decl_column : 17
    <e75>   DW_AT_type        : <0xd6c>
    <e79>   DW_AT_data_member_location: 84
 <2><e7a>: Abbrev Number: 1 (DW_TAG_member)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x82fa6): AHB3LPENR
    <e7f>   DW_AT_decl_file   : 4
    <e7f>   DW_AT_decl_line   : 618
    <e81>   DW_AT_decl_column : 17
    <e81>   DW_AT_type        : <0xd6c>
    <e85>   DW_AT_data_member_location: 88
 <2><e86>: Abbrev Number: 1 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0xb709c): RESERVED4
    <e8b>   DW_AT_decl_file   : 4
    <e8b>   DW_AT_decl_line   : 619
    <e8d>   DW_AT_decl_column : 17
    <e8d>   DW_AT_type        : <0xd60>
    <e91>   DW_AT_data_member_location: 92
 <2><e92>: Abbrev Number: 1 (DW_TAG_member)
    <e93>   DW_AT_name        : (indirect string, offset: 0xa2e13): APB1LPENR
    <e97>   DW_AT_decl_file   : 4
    <e97>   DW_AT_decl_line   : 620
    <e99>   DW_AT_decl_column : 17
    <e99>   DW_AT_type        : <0xd6c>
    <e9d>   DW_AT_data_member_location: 96
 <2><e9e>: Abbrev Number: 1 (DW_TAG_member)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x31c2a): APB2LPENR
    <ea3>   DW_AT_decl_file   : 4
    <ea3>   DW_AT_decl_line   : 621
    <ea5>   DW_AT_decl_column : 17
    <ea5>   DW_AT_type        : <0xd6c>
    <ea9>   DW_AT_data_member_location: 100
 <2><eaa>: Abbrev Number: 1 (DW_TAG_member)
    <eab>   DW_AT_name        : (indirect string, offset: 0xb70a6): RESERVED5
    <eaf>   DW_AT_decl_file   : 4
    <eaf>   DW_AT_decl_line   : 622
    <eb1>   DW_AT_decl_column : 17
    <eb1>   DW_AT_type        : <0xd71>
    <eb5>   DW_AT_data_member_location: 104
 <2><eb6>: Abbrev Number: 1 (DW_TAG_member)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x1b080): BDCR
    <ebb>   DW_AT_decl_file   : 4
    <ebb>   DW_AT_decl_line   : 623
    <ebd>   DW_AT_decl_column : 17
    <ebd>   DW_AT_type        : <0xd6c>
    <ec1>   DW_AT_data_member_location: 112
 <2><ec2>: Abbrev Number: 3 (DW_TAG_member)
    <ec3>   DW_AT_name        : CSR
    <ec7>   DW_AT_decl_file   : 4
    <ec7>   DW_AT_decl_line   : 624
    <ec9>   DW_AT_decl_column : 17
    <ec9>   DW_AT_type        : <0xd6c>
    <ecd>   DW_AT_data_member_location: 116
 <2><ece>: Abbrev Number: 1 (DW_TAG_member)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x73d75): RESERVED6
    <ed3>   DW_AT_decl_file   : 4
    <ed3>   DW_AT_decl_line   : 625
    <ed5>   DW_AT_decl_column : 17
    <ed5>   DW_AT_type        : <0xd71>
    <ed9>   DW_AT_data_member_location: 120
 <2><eda>: Abbrev Number: 1 (DW_TAG_member)
    <edb>   DW_AT_name        : (indirect string, offset: 0x67000): SSCGR
    <edf>   DW_AT_decl_file   : 4
    <edf>   DW_AT_decl_line   : 626
    <ee1>   DW_AT_decl_column : 17
    <ee1>   DW_AT_type        : <0xd6c>
    <ee5>   DW_AT_data_member_location: 128
 <2><ee6>: Abbrev Number: 1 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x40f6e): PLLI2SCFGR
    <eeb>   DW_AT_decl_file   : 4
    <eeb>   DW_AT_decl_line   : 627
    <eed>   DW_AT_decl_column : 17
    <eed>   DW_AT_type        : <0xd6c>
    <ef1>   DW_AT_data_member_location: 132
 <2><ef2>: Abbrev Number: 0
 <1><ef3>: Abbrev Number: 12 (DW_TAG_typedef)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x5a1b3): RCC_TypeDef
    <ef8>   DW_AT_decl_file   : 4
    <ef9>   DW_AT_decl_line   : 628
    <efb>   DW_AT_decl_column : 3
    <efc>   DW_AT_type        : <0xd81>
 <1><f00>: Abbrev Number: 2 (DW_TAG_base_type)
    <f01>   DW_AT_byte_size   : 8
    <f02>   DW_AT_encoding    : 4	(float)
    <f03>   DW_AT_name        : (indirect string, offset: 0xc33d2): long double
 <1><f07>: Abbrev Number: 13 (DW_TAG_subprogram)
    <f08>   DW_AT_external    : 1
    <f08>   DW_AT_name        : (indirect string, offset: 0xc2b8e): HAL_MspInit
    <f0c>   DW_AT_decl_file   : 1
    <f0d>   DW_AT_decl_line   : 63
    <f0e>   DW_AT_decl_column : 6
    <f0f>   DW_AT_prototyped  : 1
    <f0f>   DW_AT_low_pc      : 0x8000898
    <f13>   DW_AT_high_pc     : 0x50
    <f17>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f19>   DW_AT_call_all_calls: 1
 <2><f19>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <f1a>   DW_AT_low_pc      : 0x800089e
    <f1e>   DW_AT_high_pc     : 0x1c
    <f22>   DW_AT_sibling     : <0xf34>
 <3><f26>: Abbrev Number: 5 (DW_TAG_variable)
    <f27>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <f2b>   DW_AT_decl_file   : 1
    <f2b>   DW_AT_decl_line   : 70
    <f2c>   DW_AT_decl_column : 3
    <f2c>   DW_AT_type        : <0xd6c>
    <f30>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><f33>: Abbrev Number: 0
 <2><f34>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <f35>   DW_AT_low_pc      : 0x80008ba
    <f39>   DW_AT_high_pc     : 0x1c
 <3><f3d>: Abbrev Number: 5 (DW_TAG_variable)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x1706): tmpreg
    <f42>   DW_AT_decl_file   : 1
    <f42>   DW_AT_decl_line   : 71
    <f43>   DW_AT_decl_column : 3
    <f43>   DW_AT_type        : <0xd6c>
    <f47>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><f4a>: Abbrev Number: 0
 <2><f4b>: Abbrev Number: 0
 <1><f4c>: Abbrev Number: 0
  Compilation Unit @ offset 0xf4d:
   Length:        0xbea (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x33f
   Pointer Size:  4
 <0><f59>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <f5a>   DW_AT_producer    : (indirect string, offset: 0x3364c): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f5e>   DW_AT_language    : 29	(C11)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xc2ec0): ../Core/Src/stm32f4xx_hal_timebase_tim.c
    <f63>   DW_AT_comp_dir    : (indirect string, offset: 0x359b7): /Users/sandeep/Documents/github-projects/frtos/free-rtos/led_tasks/Debug
    <f67>   DW_AT_ranges      : 0x4c
    <f6b>   DW_AT_low_pc      : 0
    <f6f>   DW_AT_stmt_list   : 0xf05
    <f73>   DW_AT_macros      : 0x1ee13
 <1><f77>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <f78>   DW_AT_encoding    : 5	(signed)
    <f79>   DW_AT_byte_size   : 1
    <f79>   DW_AT_type        : <0x119a>
    <f7d>   DW_AT_decl_file   : 2
    <f7e>   DW_AT_decl_line   : 66
    <f7f>   DW_AT_decl_column : 1
    <f7f>   DW_AT_sibling     : <0x119a>
 <2><f83>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f84>   DW_AT_name        : (indirect string, offset: 0xc2c71): NonMaskableInt_IRQn
    <f88>   DW_AT_const_value : -14
 <2><f89>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xc2e5d): MemoryManagement_IRQn
    <f8e>   DW_AT_const_value : -12
 <2><f8f>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f90>   DW_AT_name        : (indirect string, offset: 0xc3085): BusFault_IRQn
    <f94>   DW_AT_const_value : -11
 <2><f95>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f96>   DW_AT_name        : (indirect string, offset: 0xc2fa9): UsageFault_IRQn
    <f9a>   DW_AT_const_value : -10
 <2><f9b>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xc2bba): SVCall_IRQn
    <fa0>   DW_AT_const_value : -5
 <2><fa1>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fa2>   DW_AT_name        : (indirect string, offset: 0xc2e73): DebugMonitor_IRQn
    <fa6>   DW_AT_const_value : -4
 <2><fa7>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fa8>   DW_AT_name        : (indirect string, offset: 0xc2efb): PendSV_IRQn
    <fac>   DW_AT_const_value : -2
 <2><fad>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fae>   DW_AT_name        : (indirect string, offset: 0xc30b3): SysTick_IRQn
    <fb2>   DW_AT_const_value : -1
 <2><fb3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xc2fff): WWDG_IRQn
    <fb8>   DW_AT_const_value : 0
 <2><fb9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fba>   DW_AT_name        : (indirect string, offset: 0xc2c68): PVD_IRQn
    <fbe>   DW_AT_const_value : 1
 <2><fbf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xc3189): TAMP_STAMP_IRQn
    <fc4>   DW_AT_const_value : 2
 <2><fc5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xc2f4b): RTC_WKUP_IRQn
    <fca>   DW_AT_const_value : 3
 <2><fcb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fcc>   DW_AT_name        : (indirect string, offset: 0xc2cd0): FLASH_IRQn
    <fd0>   DW_AT_const_value : 4
 <2><fd1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xc307c): RCC_IRQn
    <fd6>   DW_AT_const_value : 5
 <2><fd7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fd8>   DW_AT_name        : (indirect string, offset: 0xc2e85): EXTI0_IRQn
    <fdc>   DW_AT_const_value : 6
 <2><fdd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fde>   DW_AT_name        : (indirect string, offset: 0xc317e): EXTI1_IRQn
    <fe2>   DW_AT_const_value : 7
 <2><fe3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fe4>   DW_AT_name        : (indirect string, offset: 0xc2dbe): EXTI2_IRQn
    <fe8>   DW_AT_const_value : 8
 <2><fe9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fea>   DW_AT_name        : (indirect string, offset: 0xc3052): EXTI3_IRQn
    <fee>   DW_AT_const_value : 9
 <2><fef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ff0>   DW_AT_name        : (indirect string, offset: 0xc2c5d): EXTI4_IRQn
    <ff4>   DW_AT_const_value : 10
 <2><ff5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ff6>   DW_AT_name        : (indirect string, offset: 0xc2c2b): DMA1_Stream0_IRQn
    <ffa>   DW_AT_const_value : 11
 <2><ffb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ffc>   DW_AT_name        : (indirect string, offset: 0xc2e3e): DMA1_Stream1_IRQn
    <1000>   DW_AT_const_value : 12
 <2><1001>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1002>   DW_AT_name        : (indirect string, offset: 0xc2e0a): DMA1_Stream2_IRQn
    <1006>   DW_AT_const_value : 13
 <2><1007>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1008>   DW_AT_name        : (indirect string, offset: 0xc3130): DMA1_Stream3_IRQn
    <100c>   DW_AT_const_value : 14
 <2><100d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <100e>   DW_AT_name        : (indirect string, offset: 0xc2cf5): DMA1_Stream4_IRQn
    <1012>   DW_AT_const_value : 15
 <2><1013>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1014>   DW_AT_name        : (indirect string, offset: 0xc3040): DMA1_Stream5_IRQn
    <1018>   DW_AT_const_value : 16
 <2><1019>: Abbrev Number: 1 (DW_TAG_enumerator)
    <101a>   DW_AT_name        : (indirect string, offset: 0xc2c9f): DMA1_Stream6_IRQn
    <101e>   DW_AT_const_value : 17
 <2><101f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1020>   DW_AT_name        : (indirect string, offset: 0xc2ea0): ADC_IRQn
    <1024>   DW_AT_const_value : 18
 <2><1025>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1026>   DW_AT_name        : (indirect string, offset: 0xc3159): CAN1_TX_IRQn
    <102a>   DW_AT_const_value : 19
 <2><102b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <102c>   DW_AT_name        : (indirect string, offset: 0xc2cb1): CAN1_RX0_IRQn
    <1030>   DW_AT_const_value : 20
 <2><1031>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1032>   DW_AT_name        : (indirect string, offset: 0xc2fc7): CAN1_RX1_IRQn
    <1036>   DW_AT_const_value : 21
 <2><1037>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1038>   DW_AT_name        : (indirect string, offset: 0xc2fb9): CAN1_SCE_IRQn
    <103c>   DW_AT_const_value : 22
 <2><103d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <103e>   DW_AT_name        : (indirect string, offset: 0xc3033): EXTI9_5_IRQn
    <1042>   DW_AT_const_value : 23
 <2><1043>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1044>   DW_AT_name        : (indirect string, offset: 0xc2dd5): TIM1_BRK_TIM9_IRQn
    <1048>   DW_AT_const_value : 24
 <2><1049>: Abbrev Number: 1 (DW_TAG_enumerator)
    <104a>   DW_AT_name        : (indirect string, offset: 0xc2f38): TIM1_UP_TIM10_IRQn
    <104e>   DW_AT_const_value : 25
 <2><104f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1050>   DW_AT_name        : (indirect string, offset: 0xc2e26): TIM1_TRG_COM_TIM11_IRQn
    <1054>   DW_AT_const_value : 26
 <2><1055>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1056>   DW_AT_name        : (indirect string, offset: 0xc2e50): TIM1_CC_IRQn
    <105a>   DW_AT_const_value : 27
 <2><105b>: Abbrev Number: 1 (DW_TAG_enumerator)
